package com.example.girass.Data;

import com.example.girass.model.HeadZikrObject;
import com.example.girass.model.ZikrObject;

import java.util.UUID;

public class DataService {

   //     static let Shared = DataService()


        public DataService() {
        }

        private final String[] ChooseAzkarArray = {
            "سُـبْــحَــان الـلّــه",

            "الـحَـمْــدُ لِـلّـــه",

            "لا إلـه إلا الـلّــه",

            "الـلّــهُ أكــبــر",

            "لا حَوْلَ و لا قُـوّة إلا بالله",

            "أسْـتَـغْـفِــرُ الـلّــه",

            "أستغفر الله العظيم و أتوب إليه",

            "اللّهم صَـلِّ على مُـحَـمّـد  ﷺ ",

            "لا إله إلا الله وحده لا شريك له",

            "حَـسْـبِـيَ الـلّــه",

            "حسبي الله ونعم الوكيل",

            "سُـبْــحَــان الـلّــه و بِـحَـمْـدِه ",

            "سبحان الله و الحمد لله",

            "سبحان الله وبحمده سبحان الله العظيم",

            "لا إله إلا أنت سبحانك",

            "لا إله إلا أنت سبحانك إني كنت من الظالمين",};

    public String[] GetChosenAzkar() {
        return ChooseAzkarArray;
    }


    ////////////////////////////////////////////////////////////
    ////////////////////////////////////////////////////////////

    private final HeadZikrObject[] AllAzkarArray = {


            ///////////////////////////////////  أذكار الاستيقاظ من النوم  ////////////////////////////////

            ///////////////////////////////////  أذكار الاستيقاظ من النوم  ////////////////////////////////

            new HeadZikrObject("1", "اذكار الاستيقاظ من النوم أذكار ذكر الإستيقاظ", "أَذْكارُ الاسْتِيْقاظِ مِنَ النَّوْمِ", new ZikrObject[]{

                    new ZikrObject(UUID.randomUUID().toString(), "الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أمَاتَنَا وإِلَيْهِ النُّشُورُ", 1, "  البخاري مع الفتح ١١ / ١١٣ ومسلم ٤ / ٢٠٨٣."),
                    new ZikrObject(UUID.randomUUID().toString(), "لَا إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الحَمْدُ، وَهُوَ عَلَى كُلِّ شَيءٍ قَدِيرٌ ، سُبْحَانَ اللَّهِ ، والْحَمْدُ للَّهِ ، وَلَا إِلَهَ إِلاَّ الله ُ، وَاللهُ أَكْبَرُ ، وَلاَ حَوْلَ وَلا قُوَّة إِلاَّ بِاللَّهِ العَلِيِّ العَظِيمِ، رَبِّ اغْفِر لِي",

                            1,
                            "من قال ذلك غُفِرَ له، فإن دعا استجيب له، فإن قام فتوضأ ثم صلى قُبِلَتْ صلاته، البخاري مع الفتح ٣ / ٣٩ وغيره واللفظ لابن ماجه انظر صحيح ابن ماجه ٢ / ٣٣٥."),


                    new ZikrObject(UUID.randomUUID().toString(), "الحَمْدُ للَّهِ الَّذِي عَافَانِي في جَسَدِي ، وَرَدَّ عَلَيَّ رُوحِي ، وَأَذِنَ لِي بذِكْرِهِ", 1, "الترمذي ٥ / ٤٧٣ وانظر صحيح الترمذي ٣ / ١٤٤."),


                    new ZikrObject(UUID.randomUUID().toString()
                            , "إِنَّ فِي خَلْقِ السَّمَوَاتِ وَالْأَرْضِ وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ لَآيَـٰتٍ لأُولِي الأَلبابِ ۝ الَّذينَ يَذكُرونَ اللَّهَ قِيامًا وَقُعودًا وَعَلى جُنوبِهِم وَيَتَفَكَّرونَ في خَلقِ السَّماواتِ وَالأَرضِ رَبَّنا ما خَلَقتَ هذا باطِلًا سُبحانَكَ فَقِنا عَذابَ النّارِ ۝ رَبَّنا إِنَّكَ مَن تُدخِلِ النّارَ فَقَد أَخزَيتَهُ وَما لِلظّالِمينَ مِن أَنصارٍ ۝ رَبَّنا إِنَّنا سَمِعنا مُنادِيًا يُنادي لِلإيمانِ أَن آمِنوا بِرَبِّكُم فَآمَنّا رَبَّنا فَاغفِر لَنا ذُنوبَنا وَكَفِّر عَنّا سَيِّئَاتِنا وَتَوَفَّنا مَعَ الأَبرارِ ۝ رَبَّنا وَ آتِنا ما وَعَدتَنا عَلى رُسُلِكَ وَلا تُخزِنا يَومَ القِيامَةِ إِنَّكَ لا تُخلِفُ الميعادَ فَاستَجابَ لَهُم رَبُّهُم أَنّي لا أُضيعُ عَمَلَ عامِلٍ مِنكُم مِن ذَكَرٍ أَو أُنثى بَعضُكُم مِن بَعضٍ فَالَّذينَ هاجَروا وَأُخرِجوا مِن دِيارِهِم وَأوذوا في سَبيلي وَقاتَلوا وَقُتِلوا لَأُكَفِّرَنَّ عَنهُم سَيِّئَاتِهِم وَلَأُدخِلَنَّهُم جَنّاتٍ تَجري مِن تَحتِهَا الأَنهارُ ثَوابًا مِن عِندِ اللَّهِ وَاللَّهُ عِندَهُ حُسنُ الثَّوابِ ۝ لا يَغُرَّنَّـكَ تَقَلُّبُ الَّذينَ كَفَروا فِي البِلادِ ۝ مَتاعٌ قَليلٌ ثُمَّ مَأواهُم جَهَنَّمُ وَبِئسَ المِهادُ ۝ لكِنِ الَّذينَ اتَّقَوا رَبَّهُم لَهُم جَنّاتٌ تَجري مِن تَحتِهَا الأَنهارُ خالِدينَ فيها نُزُلًا مِن عِندِ اللَّهِ وَما عِندَ اللَّهِ خَيرٌ لِلأَبرارِ ۝ وَإِنَّ مِن أَهلِ الكِتابِ لَمَن يُؤمِنُ بِاللَّهِ وَما أُنزِلَ إِلَيكُم وَما أُنزِلَ إِلَيهِم خاشِعينَ لِلَّهِ لا يَشتَرونَ بِآياتِ اللَّهِ ثَمَنًا قَليلًا أُولئِكَ لَهُم أَجرُهُم عِندَ رَبِّهِم إِنَّ اللَّهَ سَريعُ الحِسابِ ۝ يا أَيُّهَا الَّذينَ آمَنُوا اصبِروا وَصابِروا وَرابِطوا وَاتَّقُوا اللَّهَ لَعَلَّكُم تُفلِحونَ ۝ "

                            , 1

                            , "الآيات من سورة آل عمران، ١٩٠ - ٢٠٠، البخاري مع الفتح ٨ / ٣٣٧ ومسلم ١ / ٥٣٠.")

            }),

            ///////////////////////////////////   دعاء لبس الثوب   ////////////////////////////////

            ///////////////////////////////////   دعاء لبس الثوب   ////////////////////////////////
            new HeadZikrObject("2", "دعاء لبس الثوب دعا ارتداء الثياب الملابس اللبس اللباس", "دُعَاءُ لُبْسِ الثَّوْبِ", new ZikrObject[]{
                    new ZikrObject(UUID.randomUUID().toString(), "الْحَمْدُ لِلَّهِ الَّذِي كَسَانِي هَذَا الثَّوْبَ ، ورَزَقَنيهِ مِنْ غيْرِ حَولٍ منِّي ولا قُوَّةٍ ...", 1, "أخرجه أهل السنن إلا النسائي انظر : إرواء الغليل ٧ / ٤٧ .")

            }),
            ///////////////////////////////////   دعاء لبس الثوب الجديد   ////////////////////////////////

            ///////////////////////////////////   دعاء لبس الثوب  الجديد ////////////////////////////////


            new HeadZikrObject("3", "دعاء لبس الثوب الجديد دعا ارتداء الثياب اللباس اللبس", "دُعَاءُ لُبْسِ الثَّوْبِ الجَدِيدِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ لَكَ الحَمْدُ أنْتَ كَسَوْتَنِيهِ ، أسْألُكَ مِنْ خَيرهِ وخَيْرِ مَا صُنِعَ لَهُ ، وأعوذُ بِكَ مِنْ شَرِّهِ وشَرِّ ما صُنِعَ لَهُ", 1, "أبو داود والترمذي والبغوي وانظر مختصر شمائل الترمذي للألباني ص ٤٧.")
            }),


            ///////////////////////////////////   الدُّعَاءُ لِمَنْ لَبِسَ ثَوْباً جَدِيداً   ////////////////////////////////

            ///////////////////////////////////   الدُّعَاءُ لِمَنْ لَبِسَ ثَوْباً جَدِيداً ////////////////////////////////


            new HeadZikrObject("4", "الدعاء لمن لبس ثوبا جدبدا", "الدُّعَاءُ لِمَنْ لَبِسَ ثَوْباً جَدِيداً", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "تُبْلِي وَيُخْلِفُ الله تَعَالَى", 1, "أخرجه أبو داود ٤ / ٤١، وانظر صحيح أبي داود ٢ / ٧٦٠."),


                    new ZikrObject(UUID.randomUUID().toString(), "الْبَسْ جَدِيداً، وعِشْ حَمِيداً، وَمُتْ شَهِيداً", 1, "ابن ماجه ٢ / ١١٧٨ والبغوي ١٢ / ٤١ وانظر صحيح ابن ماجه ٢ / ٢٧٥.")


            }),

            ///////////////////////////////////   مَا يَقُولُ إذَا وَضَعَ ثَوْبَهُ   ////////////////////////////////

            ///////////////////////////////////  مَا يَقُولُ إذَا وَضَعَ ثَوْبَهُ ////////////////////////////////


            new HeadZikrObject("5", " الثوب ما يقول اذا وضع ثوبه إذا ارتدى لبس", "مَا يَقُولُ إذَا وَضَعَ ثَوْبَهُ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "بِسْمِ اللهِ", 1, "لترمذي ٢ / ٥٠٥ وغيره وانظر الإرواء برقم ٥٠ وصحيح الجامع ٣ / ٢٠٣.")

            }),


            ///////////////////////////////////  دُعَاءُ دُخُولِ الْخَلاَءِ    ////////////////////////////////

            ///////////////////////////////////  دُعَاءُ دُخُولِ الْخَلاَءِ  ////////////////////////////////


            new HeadZikrObject("6", "دعاء دخول الخلاء دعا ذكر الحمام", "دُعَاءُ دُخُولِ الْخَلاَءِ", new ZikrObject[]

                    {


                            new ZikrObject(UUID.randomUUID().toString(),
                                    "[بِسْمِ اللهِ] اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِنَ الخُبْثِ والخَبَائِثِ",
                                    1,
                                    "أخرجه البخاري ١ / ٤٥ ومسلم ١ / ٢٨٣ وزيادة بسم الله في أوله أخرجها سعيد بن منصور. انظر فتح الباري ١ / ٢٤٤.")

                    }),
            ///////////////////////////////////  دعاء الخُرُوج مِنَ الْخَلاَءِ     ////////////////////////////////

            ///////////////////////////////////  دعاء الخُرُوج مِنَ الْخَلاَءِ   ////////////////////////////////


            new HeadZikrObject("7", "دعاء الخروج من الخلاء دعا ذكر الحمام", "دعاء الخُرُوج مِنَ الْخَلاَءِ ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "غُفْرَانَكَ", 1

                            , "أخرجه أصحاب السنن إلا النسائي \n أبو داود برقم ٣٠ ، والترمذي برقم ٧ ، وابن ماجة برقم ٣٠٠ ، والنسائي في عمل اليوم والليلة برقم ٧٩ ، وصححه الألباني . "

                    )

            }),


            ///////////////////////////////////  الذِّكْرُ قَبْلَ الْوُضُوءِ     ////////////////////////////////

            ///////////////////////////////////  الذِّكْرُ قَبْلَ الْوُضُوءِ   ////////////////////////////////


            new HeadZikrObject("8", "", "الذِّكْرُ قَبْلَ الْوُضُوءِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "بِسْمِ اللهِ", 1, "أبو داود وابن ماجه وأحمد وانظر إرواء الغليل ١ / ١٢٢.")


            }),


            ///////////////////////////////////  الذِّكْرُ بَعْدَ الفَرَاغِ مِنَ الوُضُوءِ     ////////////////////////////////

            ///////////////////////////////////  الذِّكْرُ بَعْدَ الفَرَاغِ مِنَ الوُضُوءِ   ////////////////////////////////


            new HeadZikrObject("9", "الذكر بعد الفراغ من الوضوء ذكر الانتهاء بعد الوضوء", "الذِّكْرُ بَعْدَ الفَرَاغِ مِنَ الوُضُوءِ", new ZikrObject[]

                    {


                            new ZikrObject(UUID.randomUUID().toString(),
                                    "أشْهَدُ أنْ لا إلَهَ إلاَّ اللهُ وَحْدَهُ لا شَرِيْكَ لَهُ ، وأشْهَدُ أنَّ مُحَمَّداً عَبْدُهُ ورَسُولُهُ ... ",
                                    1, "مسلم ١ / ٢٠٩."),

                            new ZikrObject(UUID.randomUUID().toString(),
                                    "اللَّهُمَّ اجْعَلْنِي مِنَ التَّوَّابينَ، واجْعَلْنِي مِنَ الْمُتَطَهِّرِينَ",
                                    1, "الترمذي ١ / ٦٧ وانظر صحيح الترمذي ١ / ١٨."),

                            new ZikrObject(UUID.randomUUID().toString(),
                                    "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لا إِلَهَ إلاَّ أَنْتَ، أَسْتَغْفِرُكَ وأَتُوبُ إلَيْكَ",
                                    1, "النسائي في عمل اليوم والليلة ص ١٧٣ وانظر إرواء الغليل ١ / ١٣٥ و ٣ / ٩٤.")


                    }),

            ///////////////////////////////////  الذِّكْرُ عِنْدَ الخُرُوجِ مِنَ المَنْزِلِ     ////////////////////////////////

            ///////////////////////////////////  الذِّكْرُ عِنْدَ الخُرُوجِ مِنَ المَنْزِلِ   ////////////////////////////////


            new HeadZikrObject("10", "الذكر عند الخروج من المنزل البيت ذكر دعاء دعا أذكار اذكار", "الذِّكْرُ عِنْدَ الخُرُوجِ مِنَ المَنْزِلِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "بِسْمِ اللَّهِ ، تَوَكَّلْتُ عَلَى اللَّهِ ، وَلاَ حَوْلَ وَلا قُوَّةَ إلاَّ بِاللَّهِ", 1, "أبو داود ٤ / ٣٢٥ والترمذي ٥ / ٤٩٠ وانظر صحيح الترمذي ٣ / ١٥١."),

                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ إنِّي أعُوذُ بِكَ أنْ أَضِلَّ، أوْ أُضَلَّ، أوْ أَزِلَّ، أوْ أُزَلَّ، أوْ أَظْلِمَ، أوْ أُظْلَمَ، أوْ أجْهَلَ، أوْ يُجْهَلَ عَلَيَّ", 1, "أهل السنن وانظر صحيح الترمذي ٣ / ١٥٢ وصحيح ابن ماجه ٢ / ٣٣٦.")


            }),

            ///////////////////////////////////  الذِّكْرُ عِنْدَ دُخُولِ المَنْزِلِ      ////////////////////////////////

            ///////////////////////////////////  الذِّكْرُ عِنْدَ دُخُولِ المَنْزِلِ    ////////////////////////////////


            new HeadZikrObject("11", "الذكر عند دخول المنزل البيت دعاء دعا ذكر أذكار اذكار", "الذِّكْرُ عِنْدَ دُخُولِ المَنْزِلِ", new ZikrObject[]{
                    new ZikrObject(UUID.randomUUID().toString()

                            ,
                            " اللهم إني أسألك خَيْرَ المَوْلَج و خَيْرَ المَخْرَج ، بِسْمِ اللهِ وَلَجْنَا، وبِسْمِ اللَّهِ خَرَجْنَا، وعَلَى اللَّهِ رَبِّنا تَوَكَّلْنَا\n  ثُمَّ لِيُسَلِّمْ عَلَى أهْلِهِ  "

                            , 1

                            ,
                            "أخرجه أبو داود ٤ / ٣٢٥، وحسن إسناده العلامة ابن باز في تحفة الأخيار ص ٢٨، \n وفي الصحيح : إذا دخل الرجل بيته فذكر الله عند دخوله وعند طعامه قال الشيطان لا مبيت لكم ولا عشاء . \n مسلم برقم ٢٠١٨."

                    )


            }),

            ///////////////////////////////////  دُعَاءُ الذَّهَابِ إلَى المَسْجِدِ      ////////////////////////////////

            ///////////////////////////////////  دُعَاءُ الذَّهَابِ إلَى المَسْجِدِ    ////////////////////////////////


            new HeadZikrObject("12", "دعاء الذهاب إلى المسجد الجامع للمسجد دعا ذكر أذكار اذكار", "دُعَاءُ الذَّهَابِ إلَى المَسْجِدِ", new ZikrObject[]

                    {


                            new ZikrObject(UUID.randomUUID().toString(),
                                    "اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُوراً، وَفِي لِسَانِي نُوراً، وَفِي سَمْعِي نُوراً، وَفِي بَصَرِي نُوراً، ومِنْ فَوْقِي نُوراً، وَمِنْ تَحْتِي نُوراً، وَعَنْ يَمِينِي نُوراً، وَعَنْ شِمَالِي نُوراً، وَمِنْ أمَامِي نُوراً، وَمِنْ خَلْفِي نُوراً، واجْعَلْ في نَفْسِي نُوراً، وأعْظِمْ لِي نُوراً، وَعَظِّمْ لِي نُوراً، واجْعَلْ لِي نُوراً، وَاجْعَلْنِي نُوراً، اللَّهُمَّ أعْطِنِي نُوراً، واجْعَلْ فِي عَصَبِي نُوراً، وَفِي لَحْمِي نُوراً، وَفِي دَمِي نُوراً، وفِي شَعْرِي نُوراً، وفِي بَشَرِي نُوراً",
                                    1,
                                    "جميع هذه الألفاظ في البخاري مع الفتح ١١ / ١١٦ برقم ٦٣١٦ ومسلم ١ / ٥٢٩ ، ٥٣٠ برقم ٧٦٣."),


                            new ZikrObject(UUID.randomUUID().toString(),
                                    "اللَّهُمَّ اجْعَلْ لِي نُوراً فِي قَبْرِي ... ونُوراً فِي عِظَامِي",
                                    1, "الترمذي برقم ٣٤١٩، ٥ / ٤٨٣."),

                            new ZikrObject(UUID.randomUUID().toString(),
                                    "[ وَزِدْنِي نُوراً، وَزِدْنِي نُوراً، وَزِدْنِي نُوراً ]", 1,
                                    "أخرجه البخاري في الأدب المفرد برقم ٦٩٥، ص ٢٥٨ وصحح إسناده الألباني في صحيح الأدب المفرد برقم ٥٣٦."),

                            new ZikrObject(UUID.randomUUID().toString(),
                                    "[ وَهَبْ لِي نُوراً عَلَى نُورٍ ]", 1,
                                    "ذكره ابن حجر في فتح الباري وعزاه إلى ابن أبي عاصم في كتاب الدعاء، انظر الفتح ١١ / ١١٨ وقال: فاجتمع من اختلاف الروايات خمس وعشرون خصلة.")


                    }),


            ///////////////////////////////////  دُعَاءُ دُخُولِ المَسْجِدِ       ////////////////////////////////

            ///////////////////////////////////  دُعَاءُ دُخُولِ المَسْجِدِ     ////////////////////////////////


            new HeadZikrObject("13", "دعاء دخول المسجد  الجامع دعا ذكر أذكار اذكار", "دُعَاءُ دُخُولِ المَسْجِدِ", new ZikrObject[]

                    {


                            new ZikrObject(UUID.randomUUID().toString(),
                                    "(( يَبْدَأُ بِرِجْلِهِ اليُمْنَى )) ، ويقول : (( أعُوذُ باللَّهِ العَظِيمِ ، وَبِوَجْهِهِ الكَرِيمِ ، وسُلْطَانِهِ القَدِيمِ ، مِنَ الشَّيْطانِ الرَّجِيمِ ))",
                                    1, "أبو داود وانظر صحيح الجامع برقم ٤٥٩١."),


                            new ZikrObject(UUID.randomUUID().toString()

                                    ,
                                    " [ بسم اللهِ، وَالصَّلاةُ ] \n [ وَالسَّلامُ عَلَى رَسُولِ الله ] \n [ اللَّهُمَّ افْتَحْ لِي أبْوَابَ رَحْمَتِكَ ]"

                                    , 1

                                    ,
                                    "رواه ابن السني برقم ٨٨ وحسنه الألباني. \n أبو داود ١ / ١٢٦ وانظر صحيح الجامع ١ / ٥٢٨. \n مسلم ١ / ٤٩٤. وفي سنن ابن ماجه من حديث فاطمة رضي الله عنها اللهم اغفر لي ذنوبي وافتح لي أبواب رحمتك  \n وصححه الألباني لشواهده انظر صحيح ابن ماجه ١ /١٢٨-١٢٩ .")


                    }),


            ///////////////////////////////////  دُعَاءُ الخُرُوجِ مِنَ المَسْجِد    ////////////////////////////////

            ///////////////////////////////////  دُعَاءُ الخُرُوجِ مِنَ المَسْجِد   ////////////////////////////////


            new HeadZikrObject("14", "دعاء الخروج من المسجد الجامع دعاء دعا ذكر", "دُعَاءُ الخُرُوجِ مِنَ المَسْجِد", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString()

                            , "(( يَبْدَأُ بِرِجْلِهِ الْيُسْرَى )) ، وَيَقُولُ : (( بِسْمِ اللَّهِ وَالصَّلاةُ وَالسَّلامُ عَلَى رَسُولِ اللَّهِ ، اللَّهُمَّ إنِّي أَسْأَلُكَ مِنْ فَضْلِكَ ، اللَّهُمَّ اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيم ))"

                            , 1

                            , "انظر تخريج روايات الحديث السابق رقم (٢٠) و زيادة [ اللهم اعصمني من الشيطان الرجيم ]  لابن ماجه. انظر صحيح ابن ماجه ١ / ١٢٩ . ")


            }),


            ///////////////////////////////////  أذْكَارُ الأَذَانِ    ////////////////////////////////

            ///////////////////////////////////  أذْكَارُ الأَذَانِ   ////////////////////////////////


            new HeadZikrObject("15", "أذكار الأذان اذكار الاذان ذكر دعاء دعا", "أذْكَارُ الأَذَانِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString()

                            , " يَقُولُ مِثْلَ مَا يَقُولُ المُؤَذِّنُ إلاَّ فِي (( حَيَّ عَلَى الصَّلاةِ وَ حَيَّ عَلَى الفَلاَحِ )) فَيَقُولُ : لاَ حَوْلَ وَلا قُوَّةَ إلاَّ باللَّهِ"

                            , 1

                            , "البخاري ١ / ١٥٢ ومسلم ١ / ٢٨٨."),


                    new ZikrObject(UUID.randomUUID().toString()

                            , "يقولُ : وأنَا أشهَدُ أنْ لا إلهَ إلا اللهُ وحْدَهُ لا شَرِيْكَ لهُ ، وأنَّ مُحمَّداً عبدُهُ ورَسُولُهُ، رَضِيتُ باللَّهِ رَبًّا، وبمُحَمَدٍ رَسُولاً ، وبالإسْلامِ دِيناً"

                            , 1, "مسلم ١ / ٢٩٠."),


                    new ZikrObject(UUID.randomUUID().toString(), "يَقُولَ ذَلِكَ عَقِبَ تَشَهُّدِ المُؤَذِّنِ", 1, "ابن خزيمة ١ / ٢٢٠."),

                    new ZikrObject(UUID.randomUUID().toString(), "يُصَلِّي عَلَى النَّبِي - صلى الله عليه وسلم - بَعْدَ فَرَاغِهِ مِنْ إجَابَةِ المُؤَذِّنِ", 1, "مسلم ١ / ٢٨٨."),


                    new ZikrObject(UUID.randomUUID().toString()

                            , "يَقُولُ : (( اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ ، والصَّلاةِ القَائِمَةِ ، آتِ مُحَمَّداً الوَسِيْلَةَ والفَضِيْلَةَ ، وابْعَثْهُ مَقَاماً مَحْمُوداً الَّذِي وَعَدْتَهُ ، [ إنَّكَ لا تُخْلِفُ المِيْعَادِ ] ))"

                            , 1, "البخاري ١ / ١٥٢ وما بين المعكوفين للبيهقي ١ / ٤١٠ وحسن إسناده العلامة عبد العزيز بن باز في تحفة الأخيار ص ٣٨."),


                    new ZikrObject(UUID.randomUUID().toString(), "(( يَدْعُو لِنَفْسِهِ بَيْنَ الأَذَانِ والإقَامَةِ ؛ فَإنَّ الدُّعَاءَ حِيْنَئذٍ لا يُرَدُّ ))", 1, "الترمذي وأبو داود وأحمد وانظر إرواء الغليل ١ / ٢٦٢.")


            }),

            ///////////////////////////////////  دُعَاءُ الاسْتِفْتَاحِ    ////////////////////////////////

            ///////////////////////////////////  دُعَاءُ الاسْتِفْتَاحِ   ////////////////////////////////


            new HeadZikrObject("16", "دعاء الإستفتاح دعاء الاستفتاح  الصلاة دعا أدعية ادعية", "دُعَاءُ الاسْتِفْتَاحِ", new ZikrObject[]{
                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ بَاعِدْ بَيْنِي وبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ المَشْرِقِ والمَغْرِبِ، اللَّهُمَّ نَقِّنِي مِنْ خَطَايَايَ ، كَمَا يُنَقَّى الثَّوْبُ الأبْيَضُ مِنَ الدَّنَسِ ، اللَّهُمَّ اغْسِلْنِي مِنْ خَطَايَايَ ، بالثَّلْجِ والمَاءِ والبَرَدِ", 1, "البخاري ١ / ١٨١ ومسلم ١ / ٤١٩."),
                    new ZikrObject(UUID.randomUUID().toString(), "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ ، وتَبَارَكَ اسْمُكَ ، وتَعَالَى جَدُّكَ ، ولاَ إلَهَ غَيْرُكَ", 1, "أخرجه أصحاب السنن الأربعة وانظر صحيح الترمذي ١ / ٧٧ وصحيح ابن ماجه ١ / ١٣٥"),


                    new ZikrObject(UUID.randomUUID().toString(), "وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَوَاتِ والأرْضَ حَنِيفاً ومَا أنَا مِنَ المُشْرِكينَ ، إنَّ صَلاتِي، وَنُسُكِي، وَمَحْيَايَ، ومَمَاتِي للَّهِ رَبِّ العَالَمينَ ، لا شَرِيْكَ لَهُ، وبِذَلِكَ أُمِرْتُ، وأَنَا مِنَ المُسْلِمينَ . اللَّهُمَّ أنْتَ الْمَلِكُ لا إلَهَ إلاَّ أنْتَ، أنْتَ رَبِّي، وأَنَا عَبْدُكَ، ظَلَمْتُ نَفْسِي، واعْتَرَفْتُ بِذَنْبِي فَاغْفِر لِي ذُنُوبِي جَمِيعاً إنَّهُ لا يَغْفِرُ الذُّنُوبَ إلاَّ أنْتَ، وَاهْدِنِي لأحْسَنِ الأخْلاَقِ لاَ يَهْدِي لأحْسَنِهَا إلاَّ أنْتَ واصْرِفْ عَنِّي سَيِّئَهَا لا يَصْرِفُ عَنِّي سَيِّئَهَا إلاَّ أنْتَ، لَبَّيْكَ وسَعْدَيْكَ، والْخَيْرُ كُلُّهُ بِيَدَيْكَ، والشَّرُّ لَيْسَ إليْكَ، أنَا بِكَ وإلَيْكَ، تَبَارَكْتَ وتَعَالَيْتَ، أسْتَغْفِرُكَ وأتُوْبُ إلَيْكَ", 1, "أخرجه مسلم ١ / ٥٣٤."),


                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ رَبَّ جِبْرَائيلَ ، ومِيكَائيْلَ، وإسْرَافيْلَ ، فَاطِرَ السَّمَوَاتِ والأرْضِ ، عَالِمَ الغَيْبِ والشَّهَادَةِ ، أنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ ، اهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنَ الحَقِّ بإذْنِكَ ، إنَّكَ تَهْدِي مَنْ تَشَاءُ إلَى صِرَاطٍ مُسْتَقِيمٍ", 1, "أخرجه مسلم ١ / ٥٣٤."),


                    new ZikrObject(UUID.randomUUID().toString(), "اللهُ أكْبَرُ كَبيراً، اللهُ أكْبَرُ كَبيراً، اللهُ أكْبَرُ كَبيراً، والحَمْدُ للَّهِ كَثيراً، والحَمْدُ للَّهِ كَثِيراً، وَالحَمْدُ للَّهِ كَثِيراً، وَسُبْحَانَ اللَّهِ بُكْرَةً وأصِيلاً (ثَلاثاً) أعُوذُ با للَّهِ مِنَ الشَّيْطَانِ : مِنْ نَفْخِهِ وَنَفْثِهِ، وهَمْزِهِ", 3, "أخرجه أبو داود ١ / ٢٠٣ وابن ماجه ١ / ٢٦٥ وأحمد ٤ / ٨٥ وأخرجه مسلم عن ابن عمر رضي الله عنهما بنحوه وفيه قصة ١ / ٤٢٠."),


                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ لَكَ الحَمْدُ أنْتَ نُورُ السَّمَوَاتِ والأرْضِ ومَنْ فِيهنَّ ، ولَكَ الحَمْدُ أنْتَ قَيِّمُ السَّمَوَاتِ والأرْضِ ومَنْ فيهنَّ ، [ وَلَكَ الحَمْدُ أنْتَ رَبُّ السَّمَوَاتِ والأرْضِ ومَنْ فِيهنّ ]، [ وَلَكَ الحَمْدُ لَكَ مُلْكُ السَّمَوَاتِ والأرْضِ ومَنْ فِيهنّ ] [ وَلَكَ الحَمْدُ أنْتَ مَلِكُ السَّمَوَاتِ والأرْضِ ] [ وَلَكَ الحَمْدُ ] [ أنْتَ الحَقُّ، وَوَعْدُكَ الحَقُّ، وقَوْلُكَ الحَقُّ، ولِقَاؤُكَ الحَقُّ، والجَنَّةُ حَقٌّ، والنَّارُ حَقٌّ، والنَّبِيُّونَ حَقٌّ، وَمُحَمَّدٌ - صلى الله عليه وسلم - حَقٌّ، والسَّاعَةُ حَقٌّ ] [ اللَّهُمَّ لَكَ أسْلَمْتُ، وعَلَيْكَ تَوَكَّلْتُ، وبِكَ آَمَنْتُ، وإلَيْكَ أنَبْتُ، وَبِكَ خَاصَمْتُ، وإليْكَ حَاكَمْتُ. فاغْفِرْ لِي مَا قَدَّمْتُ، ومَا أخَّرْتُ، ومَا أسْرَرْتُ، ومَا أعْلَنْتُ ] [ و ما أنت أعلم به مني ] [ أنْتَ  المُقَدِّمُ، وأنْتَ المُؤَخِّرُ لا إلَهَ إلاَّ أنْتَ ] أنْتَ إلَهِي لَا إِلَهَ إلاَّ أنْتَ \n [ و لا حَوْل و لا قوة إلا بالله ] "

                            , 1, " كان النبي صلى الله عليه وسلم يقوله إذا قام من الليل يتهجد. \n  البخاري مع الفتح ٣ / ٣ و ١١ / ١١٦ و ١٣ / ٣٧١، ٤٢٣، ٤٦٥ ومسلم مختصرا بنحوه ١ / ٥٣٢.")

            }),


            ///////////////////////////////////  دُعَاءُ الرُّكُوعِ    ////////////////////////////////

            ///////////////////////////////////  دُعَاءُ الرُّكُوعِ   ////////////////////////////////


            new HeadZikrObject("17", "دعاء الركوع دعا  الصلاة الركوع ذكر أذكار اذكار", "دُعَاءُ الرُّكُوعِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "سُبْحَانَ رَبِّي العَظِيمِ", 3, "أخرجه أهل السنن وأحمد وانظر صحيح الترمذي ١ / ٨٣."),

                    new ZikrObject(UUID.randomUUID().toString(), "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِي", 1, "البخاري ١ / ٩٩ ومسلم ١ / ٣٥٠."),

                    new ZikrObject(UUID.randomUUID().toString(), "سُبُّوحٌ ، قُدُّوسٌ ، رَبُّ المَلائِكَةِ وَالرُّوحِ", 1, "مسلم ١ / ٣٥٣ وأبو داود ١ / ٢٣٠."),

                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ لَكَ رَكَعْتُ ، وَبِكَ آمَنْتُ ، ولَكَ أسْلَمْتُ ، خَشَعَ لَكَ سَمْعِي ، وَبَصَرِي، وَمُخِّي ، وَعَظْمِي ، وعَصَبِي ، [ وَمَا اسْتَقَلَّت بهِ قَدَمي ]", 1, "مسلم ١ / ٥٣٤ والأربعة إلا ابن ماجه،و مابين المعكوفين لفظ ابن خزيمه برقم ٦٠٧ ، وابن حبان برقم ١٩٠١."),

                    new ZikrObject(UUID.randomUUID().toString(), "سُبْحَانَ ذِي الجَبَرُوتِ ، والمَلَكُوتِ ، والكِبْرِيَاءِ ، والعَظَمَةِ", 1, "أبو داود ١ / ٢٣٠ والنسائي وأحمد وإسناده حسن.")

            }),

            /////////////////////////////////// دُعَاءُ الرَّفْع مِنَ الرُّكُوعِ    ////////////////////////////////

            ///////////////////////////////////  دُعَاءُ الرَّفْع مِنَ الرُّكُوعِ   ////////////////////////////////


            new HeadZikrObject("18", "دعاء الرفع القيام من الركوع الصلاة دعا ذكر أذكار اذكار", "دُعَاءُ الرَّفْع مِنَ الرُّكُوعِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "سَمِعَ اللهُ لِمَنْ حَمِدَهُ", 1, "البخاري مع الفتح ٢ / ٢٨٢."),

                    new ZikrObject(UUID.randomUUID().toString(), "رَبَّنا وَلَكَ الحَمْدُ ، حَمْداً كَثيراً طَيِّباً مُبَاركاً فيهِ", 1, "البخاري مع الفتح ٢ / ٢٨٤."),

                    new ZikrObject(UUID.randomUUID().toString(), "مِلْءَ السَّمَوَات ومِلءَ الأرضِ ومَا بَيْنَهُما، ومِلْء ما شِئْتَ مِنْ شَيءٍ بَعْدُ، أهْلَ الثَّناءِ والمَجْدِ، أحَقُّ ما قَالَ العَبْدُ، وكُلُّنا لَكَ عَبْدٌ، اللهُمَّ لا مَانِعَ لِمَا أعْطَيتَ، ولا مُعْطِي لِمَا مَنَعْتَ، ولا يَنْفَعُ ذَا الجَدِّ مِنْكَ الجَدُّ", 1, "مسلم ١ / ٣٤٦.")

            }),


            ///////////////////////////////////  دُعَاءُ السُّجُودِ    ////////////////////////////////

            ///////////////////////////////////  دُعَاءُ السُّجُودِ  ////////////////////////////////


            new HeadZikrObject("19", "دعاء السجود سجدة الصلاة دعا ذكر أذكار اذكار", "دُعَاءُ السُّجُودِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "سُبْحَانَ رَبِّيَ الأعْلَى", 3, "أخرجه أهل السنن وأحمد وانظر صحيح الترمذي ١ / ٨٣."),

                    new ZikrObject(UUID.randomUUID().toString(), "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ ، اللَّهُمَّ اغْفِرْ لِي", 1, "البخاري ومسلم وتقدم تخريجه برقم ٣٤."),

                    new ZikrObject(UUID.randomUUID().toString(), "سُبُّوحٌ، قُدُّوسٌ ، رَبُّ المَلائِكَةِ والرُّوحِ", 1, "مسلم ١ / ٥٣٣ وتقدم برقم ٣٥."),

                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ لَكَ سَجَدْتُ، وَبِكَ آمَنْتُ، وَلَكَ أسْلَمْتُ، سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ، وَصَوَّرَهُ، وَشَقَّ سَمْعَهُ وبَصَرَهُ، تَبَارَكَ اللَّهُ أحْسَنُ الخَالِقينَ", 1, "مسلم ١ / ٥٣٤ وغيره."),

                    new ZikrObject(UUID.randomUUID().toString(), "سُبْحَانَ ذِي الجَبَرُوتِ، والمَلَكُوتِ، والكِبْرِيَاءِ، والعَظَمَةِ", 1, "أبو داود ١ / ٢٣٠ وأحمد، والنسائي وصححه الألباني في صحيح أبي داود ١ / ١٦٦."),

                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ، دِقَّهُ وَجِلّهُ، وَأوَّلَهُ وآخِرَهُ، وعَلاَنِيَتَهُ وَسِرَّهُ", 1, "مسلم ١ / ٣٥٠."),

                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ إنِّي أَعُوْذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وأَعُوذُ بِكَ مِنْكَ، لا أُحْصِي ثَنَاءً عَلَيْكَ، أنْتَ كَمَا أثْنَيْتَ عَلَى نَفْسِكَ", 1, "مسلم ١ / ٣٥٢.")


            }),


            ///////////////////////////////////  دُعَاءُ الجَلسَةِ بَيْنَ السَّجْدَتَينِ    ////////////////////////////////

            ///////////////////////////////////  دُعَاءُ الجَلسَةِ بَيْنَ السَّجْدَتَينِ  ////////////////////////////////


            new HeadZikrObject("20", "دعاء الجلسة بين السجدتين الجلوس الصلاة السجودين ذكر أدعية ادعية أذكار اذكار", "دُعَاءُ الجَلسَةِ بَيْنَ السَّجْدَتَينِ", new ZikrObject[]{

                    new ZikrObject(UUID.randomUUID().toString(), "رَبِّ اغْفِرْ لِي رَبِّ اغْفِرْ لِي", 1, "أبو داود ١ / ٢٣١ وانظر صحيح ابن ماجه ١ / ١٤٨."),

                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ اغْفِرْ لِي ، وارْحَمْنِي ، وَاهْدِنِي ، وَاجْبُرنِي ، وَعَافِنِي ، وَارْزُقْنِي ، وارْفَعْنِي", 1, "أخرجه أصحاب السنن إلا النسائي وانظر صحيح الترمذي ١ / ٩٠ وصحيح ابن ماجه ١ / ١٤٨.")


            }),


            ///////////////////////////////////  دُعَاءُ سُجُوْدِ التِّلاوَةِ    ////////////////////////////////

            ///////////////////////////////////  دُعَاءُ سُجُوْدِ التِّلاوَةِ  ////////////////////////////////


            new HeadZikrObject("21", "دعاء سجود التلاوة ذكر دعا أذكار  سجدة السجود القرآن القران أدعية اذكار ادعية", "دُعَاءُ سُجُوْدِ التِّلاوَةِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "سَجَدَ وَجْهِيَ للَّذِي خَلَقَهُ، وَشَقَّ سَمْعَهُ وبَصَرَهُ، بِحَوْلِهِ وَقُوَّتِهِ، { فَتَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ }.", 1, "الترمذي ٢ / ٤٧٤ وأحمد ٦ / ٣٠ والحاكم وصححه ووافقه الذهبي ١ / ٢٢٠ والزيادة له ، والآيه رقم ١٤ سورة المؤمنون."),

                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ اكْتُبْ لِي بِهَا عِنْدَكَ أجْراً، وَضَعْ عَنِّي بِهَا وِزْرَاً، واْجعَلْهَا لِي عِنْدِكَ ذُخْراً، وتَقَبَّلَهَا مِنِّي كَمَا تَقَبَّلْتَهَا مِنْ عَبْدِكَ دَاوُدَ", 1, "الترمذي ٢ / ٤٧٣ والحاكم وصححه ووافقه الذهبي ١ / ٢١٩.")


            }),


            ///////////////////////////////////  التَّشَهُّدُ    ////////////////////////////////

            ///////////////////////////////////  التَّشَهُّدُ  ////////////////////////////////


            new HeadZikrObject("22", "التشهد الصلاة الجلسة الجلوس التحيات ", "التَّشَهُّدُ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "التَّحيَّاتُ لِلَّه ، والصَّلواتُ، والطِّيِّباتُ ، السَّلامُ عَليْكَ أيُّها النَّبيُّ ورَحمةُ اللَّهِ وبَركاتُهُ، السَّلامُ عَلَيْنَا وعَلَى عِبَادِ اللَّهِ الصَّالحينَ ، أشْهَدُ أنْ لا إلهَ إلا الله ، وأشْهَدُ أنَّ مُحمداً عَبْدُهُ ورَسُولُه", 1, "البخاري مع الفتح ٢ / ٣١١ ومسلم ١ / ٣٠١.")


            }),


            ///////////////////////////////////  الصَّلاةُ عَلَى النَّبيِّ - صلى الله عليه وسلم - بَعْدَ التَّشهُّدِ     ////////////////////////////////

            ///////////////////////////////////  الصَّلاةُ عَلَى النَّبيِّ - صلى الله عليه وسلم - بَعْدَ التَّشهُّدِ   ////////////////////////////////


            new HeadZikrObject("23",

                    "الصلاة على النبي - صلى الله عليه وسلم - بعد التشهد التحيات الجلوس الجلسة ذكر دعا أذكار أدعية اذكار ادعية",

                    "الصَّلاةُ عَلَى النَّبيِّ ﷺ بَعْدَ التَّشهُّدِ ",

                    new ZikrObject[]{new


                            ZikrObject(UUID.randomUUID().toString(), "اللهُمَّ صَلِّ عَلى مُحمَّدٍ وعلَى آلِ مُحمَّدٍ، كَمَا صَلَّيتَ عَلَى إبْرَاهِيْمَ وعَلَى آلِ إبراهِيْمَ، إنَّك حَميدٌ مَجيدٌ، اللهُمَّ بَارِكْ عَلَى مُحمَّدٍ وعَلى آلِ مُحمَّدٍ، كمَا بَارَكْتَ عَلَى إبراهِيْمَ وعَلَى آلِ إبْراهيمَ، إنَّك حَمِيْدٌ مَجِيْدٌ", 1, "البخاري مع الفتح ٦ / ٤٠٨."),


                            new ZikrObject(UUID.randomUUID().toString(), "اللهمَّ صَلِّ عَلَى مُحمَّدٍ وعَلَى أزواجِهِ وذُرِّيتهِ، كمَا صَلَّيْتَ علَى آلِ إبْراهيمَ، وبَارِكْ عَلى مُحمَّدٍ، وَعَلَى أزْوَاجِهِ وذُرِّيَّتِهِ، كمَا بَاركْتَ عَلَى آلِ إبْرَاهِيْمَ، إنَّكَ حَميدٌ مَجيدٌ", 1, "البخاري مع الفتح ٦ / ٤٠٧ ومسلم ١ / ٣٠٦ واللفظ له.")


                    }),


            ///////////////////////////////////  الدُّعَاءُ بَعْدَ التَّشَهُّدِ الأَخِيْرِ قَبْلَ السَّلامِ     ////////////////////////////////

            ///////////////////////////////////  الدُّعَاءُ بَعْدَ التَّشَهُّدِ الأَخِيْرِ قَبْلَ السَّلامِ   ////////////////////////////////


            new HeadZikrObject("24", "الدعاء بعد التشهد الأخير قبل السلام الدعاء قبل التشهد التحيات الاخير قبل السلام أدعية أدعيه", "الدُّعَاءُ بَعْدَ التَّشَهُّدِ الأَخِيْرِ قَبْلَ السَّلامِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ إنِّي أعُوذُ بِكَ مِنْ عَذَابِ القَبْرِ، ومِنْ عَذَابِ جَهَنَّمَ، وَمِنْ فِتْنَةِ الْمَحيَا والمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ المَسيحِ الدَّجَّالِ", 1, "البخاري ٢ / ١٠٢ ومسلم ١ / ٤١٢ واللفظ لمسلم."),

                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِنْ عَذَابِ القَبْرِ، وأعُوذُ بِكَ مِنْ فِتْنَةِ المَسيحِ الدَّجَّالِ، وأَعُوذُ بِكَ مِنْ فِتْنَةِ المَحْيَا والمَمَاتِ، اللَّهُمَّ إنِّي أعُوذُ بِكَ مِنَ المَأثَمِ والمَغْرَمِ", 1, "البخاري ١ / ٢٠٢ ومسلم ١ / ٤١٢."),

                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ إنِّي ظَلَمْتُ نَفْسِي ظُلْماً كَثيراً، وَلَا يَغْفِرُ الذُّنُوبَ إلاَّ أنْتَ، فاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ، وارْحَمْنِي إنَّك أنْتَ الغَفُورُ الرَّحِيمُ", 1, "البخاري ٨ / ١٦٨ ومسلم ٤ / ٢٠٧٨."),

                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ، ومَا أخَّرْتُ، ومَا أسْرَرْتُ، ومَا أعْلَنْتُ، ومَا أسْرَفْتُ، ومَا أنْتَ أعْلَمُ بِهِ مِنِّي، أنْتَ المُقَدِّمُ، وأنْتَ المُؤَخِّرُ لا إلَهَ إلاَّ أنْتَ", 1, "مسلم ١ / ٥٣٤."),

                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ أعِنِّي عَلَى ذِكْرِكَ، وشُكْرِكَ، وحُسْنِ عِبَادَتِكَ", 1, "أبو داود ٢ / ٨٦ والنسائي ٣ / ٥٣ وصححه الألباني في صحيح أبو داود ١ / ٢٨٤."),

                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ إنِّي أعُوذُ بِكَ مِنَ البُخْلِ، وأَعُوذُ بِكَ مِنَ الجُبْنِ، وأعُوذُ بِكَ مِنْ أنْ أُرَدَّ إلى أرْذَلِ العُمْرِ، وأعُوْذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا و عَذَابِ القَبْرِ", 1, "البخاري مع الفتح ٦ / ٣٥."),

                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ إنِّي أسْألُكَ الجَنَّةَ، وأعُوذُ بِكَ مِنَ النَّارِ", 1, "أبو داود وانظر صحيح ابن ماجه ٢ / ٣٢٨."),

                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ بعِلْمِكَ الغَيْبَ وَقُدْرَتِكَ عَلَى الخَلْقِ؛ أحْيِني مَا عَلِمْتَ الحَيَاةَ خَيْراً لِي، وتَوَفَّنِي إذَا عَلِمْتَ الوَفَاةَ خَيْراً لي، اللَّهُمَّ إنِّي أسْألُكَ خَشْيَتَكَ فِي الغَيْبِ والشَّهَادَةِ، وأسْألُكَ كَلِمَةَ الحَقِّ فِي الرِّضَا والغَضَبِ، وأسْألُكَ القَصْدَ فِي الغِنَى والفَقْرِ، وأسْألُكَ نَعِيماً لا يَنْفَدُ، وأسْألُكَ قُرَّةَ عَيْنٍ لا تَنْقَطِعُ، وأسْأَلُكَ الرِّضَا بَعْدَ القَضَاءِ، وأسْألُكَ بَرْدَ العَيْشِ بَعْدَ المَوْتِ، وأسْألُكَ لَذَّةَ النَّظَرِ إلَى وَجْهِكَ، وَالشَّوْقَ إلَى لِقَائِكَ، فِي غَيْرِ ضَرَّاءَ مُضِرَّةٍ، ولاَ فِتْنَةٍ مُضِلَّةٍ، اللَّهُمَّ زَيِّنَّا بِزِيْنَةِ الإيْمَانِ، واجْعَلْنَا هُدَاةً مُهْتَدِينَ", 1, "النسائي ٣ / ٥٤ ، ٥٥ وأحمد ٤ / ٣٦٤ وصححه الألباني في صحيح النسائي ١ / ٢٨١."),

                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ إنِّي أسْأَلُكَ يَا أللهُ بأنَّكَ الوَاحِدُ الأحَدُ الصَّمَدُ، الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ، ولَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ، أنْ تَغْفِرَ لِي ذُنُوبِي، إنَّكَ أنْتَ الغَفُورُ الرَّحِيمُ", 1, "أخرجه النسائي بلفظه ٣ / ٥٢ وأحمد ٤ / ٣٣٨ وصححه الألباني في صحيح النسائي ١ / ٢٨٠."),

                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ إنِّي أسْألُكَ بأنَّ لَكَ الحَمْدَ، لَا إلَهَ إلاَّ أنْتَ، وَحْدَكَ لا شَرِيْكَ لَكَ، المَنَّانُ، يَا بَدِيْعَ السَّمَاواتِ والأرْضِ ، يَا ذَا الجَلالِ والإكْرَامِ، يَا حَيُّ يَا قَيُّومُ، إنِّي أسْألُكَ الجَنَّةَ، وأعُوذُ بِكَ مِنَ النَّارِ", 1, "رواه أهل السنن وانظر صحيح ابن ماجه ٢ / ٣٢٩."),

                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ إنِّي أسْألُكَ بأَنِّي أشْهَدُ أنَّكَ أنْتَ اللهُ لا إلَهَ إلاَّ أنْتَ، الأحَدُ الصَّمَدُ، الَّذِي لَمْ يَلِدْ وَلَمْ يُوْلَدْ، ولَمْ يَكُنْ لَهُ كُفُواً أحَدٌ", 1, "أبو داود ٢ / ٦٢ والترمذي ٥ / ٥١٥ وابن ماجه ٢ / ١٢٦٧ وأحمد ٥ / ٣٦٠ وانظر صحيح ابن ماجه ٢ / ٣٢٩ وصحيح الترمذي ٣ / ١٦٣.")


            }),


            ///////////////////////////////////  الأذْكَارُ بَعْدَ السَّلاَمِ مِنَ الصَّلاَةِ     ////////////////////////////////

            ///////////////////////////////////  الأذْكَارُ بَعْدَ السَّلاَمِ مِنَ الصَّلاَةِ   ////////////////////////////////


            new HeadZikrObject("25", "الأذكار بعد السلام الانتهاء الإنتهاء من الصلاة الاذكار بعد السلام من الصلاه أدعية ادعية أدعيه ادعيه دعاء دعا", "الأذْكَارُ بَعْدَ السَّلاَمِ مِنَ الصَّلاَةِ", new ZikrObject[]{

                    new ZikrObject(UUID.randomUUID().toString(), "أسْتَغْفِرُ اللهَ - ثَلاثاً - اللَّهُمَّ أنْتَ السَّلاَمُ ، وَمِـنْـكَ السَّلاَمُ ، تَبَارَكْتَ يَا ذَا الجَلالِ والإكْرَامِ", 1, "مسلم ١ / ٤١٤ ."),

                    new ZikrObject(UUID.randomUUID().toString(), "لا إلَهَ إلاَّ اللهُ وَحْدَهُ لا شَريكَ لَهُ، لَهُ المُلْكُ ولَهُ الحَمْدُ، وهُوَ عَلَى كُلِّ شَيءٍ قَدِيرٌ [ثلاثاً]، اللَّهُمَّ لاَ مَانِعَ لِمَا أعْطَيْتَ، ولا مُعْطِيَ لِمَا مَنَعْتَ، ولاَ يَنْفَعُ ذَا الجَدِّ مِنْكَ الجَدُّ", 3, "البخاري ١ / ٢٥٥ ومسلم ١ / ٤١٤."),

                    new ZikrObject(UUID.randomUUID().toString(), "لاَ إلَهَ إلاَّ اللهُ وَحْدَهُ لا شَرِيْكَ لَهُ، لَهُ المُلْكُ، وَلَهُ الحَمْدُ، وهُوَ عَلَى كُلِّ شَيءٍ قَديرٌ، لاَ حَوْلَ وَلاَ قُوَّةَ إلاَّ باللَّهِ، لاَ إلَهَ إلاَّ اللهُ، وَلا نَعْبُدُ إلاَّ إيَّاهُ، لَهُ النِّعْمَةُ ولَهُ الفَضْلُ ولَهُ الثَّنَاءُ الحَسَنُ، لاَ إلَهَ إلاَّ اللهُ مُخلِصِينَ لَهُ الدِّيْنَ ولَوْ كَرِهَ الكَافِرُونَ", 1, "مسلم ١ / ٤١٥."),

                    new ZikrObject(UUID.randomUUID().toString(), "سُبْحَانَ اللَّهِ، والحَمْدُ للهِ، واللهُ أكْبَرُ (ثَلاثاً وثَلاثِينَ) لاَ إلَهَ إلاَّ اللهُ وَحْدَهُ لا شَرِيْكَ لَهُ، لَهُ المُلْكُ ولَهُ الحَمْدُ، وهُوَ عَلَى كُلِّ شَيءٍ قَدِيرٌ"
                            , 33

                            , " من قال ذلك دبر كل صلاة غفرت خطاياه وإن كانت مثل زبد البحر \n مسلم ١ / ٤١٨ . "),


                    new ZikrObject(UUID.randomUUID().toString(), "بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ﴿ قُل هُوَ اللَّهُ أَحَدٌ ۝ اللَّهُ الصَّمَدُ ۝ لَم يَلِد وَلَم يولَد ۝ وَلَم يَكُن لَهُ كُفُوًا أَحَدٌ ۝ ) \n\n بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ﴿ قُل أَعوذُ بِرَبِّ الفَلَقِ ۝ مِن شَرِّ ما خَلَقَ ۝ وَمِن شَرِّ غاسِقٍ إِذا وَقَبَ ۝ وَمِن شَرِّ النَّفّاثاتِ فِي العُقَدِ ۝ وَمِن شَرِّ حاسِدٍ إِذا حَسَدَ ۝ ) \n\n بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ﴿ قُل أَعوذُ بِرَبِّ النّاسِ ۝ مَلِكِ النّاسِ ۝ إِلهِ النّاسِ ۝ مِن شَرِّ الوَسواسِ الخَنّاسِ ۝ الَّذي يُوَسوِسُ في صُدورِ النّاسِ ۝ مِنَ الجِنَّةِ وَالنّاسِ ۝ ) \n\n عَقِبَ كُلِّ صَلَاةٍ"

                            , 1, "أبو داود ٢ / ٨٦ والنسائي ٣ / ٦٨ وانظر صحيح الترمذي ٢ / ٨ والسور الثلاث يقال لها المعوذات وانظر فتح الباري ٩ / ٦٢."),


                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُ لا إِلهَ إِلّا هُوَ الحَيُّ القَيّومُ لا تَأخُذُهُ سِنَةٌ وَلا نَومٌ لَهُ ما فِي السَّماواتِ وَما فِي الأَرضِ مَن ذَا الَّذي يَشفَعُ عِندَهُ إِلّا بِإِذنِهِ يَعلَمُ ما بَينَ أَيديهِم وَما خَلفَهُم وَلا يُحيطونَ بِشَيءٍ مِن عِلمِهِ إِلّا بِما شاءَ وَسِعَ كُرسِيُّهُ السَّماواتِ وَالأَرضَ وَلا يَئودُهُ حِفظُهُما وَهُوَ العَلِيُّ العَظيمُ  \n\n عَقِبَ كُلِّ صَلَاةٍ", 1, "اية الكرسي [ البقرة: 255] من قرأها دبر كل صلاة لم يمنعه من دخول الجنة إلا أن يموت. النسائي في عمل اليوم والليلة برقم ١٠٠، وابن السني برقم ١٢١ وصححه الألباني في صحيح الجامع ٥ / ٣٣٩ وسلسلة الأحاديث الصحيحة ٢ / ٦٩٧ برقم ٩٧٢."),

                    new ZikrObject(UUID.randomUUID().toString(), "(( لا إلهَ إلاَّ اللهُ وَحْدَهُ لا شَريكَ لَهُ، لَهُ المُلْكُ ولَهُ الحَمْدُ، يُحيي ويُميتُ، وهُوَ عَلَى كُلِّ شَيءٍ قديرٌ )) \n\n عَشْرَ مرَّاتٍ بَعْدَ صلاةِ المَغْربِ والصُّبْح", 10, "رواه الترمذي ٥ / ٥١٥ وأحمد ٤ / ٢٢٧ وانظر تخريجه في زاد المعاد ١ / ٣٠٠."),

                    new ZikrObject(UUID.randomUUID().toString(), "(( اللَّهمُّ إنِّي أسأَلُكَ عِلماً نَافِعاً، ورِزْقاً طَيِّباً، وعَمَلاً مُتَقَبَّلاً )) \n\n بعد السَّلامِ مِنْ صَلاةِ الفَجْرِ", 1, "ابن ماجه وغيره. وانظر صحيح ابن ماجه ١ / ١٥٢ ومجمع الزوائد ١٠ / ١١١.")


            }),


            ///////////////////////////////////   دعاء الاستخارة    ////////////////////////////////
            ///////////////////////////////////   دعاء الاستخارة    ////////////////////////////////


            new HeadZikrObject("26", "دعاء صلاة الاستخارة الإستخارة يستخير", "دُعاءُ صَلاةِ الاستِخَارَةِ", new ZikrObject[]{

                    new ZikrObject(UUID.randomUUID().toString(), "قالَ جَابِرُ بنُ عبدِ الله - رضي الله عنهما - : كانَ رَسولُ الله - صلى الله عليه وسلم - يُعَلِّمُنا الاسْتِخَارَةَ في الأمُورِ كُلِّهَا كَمَا يُعَلِّمُنا السُّورَةَ مِنَ القُرْآنِ، يَقُولُ : ((إذا هَمَّ أحَدُكُمْ بالأمْرِ فَلْيَرْكَعْ رَكْعَتَينِ مِنْ غَيْر الفَريْضَةِ، ثُمَّ لِيَقُلْ : اللهُمَّ إنِّي أسْتَخيرُكَ بعِلْمِكَ، وأسْتَقْدِرُكَ بقُدْرَتِكَ، وأسْألُكَ مِنْ فضلِكَ العَظِيم، فإنَّكَ تَقْدِرُ ولا أقْدِرُ، وتَعْلَمُ ولا أعْلَمُ، وأنْتَ عَلاَّمُ الغُيوبِ، اللهُمَّ إنْ كُنْتَ تَعْلَمُ أن هذَا الأمرَ - ويُسمِّي حَاجَتَه - خَيرٌ لي في دِيني ومَعَاشي وعَاقِبَةِ أمْري - أو قالَ : عَاجِلهِ وآجِلِهِ - فاقْدُرْهُ لي ويَسِّرْهُ لي، ثمَّ بَارِكْ لي فيهِ، وإنْ كُنْتَ تَعْلَمُ أنَّ هذا الأمْرَ شَرٌّ لي في دِينِي ومَعَاشي وعَاقِبَةِ أمري - أوْ قالَ: عَاجِلِهِ وآجِلِهِ - فَاصْرِفْهُ عَنِّي،  وَاصْرِفْنِي عَنْهُ، واقْدُرْ لِيَ الخَيْرَ حَيْثُ كَانَ،  ثُمَّ أرْضِنِي بِهِ\n\n  ومَا نَدِمَ مَنْ اسْتَخَارَ الخَالِقَ، وَشَاوَرَ المَخْلُوْقينَ المُؤمِنينَ، وتَثَبَّتَ في أمْرِهِ، فَقَدْ قَالَ سُبْحَانَهُ : { وَشَاوِرْهُمْ فِي الْأَمْرِ فَإِذَا عَزَمْتَ فَتَوَكَّلْ عَلَى اللَّهِ } "

                            , 1, " البخاري ٧ / ١٦٢. \n  سورة آل عمران آية: ١٥٩  ")


            }),


            ///////////////////////////////////  أذْكَارُ الصَّبَاحِ والمَسَاءِ   ////////////////////////////////
            ///////////////////////////////////   أذْكَارُ الصَّبَاحِ والمَسَاءِ   ////////////////////////////////


            new HeadZikrObject("27", "أذكار الصباح و المساء الصبح الليل ", "أذْكَارُ الصَّبَاحِ والمَسَاءِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "الحمدُ للهِ وَحْدَهُ، والصَّلاةُ والسَّلامُ عَلَى مَنْ لا نبيَّ بَعْدهُ"

                            , 1

                            , " عن أنس يرفعه لأن أقعد مع قوم يذكرون الله تعالى من صلاة الغداة حتى تطلع الشمس أحب إلي من أن أعتق أربعة من ولد إسماعيل، ولأن أقعد مع قوم يذكرون الله من صلاة العصر إلى أن تغرب الشمس أحب إلي من أن أعتق أربعة  أبو داود برقم ٣٦٦٧، وحسنه الألباني، صحيح أبو داود ٢ / ٦٩٨. "

                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "أعوذ بالله مِنَ الشَّيْطانِ الَّرجيمِ ، بسم الله الرحمن الرحيم \n { اللَّهُ لا إِلهَ إِلّا هُوَ الحَيُّ القَيّومُ لا تَأخُذُهُ سِنَةٌ وَلا نَومٌ  لَهُ مَا فِي السَّمَوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ }"

                            , 1

                            , "سورة البقرة آية: ٢٥٥. من قالها حين يصبح أجير من الجن حتى يمسي، ومن قالها حين يمسي أجير منهم حتى يصبح. أخرجه الحاكم ١ / ٥٦٢ وصححه الألباني في صحيح الترغيب والترهيب ١ / ٢٧٣ وعزاه إلى النسائي والطبراني وقال: إسناد الطبراني جيد."

                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ﴿ قُل هُوَ اللَّهُ أَحَدٌ ۝ اللَّهُ الصَّمَدُ ۝ لَم يَلِد وَلَم يولَد ۝ وَلَم يَكُن لَهُ كُفُوًا أَحَدٌ ۝ ) \n\n بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ﴿ قُل أَعوذُ بِرَبِّ الفَلَقِ ۝ مِن شَرِّ ما خَلَقَ ۝ وَمِن شَرِّ غاسِقٍ إِذا وَقَبَ ۝ وَمِن شَرِّ النَّفّاثاتِ فِي العُقَدِ ۝ وَمِن شَرِّ حاسِدٍ إِذا حَسَدَ ۝ ) \n\n بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ﴿ قُل أَعوذُ بِرَبِّ النّاسِ ۝ مَلِكِ النّاسِ ۝ إِلهِ النّاسِ ۝ مِن شَرِّ الوَسواسِ الخَنّاسِ ۝ الَّذي يُوَسوِسُ في صُدورِ النّاسِ ۝ مِنَ الجِنَّةِ وَالنّاسِ ۝ ) \n "


                            , 3

                            , "من قالها ثلاث مرات حين يصبح وحين يمسي كفته من كل شيء. أخرجه أبو داود ٤ / ٣٢٢ والترمذي ٥ / ٥٦٧ وانظر صحيح الترمذي ٣ / ١٨٢."

                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "أصْبَحْنَا وَأصْبَحَ المُلْكُ للهِ ، وَالحَمْدُ لِلَّه ِ، لا إلهَ إلاَّ اللهُ وَحْدَهُ لا شَرِيْكَ لَهُ ،  لَهُ المُلْكُ ،  ولَهُ الحَمْدُ ، وهُوَ عَلَى كُلِّ شَيءٍ قَدِيرٌ ، رَبِّ أسْألُكَ خَيْرَ مَا في هَذَا اليَوْمِ وَخَيْرَ مَا بَعْدَهُ ،  وأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذَا اليَوْمِ وَشَرِّ مَا بَعْدَهُ ، رَبِّ أعُوذُ بِكَ مِنَ الكَسَلِ ، وسُوءِ الكِبَرِ ، رَبِّ أعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وعَذَابٍ فِي القَبْرِ"

                            , 1

                            , "وإذا أمسى قال : أمسينا وأمسى الملك لله \n   وإذا أمسى قال : رب أسألك خير ما في هذه الليلة وخير ما بعدها وأعوذ بك من شر هذه الليلة وشر ما بعدها. \n مسلم ٤ / ٢٠٨٨."

                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ بِكَ أصْبَحْنَا، وبِكَ أمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وإلَيْكَ النُّشُورُ"

                            , 1

                            , "وإذا أمسى قال: اللهم بك أمسينا وبك أصبحنا وبك نحيا وبك نموت وإليك المصير  \n الترمذي ٥ / ٤٦٦ وانظر صحيح الترمذي ٣ / ١٤٢."

                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ أنْتَ رَبِّي لا إلَهَ إلاَّ أَنْتَ، خَلَقْتَنِي وأنَا عَبْدُكَ، وأَ نَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أعُوْذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أبُوْءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وأبُوْءُ بِذَنْبِي فَاغْفِر لِي فَإنَّه لا يَغْفِرُ الذُّنُوبَ إلاَّ أَنْتَ"

                            , 1

                            , "أبوء : أقر وأعترف \n من قالها موقنا بها حين يمسي فمات من ليلته دخل الجنة، وكذلك إذا أصبح.  \n أخرجه البخاري ٧ / ١٥٠."

                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ إنِّي أصْبَحْتُ أُشْهِدُكَ ، وأُشْهِدُ حَمَلَةَ عَرْشِكَ ، ومَلائِكَتِكَ ، وجَميْعَ خَلْقِكَ ، أنَّكَ أنْتَ اللهُ لا إلَهَ إلاَّ أنْتَ وَحْدَكَ لا شَرِيْكَ لَكَ ، وأنَّ مُحَمَّداً عَبْدُكَ ورَسُولُكَ"

                            , 4

                            , "وإذا أمسى قال : اللهم إني أمسيت. \n من قالها حين يصبح أو يمسي أربع مرات أعتقه الله من النار.  \n أخرجه أبو داود ٤ / ٣١٧ والبخاري في الأدب المفرد برقم ١٢٠١ والنسائي في عمل اليوم والليلة برقم ٩، وابن السني برقم ٧٠ وحسن سماحة الشيخ ابن باز إسناد النسائي وأبي داود في تحفة الأخيار ص ٢٣."

                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ مَا أصْبَحَ بِي مِنْ نِعْمَةٍ، أوْ بِأحَدٍ مِنْ خَلقِكَ، فَمِنْكَ وَحْدَكَ لا شَرِيْكَ لَكَ، فَلَكَ الحَمْدُ ولَكَ الشُّكْرُ"

                            , 1

                            , "وإذا أمسى قال: اللهم ما أمسى بي.  \n  من قالها حين يصبح فقد أدى شكر يومه، ومن قالها حين يمسي فقد أدى شكر ليلته. \n أخرجه أبو داود ٤ / ٣١٨، والنسائي في عمل اليوم والليلة برقم ٧ وابن السني برقم ٤١ وابن حيان  - موارد - رقم ٢٣٦١ وحسن ابن باز إسناده في تحفة الأخيار ص ٢٤."
                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ عَافِنِي فِي بَدَنِي ، اللَّهُمَّ عَافِنِي فِي سَمْعِي ، اللَّهُمَّ عَافِنِي فِي بَصَرِي ، لَا إلَهَ إلاَّ أنْتَ ، اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِنَ الكُفْرِ وَالفَقْرِ ، وأَعُوذُ بِـكَ مِنْ عَذَابِ القَبْرِ ، لا إلَهَ إلاَّ أنْتَ"

                            , 3

                            , "أبو داود ٤ / ٣٢٤، وأحمد ٥ / ٤٢ والنسائي في عمل اليوم والليلة برقم ٢٢ وابن السني برقم ٦٩ والبخاري في الأدب المفرد وحسن العلامة ابن باز إسناده في تحفة الأخيار ص ٢٦."

                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "حَسْبِيَ اللهُ لاَ إلَهَ إلاَّ هُوَ عَلَيْهِ تَوَكَّلْتُ ، وَهُوَ رَبُّ العَرْشِ العَظِيمِ"

                            , 7

                            , "من قالها حين يصبح وحين يمسي سبع مرات كفاه الله ما أهمه من أمر الدنيا والآخرة. \n أخرجه ابن السني برقم ٧١ مرفوعا وأبو داود موقوفا ٤ / ٣٢١، وصحح إسناده شعيب وعبد القادر الأرناؤوط. انظر: زاد المعاد ٢ / ٣٧٦."

                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "(( اللهُمَّ إنِّي أسْألُكَ العَفْوَ والعَافيةَ في الدُّنْيَا والآخِرَةِ، اللهُمَّ إنِّي أسْألُكَ العَفْوَ والعَافيةَ في دِيْني ودُنْيَاي، وأهْلِي، ومَالي، اللهُمَّ اسْتُرْ عَوْرَاتي، وآمِنْ رَوْعَاتي، اللهُمَّ احْفَظْني مِنْ بيْنِ يَدَيَّ، ومِنْ خَلْفِي، وعَنْ يَميني، وعَنْ شِمَالي، ومِنْ فَوْقِي، وأعُوذُ بِعَظَمَتكَ أنْ أُغْتالَ مِنْ تَحْتي ))"

                            , 1

                            , "أبو داود برقم ٥٠٧٤ ،  وابن ماجه ، وانظر صحيح ابن ماجه ٢ / ٣٣٢."

                    ),

                    ///


                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ عَالِمَ الغَيْبِ والشَّهَادَةِ، فَاطِرَ السَّموَاتِ والأرْضِ ، رَبَّ كُلِّ شَيءٍ ومَلِيْكَهُ، أشْهَدُ أنْ لا إلَهَ إلاَّ أنْتَ ، أعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ ، وأنْ أقْتَرِفَ عَلَى نَفْسِي سُوءاً ، أوْ أجُرَّهُ إلَى مُسْلِمٍ"

                            , 1

                            , "الترمذي وأبو داود، وانظر: صحيح الترمذي ٣ / ١٤٢."

                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "بِسْمِ اللَّهِ الَّذِي لا يَضُرُّ مَعَ اسْمِهِ شَيءٌ في الأرْضِ وَلَا فِي السَّمَاءِ وهُوَ السَّمِيعُ العَلِيْمُ"

                            , 3

                            , "من قالها ثلاثا إذا أصبح وثلاثا إذا أمسى لم يضره شيء.  \n أخرجه أبو داود ٤ / ٣٢٣ والترمذي ٥ / ٤٦٥ وابن ماجه وأحمد. انظر: صحيح ابن ماجه 2 / 332 وحسن إسناده العلامة ابن باز في تحفة الأخيار ص ٣٩."

                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "رَضِيْتُ باللَّهِ رَبًّا، وبالإسْلامِ دِيْناً، وبِمُحَمَّدٍ نَبيًّا "

                            , 3

                            , "من قالها ثلاثا حين يصبح وثلاثا حين يمسي كان حقا على الله أن يرضيه يوم القيامة. \n أحمد ٤ / ٣٣٧ والنسائي في عمل اليوم والليلة برقم ٤ وابن السني برقم ٦٨ وأبو داود ٤ / ٣١٨ والترمذي ٥ / ٤٦٥ وحسنه ابن باز في تحفة الأخيار ص ٣٩."

                    ),


                    new ZikrObject(UUID.randomUUID().toString(), " يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ ، أصْلِحْ لِي شَأْنِي كُلَّهُ ، وَلاَ تَكِلْنِي إلَى نَفْسِي طَرْفَةَ عَيْنٍ"

                            , 1

                            , "الحاكم وصححه ووافقه الذهبي ١ / ٥٤٥ وانظر صحيح الترغيب والترهيب ١ / ٢٧٣."

                    ),


                    new ZikrObject(UUID.randomUUID().toString(), " أصْبَحْنَا وأصْبَحَ المُلْكُ للَّهِ رَبِّ العَالَمِيْنَ ، اللَّهُمَّ إنِّي أسْألُكَ خَيْرَ هَذَا اليَوْمِ : فَتْحَهُ، ونَصْرَهُ، وَنُورَهُ، وبَرَكَتَهُ، وهُدَاهُ، وأعُوْذُ بِكَ مِنْ شَرِّ مَا فِيْهِ وَشَرِّ مَا بَعْدَهُ"

                            , 1

                            , "وإذا أمسى قال : أمسينا وأمسى الملك لله رب العالمين.\n  وإذا أمسى قال: اللهم إني أسألك خير هذه الليلة فتحها ونصرها ونورها وبركتها وهداها وأعوذ بك من شر ما فيها وشر ما بعدها. \n  أبو داود ٤ / ٣٢٢ وحسن إسناده شعيب وعبد القادر الأرناؤوط في تحقيق زاد المعاد ٢ / ٣٧٣."

                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "أصْبَحْنَا عَلَى فِطْرَةِ الإسْلامِ ، وعَلَى كَلِمَةِ الإخْلاصِ، وعَلَى دِيْنِ نَبيِّنَا مُحَمَّدٍ - صلى الله عليه وسلم - ، وعَلَى مِلَّةِ أبِينَا إبْرَاهيمَ، حَنيفاً مُسْلِماً ومَا كَانَ مِنَ المُشْرِكِينَ"

                            , 1

                            , "وإذا أمسى قال: أمسينا على فطرة الإسلام. \n أحمد ٣ / ٤٠٦ و ٤٠٧ وابن السني في عمل اليوم والليلة برقم ٣٤ وانظر: صحيح الجامع ٤ / ٢٠٩."

                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ "

                            , 100

                            , "من قالها مائة مرة حين يصبح وحين يمسي لم يأت أحد يوم القيامة بأفضل مما جاء به إلا أحد قال مثل ما قال أو زاد عليه.  \n  مسلم ٤ / ٢٠٧١."

                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "  لا إلَهَ إلاَّ اللهُ وَحْدَهُ لا شَرِيْكَ لَهُ، لَهُ المُلْكُ، ولَهُ الحَمْدُ، وَهُوَ عَلَى كُلِّ شَيءٍ قَدير \n\n  عشر مرات أو مرة واحة عند الكسل "

                            , 10

                            , "النسائي في عمل اليوم والليلة برقم 24 وانظر: صحيح الترغيب والترهيب 1 / 272، وتحفة الأخيار لابن باز ص 44 وانظر فضلها في ص 146، حديث رقم 255.\n أبو داود 4 / 319 وابن ماجه وأحمد 4 / 60 وانظر: صحيح الترغيب والترهيب 1 / 270، صحيح أبو داود 3 / 957، وصحيح ابن ماجه 2 / 331 وزاد المعاد 2 / 377."

                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "لَا إلَهَ إلاَّ الله ُ، وَحْدَهُ لا شريكَ لهُ، لَهُ المُلْكُ ولَهُ الحَمْدُ، وهُوَ علَى كُلِّ شَيءٍ قَديرٌ \n\n ١٠٠ مرة إذا أصبح"

                            , 100

                            , "من قالها مائة مرة في يوم كانت له عدل عشر رقاب، وكتب له مائة حسنة، ومحيت عنه مائة سيئة، وكانت له حرزا من الشيطان يومه ذلك حتى يمسي، ولم يأت أحد بأفضل مما جاء به إلا أحد عمل أكثر من ذلك  \n البخاري 4 / 95، ومسلم 4 / 2071"

                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "سُبْحَانَ اللهِ وبِحَمْدِهِ، عَدَدَ خَلْقِهِ، ورِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ ومِدَادَ كَلِمَاتهِ \n\n ثَلاثَ مَرَّاتٍ إذَا أصبح"

                            , 3

                            , "مسلم 4 / 2090."

                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "اللهُمَّ إنِّي أَسْألُكَ عِلْماً نافِعاً، ورِزْقاً طَيِّباً، وعَملاً مُتقَبَّلاً \n\n إذَا أصبح"

                            , 1

                            , "أخرجه ابن السني في عمل اليوم والليلة برقم 54 وابن ماجه برقم 925 وحسن إسناده عبد القادر وشعيب الأرناؤوط في تحقيق زاد المعاد 2 / 375."

                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "أستَغْفِرُ اللهَ وأتُوبُ إليهِ"

                            , 100

                            , "البخاري مع الفتح 11 / 101، ومسلم 4 / 2075."

                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "أَعُوْذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ   \n\n ثَلاثَ مَرَّاتٍ إذَا أمْسَى"

                            , 3

                            , "من قالها حين يمسي ثلاث مرات لم تضره حمة تلك الليلة \n أخرجه أحمد 2 / 290، والنسائي في عمل اليوم والليلة برقم 590 وابن السني برقم 68 وانظر: صحيح الترمذي 3 / 187، وصحيح ابن ماجه 2 / 266 وتحفة الأخيار ص 45."

                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبيِّنَا مُحَمَّدٍ"

                            , 10

                            , "من صلى علي حين يصبح عشرا وحين يمسي عشرا أدركته شفاعتي يوم القيامة  \n أخرجه الطبراني بإسنادين أحدهما جيد، انظر: مجمع الزوائد 10 / 120 وصحيح الترغيب والترهيب 1 / 273."

                    ),


            }),

            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("28", "أذكار الليل النوم", "أذْكَارُ النَّوْمِ", new ZikrObject[]{

                    new ZikrObject(UUID.randomUUID().toString(), "يَجْمَعُ كَفَّيْهِ ثُمَّ يَنْفُثُ فيهمَا فيَقْرأ فِيْهمَا :  بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ \n (( قُل هُوَ اللَّهُ أَحَدٌ ۝ اللَّهُ الصَّمَدُ ۝ لَم يَلِد وَلَم يولَد ۝ وَلَم يَكُن لَهُ كُفُوًا أَحَد ))  \n\n بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ (( قُل أَعوذُ بِرَبِّ الفَلَقِ ۝ مِن شَرِّ ما خَلَقَ ۝ وَمِن شَرِّ غاسِقٍ إِذا وَقَبَ ۝ وَمِن شَرِّ النَّفّاثاتِ فِي العُقَدِ ۝ وَمِن شَرِّ حاسِدٍ إِذا حَسَدَ )) \n\nبِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ (( قُل أَعوذُ بِرَبِّ النّاسِ ۝ مَلِكِ النّاسِ ۝ إِلهِ النّاسِ ۝ مِن شَرِّ الوَسواسِ الخَنّاسِ ۝ الَّذي يُوَسوِسُ في صُدورِ النّاسِ ۝ مِنَ الجِنَّةِ وَالنّاسِ )) \n\n ثُمَّ يَمْسَحُ بهِمَا مَا اسْتَطَاعَ مِنْ جَسَدِهِ؛ يَبْدأُ بِهِمَا عَلَى رَأسِهِ وَوَجْهِهِ وَمَا أقْبَلَ مِنْ جَسَدِهِ "

                            , 3

                            , "البخاري مع الفتح ٩ / ٦٢ ، برقم : ٥٠١٧ \n و مسلم برقم : ٢١٩٢ "


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "(( اللَّهُ لا إِلهَ إِلّا هُوَ الحَيُّ القَيّومُ لا تَأخُذُهُ سِنَةٌ وَلا نَومٌ لَهُ ما فِي السَّماواتِ وَما فِي الأَرضِ مَن ذَا الَّذي يَشفَعُ عِندَهُ إِلّا بِإِذنِهِ يَعلَمُ ما بَينَ أَيديهِم وَما خَلفَهُم وَلا يُحيطونَ بِشَيءٍ مِن عِلمِهِ إِلّا بِما شاءَ وَسِعَ كُرسِيُّهُ السَّماواتِ وَالأَرضَ وَلا يَئودُهُ حِفظُهُما وَهُوَ العَلِيُّ العَظيمُ ))"

                            , 1

                            , "اية الكرسي - البقرة: 255 - \n من قرأها إذا أوى إلى فراشه فإنه لن يزال عليه من الله حافظ ولا يقربه شيطان حتى يصبح \n  البخاري مع الفتح 4 / 487."


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "باسْمِكَ رَبِّي وَضَعْتُ جَنْبِي، وَبِكَ أرْفَعُهُ، فَإنْ أمْسَكْتَ نَفْسِي فَارْحَمْهَا، وإنْ أرْسَلْتَهَا فاحْفَظْهَا، بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحين"

                            , 1

                            , " إذا قام أحدكم من فراشه ثم رجع إليه فلينفضه بصنفة إزاره ثلاث مرات وليسم الله فإنه لا يدري ما خلفه عليه بعده وإذا اضطجع فليقل: … الحديث  \n  البخاري 11 / 126. ومسلم 4 / 2084"


                    ),


                    new ZikrObject(UUID.randomUUID().toString()

                            , "اللَّهُمَّ إنَّكَ خَلَقْتَ نَفْسِي وأَنْتَ تَوَفَّاهَا، لَكَ مَمَاتُهَا وَمَحْيَاهَا، إنْ أحْيَيْتَها فَاحْفَظْها، وَإنْ أمَتَّهَا فَاغْفِرْ لَهَا، اللَّهُمَّ إنِّي أسْألُكَ العَافِيةَ."

                            , 1

                            , " أخرجه مسلم 4 / 2083 وأحمد بلفظه 2 / 79"


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), " اللَّهُمَّ قِنِي عَذَابَكَ، يَوْمَ تَبْعَثُ عِبَادَكَ "

                            , 1

                            , "كان رسول الله صلى الله عليه وسلم إذا أراد أن يرقد وضع يده اليمنى تحت خده ثم يقول : . . .  الحديث \n  أبو داود بلفظه 4 / 311 وانظر صحيح الترمذي 3 / 143.."


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "بِاسْمِكَ اللَّهُمَّ أمُوتُ وَأحْيَا"

                            , 1

                            , "البخاري مع الفتح 11 / 113 ومسلم 4 / 2083 "


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "سُبْحَانَ اللَّهِ  (( ثَلاثاً وثَلاثِينَ )) \n وَالحَمْدُ للَّهِ  (( ثَلاثاً وَثَلاثينَ )) \n وَاللَّهُ أكْبَرُ  (( أرْبَعاً وَثَلاثينَ ))"

                            , 33

                            , "من قال ذلك عندما يأوي إلى فراشه كان خيرا له من خادم . البخاري مع الفتح 7 / 71 ومسلم 4 / 2091."


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ، ورَبَّ الأرْضِ، ورَبَّ العَرْشِ العَظِيمِ، رَبَّنَا ورَبَّ كُلِّ شَيءٍ، فالِقَ الحَبِّ والنَّوَى، وَمُنْزِلَ التَّوْرَاةِ والإنْجِيلِ والفُرْقَانِ، أعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَيءٍ أنْتَ آخِذٌ بِنَاصِيتهِ، اللَّهُمَّ أنْتَ الأوَّلُ فَلَيْسَ قَبْلَكَ شَيءٌ، وأنْتَ الآخِرُ فَلَيْسَ بَعْدَكَ شَيءٌ، وأنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيءٌ، وأنْتَ البَاطِنُ فَلَيْسَ دُونَكَ شَيءٌ، اقْضِ عَنَّا الدَّيْنَ، وَأَغْنِنَا مِنَ الفَقْرِ"

                            , 1

                            , "مسلم 4 / 2084."


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "الحَمْدُ للَّهِ الَّذِي أطْعَمَنَا وسَقَانَا، وكَفَانَا، وآوَانا؛ فَكَمْ مِمَّنْ لا كَافِيَ لَهُ وَلا مُؤْوِيَ"

                            , 1

                            , " مسلم 4 / 2085"


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ عَالِمَ الغَيْبِ والشَّهَادَةِ، فَاطِرَ السَّمَوَاتِ والأرْضِ ، رَبَّ كُلِّ شَيءٍ ومَلَيْكَهُ، أشْهَدُ أنْ لا إلَهَ إلاَّ أنْتَ، أعُوْذُ بِكَ مِنْ شَرِّ نَفْسِي ، ومِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ ، وأنْ أقْتَرِفَ عَلَى نَفْسِي سُوءاً ، أوْ أَجُرَّهُ إلَى مُسْلِمٍ"

                            , 1

                            , "أبو داود 4 / 317 وانظر صحيح الترمذي 3 / 142 . "


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "يَقْرَاُ  (( الم ))  تَنْزِيلَ السَّجْدَةِ، وتَبَارَكَ الَّذِي بِيَدِهِ المُلْك"

                            , 1

                            , "الترمذي والنسائي وانظر صحيح الجامع 4 / 255."


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ  أسْلَمْتُ نَفْسِي إلَيْكَ، وَفَوَّضْتُ أمْرِي إلَيْكَ، وَوَجَّهْتُ وَجْهِي إلَيْكَ، وألْجَأتُ ظَهْرِي إلَيْكَ، رَغْبَةً ورَهْبَةً إلَيْكَ، لاَ مَلْجَأ وَلا مَنْجَا مِنْكَ إلاَّ إلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أنْزَلْتَ، وَبِنَبيِّكَ الَّذِي أرْسَلْت"

                            , 1

                            , "إذا أخذت مضجعك فتوضأ وضوءك للصلاة ثم اضطجع على شقك الأيمن ثم قل . . . الحديث \n قال صلى الله عليه وسلم لمن قال ذلك : فإن مت مت على الفطرة البخاري مع الفتح 11 / 113 ومسلم 4 / 2081."


                    ),


            }

            ),


            ///////////////////////////////////   " الدُّعَاءُ إذَا تَقَلَّبَ لَيْلاً  "    ////////////////////////////////
            ///////////////////////////////////    " الدُّعَاءُ إذَا تَقَلَّبَ لَيْلاً  "    ////////////////////////////////


            new HeadZikrObject("29", "الدعاء إذا تقلب ليلا التقلب الليل ليل ", "الدُّعَاءُ إذَا تَقَلَّبَ لَيْلاً", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(),
                            "لاَ إلَهَ إلاَّ اللهُ الوَاحِدُ القَهَّارُ ، ربُّ السَّمَوَاتِ والأرْضِ وَمَا بَيْنَهُمَا العَزِيْزُ الغَفَّارُ"

                            , 1

                            ,
                            "يقول ذلك إذا تقلب من جنب إلى جنب في الليل \n أخرجه الحاكم وصححه ووافقه الذهبي 1 / 540 والنسائي في عمل اليوم والليلة وابن السني وانظر صحيح الجامع 4 / 213."


                    )


            }),


            ///////////////////////////////////    "دُعَاءُ الفَزَعِ فِي النَّوْمِ، ومَنْ بُلِيَ بالوَحْشَةِ"    ////////////////////////////////
            ///////////////////////////////////    "دُعَاءُ الفَزَعِ فِي النَّوْمِ، ومَنْ بُلِيَ بالوَحْشَةِ"    ////////////////////////////////


            new HeadZikrObject("30", "دعاء الفزع في النوم و من بلي بالوحشة الوحشة ابتلي ابتلاء", "دُعَاءُ الفَزَعِ فِي النَّوْمِ، ومَنْ بُلِيَ بالوَحْشَةِ", new ZikrObject[]{

                    new ZikrObject(UUID.randomUUID().toString(), "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ ، مِنْ غَضَبِهِ وَعِقَابِهِ ، وشَرِّ عِبَادِهِ ، وَمِنْ هَمَزَاتِ الشَّيَاطِينِ ، وأنْ يَحْضُرُونِ ."

                            , 1

                            , "أبو داود 4 / 12 وانظر صحيح الترمذي 3 / 171."


                    )


            }),


            ///////////////////////////////////   مَا يَفْعَلُ مَنْ رَأَى الرُّؤْيا أوِ الحُلْمَ    ////////////////////////////////
            ///////////////////////////////////    مَا يَفْعَلُ مَنْ رَأَى الرُّؤْيا أوِ الحُلْمَ    ////////////////////////////////


            new HeadZikrObject("31", "ما يفعل من رأى الرؤيا أو الحلم الرؤية المنام الأحلام يحلم يرى رآى", "مَا يَفْعَلُ مَنْ رَأَى الرُّؤْيا أوِ الحُلْمَ", new ZikrObject[]{

                    new ZikrObject(UUID.randomUUID().toString(),
                            "(( يَنْفُثُ عَن يَسارِهِ )) ثلاثا \n\n (( يستعيذُ باللهِ مِنَ الشَّيْطَانِ ، ومِنْ شَرِّ مَا رَأَى )) ثلاثا \n\n (( لَا يُحَدِّثُ بِهَا أحَداً )) \n\n (( يتحَوَّلُ عَنْ جَنْبِهِ الذي كَانَ عَلَيْهِ )) \n\n (( يَقومُ يُصَلِّي إنْ أرَادَ ذَلِكَ ))"

                            , 1

                            , "مسلم 4 / 1772 , 1773"


                    )


            }),


            ///////////////////////////////////    دُعَاءُ قُنُوتِ الوِتْرِ     ////////////////////////////////
            ///////////////////////////////////     دُعَاءُ قُنُوتِ الوِتْرِ     ////////////////////////////////


            new HeadZikrObject("32", "دعاء قنوت الوتر القنوت", " دُعَاءُ قُنُوتِ الوِتْرِ ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ اهْدِنِي فِيْمَنْ هَدَيْتَ، وعَافِنِي فِيْ مَنْ عَافَيْتَ، وتَولَّنِي فِيْمَنْ تَوَلَّيْتَ، وَبَارِكْ لِي فِيْمَا أعْطَيْتَ، وقِنِي شَرَّ مَا قَضَيْتَ؛ فَإنَّكَ تَقْضِي وَلا يُقْضَى عَلَيْكَ، إنَّهُ لا يَذِلُّ مَنْ وَالَيْتَ، وَلا يَعِزُّ مَنْ عَادَيْتَ، تَبَارَكْتَ رَبَّنَا وَتَعَالَيْتَ"

                            , 1

                            , "أخرجه أصحاب السنن وأحمد والدارمي والحاكم والبيهقي وما بين المعكوفين للبيهقي وانظر صحيح الترمذي 1 / 144 وصحيح ابن ماجه 1 / 194 وإرواء الغليل للألباني 2 / 172."


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ إنِّي أَعُوْذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَأعُوْذُ بِكَ مِنْكَ، لا أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ"

                            , 1

                            , "أخرجه أصحاب السنن الأربعة وأحمد. انظر صحيح الترمذي 3 / 180 وصحيح ابن ماجه 1 / 194 والإرواء 2 / 175."


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ إيَّاكَ نَعْبُدُ ، ولَكَ نُصَلِّي وَنَسْجُدُ ، وَإلَيْكَ نَسْعَى وَنَحْفِدُ، نَرْجُو رَحْمَتَكَ ، ونَخْشَى عَذَابَكَ ، إنَّ عَذَابَكَ بالكَافِريْنَ مُلْحَقٌ ، اللَّهُمَّ إنَّا نَسْتَعِينُكَ ، ونَسْتَغْفِرُكَ ، وَنُثْنِي عَلَيْكَ الخَيْرَ ، وَلا نَكْفُرُكَ ، وَنُؤْمِنُ بِكَ ، وَنخْضَعُ لَكَ ، وَنخْلَعُ مَنْ يَكْفُرُكَ"

                            , 1

                            , "أخرجه البيهقي في السنن الكبرى وصحح إسناده 2 / 211 وقال الشيخ الألباني في إرواء الغليل وهذا إسناده صحيح 2 / 170. وهو موقوف على عمر."


                    ),


            }),


            ///////////////////////////////////    الذِّكْرُ عَقِبَ السَّلاَمِ مِنَ الوِتْرِ   ////////////////////////////////
            ///////////////////////////////////   الذِّكْرُ عَقِبَ السَّلاَمِ مِنَ الوِتْرِ   ////////////////////////////////


            new HeadZikrObject("33", "الذكر بعد صلاة الوتر عقب السلام من ", "الذِّكْرُ عَقِبَ السَّلاَمِ مِنَ الوِتْرِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "سُبْحَانَ المَلِكِ القُدُّوسِ . \n ثَلاثَ مَرَّاتٍ ، والثَّالِثَةُ يَجْهَرُ بِهَا ويَمُدُّ بِهَا صَوْتَهُ يَقُولُ : رَبِّ المَلائِكَةِ والرُّوحِ"

                            , 3

                            , "رواه النسائي 3 / 244 والدراقطني وغيرهما وما بين المعكوفين زيادة للدارقطني 2 / 31 وإسناده صحيح. انظر زاد المعاد بتحقيق شعيب الأرناؤوط وعبد القادر الارؤوناط 1 / 337."


                    )


            }),


            ///////////////////////////////////    دُعَاءُ الهَمِّ والحُزْنِ    ////////////////////////////////
            ///////////////////////////////////    دُعَاءُ الهَمِّ والحُزْنِ    ////////////////////////////////


            new HeadZikrObject("34", "دعاء الهم و الحزن الغم الغموم الألم المهموم الأحزان الهموم", "دُعَاءُ الهَمِّ والحُزْنِ", new ZikrObject[]{

                    new ZikrObject(UUID.randomUUID().toString(), "(( اللَّهُمَّ إنِّي عَبْدُكَ ، ابْنُ عَبدِكَ ، ابْنُ أمَتِكَ ، نَاصِيَتي بِيَدِكَ ، مَاضٍ فِيَّ حُكْمُكَ ، عَدْلٌ فِيَّ قَضَاؤُكَ، أسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ ، سَمَّيْتَ بهِ نَفْسَكَ ، أوْ أنْزَلْتَهُ فِي كِتَابِكَ ، أوْ  عَلَّمْتَهُ أحَداً مِنْ خَلْقِكَ ، أوِ اسْتأثَرْتَ بِهِ فِي عِلْمِ الغَيْبِ عِنْدَكَ ، أنْ تَجْعَلَ القُرْآنَ رَبِيْعَ قَلبِي ، وَنُورَ صَدْرِي ، وجَلاءَ حُزْنِي ، وَذَهَابَ هَمِّي ))"

                            , 1

                            , " أحمد 1 / 391 وصححه الألباني في سلسلة الأحاديث الصحيحة ."


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "(( اللَّهُمَّ إنِّي أعُوذُ بِكَ مِنَ الهَمِّ والحَزَنِ، والعَجْزِ والكَسَلِ، والبُخْلِ والجُبْنِ، وضَلَعِ الدَّيْنِ وغَلَبَةِ الرِّجَالِ ))"

                            , 1

                            , "البخاري 7 / 158 \n  كان الرسول صلى الله عليه وسلم يكثر من هذا الدعاء. انظر البخاري مع الفتح 11 / 173."


                    )}
            ),


            ///////////////////////////////////    دُعَاءُ الكَرْبِ    ////////////////////////////////
            ///////////////////////////////////    دُعَاءُ الكَرْبِ    ////////////////////////////////


            new HeadZikrObject("35", "دعاء الكرب الكروب مكروب مهموم الحزن الأحزان الهموم المكروب  المحزون", "دُعَاءُ الكَرْبِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( لَا إلَهَ إِلاَّ اللهُ العَظِيمُ الحَلِيمُ ، لا إِلَهَ إلاَّ اللهُ رَبُّ العَرْشِ العَظِيمُ ، لَا إلَهَ إلا اللهُ رَبُّ السَّمَوَاتِ ، وَرَبُّ الأرْضِ وَرَبُّ العَرْشِ الكَريْمِ ))"

                            , 1

                            , "البخاري 7 / 154 ومسلم 4 / 2092."


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ رَحْمَتَكَ أرْجُو، فَلا تَكِلني إلَى نَفْسِي طَرْفَةَ عَيْنٍ، وَأَصْلِحْ لِي شَأْنِي كُلَّهُ، لَا إِلَهَ إلاَّ أنْتَ"

                            , 1

                            , "أبو داود 4 / 324 وأحمد 5 / 42 وحسنه الألباني في صحيح أبو داود 3 / 959."


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), " (( لَا إِلَه إِلاَّ أنْتَ سُبْحَانَكَ ، إِنِّي كُنْتُ مِنَ الظَّالِمينَ )) "

                            , 1

                            , "الترمذي 5 / 529 والحاكم وصححه ووافقه الذهبي 1 / 505 وانظر صحيح الترمذي 3 / 168."


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), " (( اللهُ اللهُ رَبِّي لَا أُشْرِكُ بهِ شَيْئاً )) "

                            , 1

                            , "أخرجه أبو داود 2 / 87 وانظر صحيح ابن ماجه 2 / 335."


                    )}

            ),


            ///////////////////////////////////  دُعَاءُ لِقَاءِ العَدُوِّ وذِي السُّلْطَانِ    ////////////////////////////////
            ///////////////////////////////////    دُعَاءُ لِقَاءِ العَدُوِّ وذِي السُّلْطَانِ    ////////////////////////////////


            new HeadZikrObject("36", "دعاء لقاء العدو و ذي السلطان السلاطين الأعداء ظلم الظلم خوف خاف الخوف الاعداء الاعدا ملاقاة ملاقاه ", " دُعَاءُ لِقَاءِ العَدُوِّ وذِي السُّلْطَانِ ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), " (( اللَّهُمَّ إنَّا نَجْعَلُكَ فِي نُحُوْرِهِمْ، ونَعُوذُ بِكَ مِنْ شُرُورِهِمْ )) "

                            , 1

                            , "أبو داود 2 / 89 وصححه الحاكم ووافقه الذهبي 2 / 142."


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "(( اللَّهُمَّ أنْتَ عَضُدِي ، وأنْتَ نَصِيري ، بِكَ أحُولُ ، وَبِكَ أصُولُ ، وَبِكَ أقَاتِلُ ))"

                            , 1

                            , "أبو داود 3 / 42 والترمذي 5 / 572، وانظر صحيح الترمذي 3 / 183."


                    ),

                    new ZikrObject(UUID.randomUUID().toString(), " ((  حَسْبُنَا اللهُ ، ونِعْمَ الوَكِيلُ  )) "

                            , 1

                            , "البخاري 5 / 172."


                    )}

            ),


            ///////////////////////////////////     دُعَاءُ مَنْ خَافَ ظُلْمَ السُّلْطَانِ    ////////////////////////////////
            ///////////////////////////////////     دُعَاءُ مَنْ خَافَ ظُلْمَ السُّلْطَانِ    ////////////////////////////////


            new HeadZikrObject("37", "دعاء لقاء العدو و ذي السلطان السلاطين الأعداء ظلم الظلم خوف خاف الخوف الاعداء الاعدا ملاقاة ملاقاه ", "دُعَاءُ مَنْ خَافَ ظُلْمَ السُّلْطَانِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( اللَّهُمَّ رَبَّ السَّمَواتِ السَّبْعِ، ورَبَّ العَرْشِ العَظِيمِ، كُنْ لِي جَاراً مِنْ فُلاَنِ بْنِفُلانٍ، وأحْزَابِهِ مِنْ خَلائِقِكَ؛ أنْ يَفْرُطَ عَلَيَّ أَحدٌ مِنْهُمْ أوْ يَطْغَى، عَزَّ جَارُكَ، وَجَلَّ ثَنُاؤُكَ، ولا إِلَهَ إلاَّ أنْتَ ))."

                            , 1

                            , "البخاري في الأدب المفرد برقم 707 وصححه الألباني في صحيح الأدب المفرد برقم 545"


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "اللهُ أكْبَرُ، اللهُ أعَزُّ مِنْ خَلْقِهِ جَمِيعاً، اللهُ أعَزُّ مِمَّا أخَافُ وأحْذَرُ، أعُوذُ باللهِ الذِي لَا إِلَهَ إلاَّ هُوَ، المُمْسِكِ السَّمَواتِ السَّبْعِ أنْ يَقَعْنَ عَلَى الأرْضِ إِلاَّ بإذْنِهِ، مِنْ شَرِّ عَبْدِكَ فُلانٍ، وُجُنُودِهِ وَأتْبَاعِهِ وأشْيَاعِهِ، مِنَ الجِنِّ والإنْسِ، اللَّهُمَّ كُنْ لِي جَاراً مِنْ شَرِّهِمْ، جَلَّ ثَنَاؤُكَ، وَعَزَّ جَارُكَ، وتَبَارَكَ اسْمُكَ: وَلَا إِلَهَ غَيْرُكَ"

                            , 3

                            , "البخاري في الأدب المفرد برقم 708 وصححه الألباني في صحيح الأدب المفرد برقم 546."


                    )}

            ),


            ///////////////////////////////////    الدُّعَاءُ عَلَى العَدُوِّ    ////////////////////////////////
            ///////////////////////////////////    الدُّعَاءُ عَلَى العَدُوِّ    ////////////////////////////////


            new HeadZikrObject("38", "الدعاء على العدو الأعداء", "الدُّعَاءُ عَلَى العَدُوِّ", new ZikrObject[]{

                    new ZikrObject(UUID.randomUUID().toString(), "(( اللَّهُمَّ مُنْزِلَ الكِتَابِ ، سَرِيْعَ الحِسَابِ، اهْزِمِ الأحْزَابَ ، اللَّهُمَّ اهْزِمْهُمْ و زَلْزِلْهُمْ ))"

                            , 1

                            , "مسلم (3/ 1362) برقم 1742."


                    )}

            ),


            ///////////////////////////////////     مَا يَقُولُ مَنْ خَافَ قَوْماً    ////////////////////////////////
            ///////////////////////////////////     مَا يَقُولُ مَنْ خَافَ قَوْماً    ////////////////////////////////


            new HeadZikrObject("39", "ما يقول من خاف قوما الخوف قوم", " مَا يَقُولُ مَنْ خَافَ قَوْماً", new ZikrObject[]{

                    new ZikrObject(UUID.randomUUID().toString(), "((  اللَّهُمَّ اكْفِنِيْهِمْ بِمَا شِئْتَ  ))"

                            , 1

                            , "مسلم (4/ 2300) برقم 3005 ."


                    )}
            ),


            ///////////////////////////////////    دُعَاءُ مَنْ أصَابَهُ وَسْوَسَةٌ في الإيْمَانِ    ////////////////////////////////
            ///////////////////////////////////    دُعَاءُ مَنْ أصَابَهُ وَسْوَسَةٌ في الإيْمَانِ    ////////////////////////////////


            new HeadZikrObject("40", "دعاء من أصابه وسوسة في الإيمان الوسوسة وسواس", "دُعَاءُ مَنْ أصَابَهُ وَسْوَسَةٌ في الإيْمَانِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( يستعيذ بالله )) \n (( يَنْتَهِي عَمَّا وَسْوَسَ فِيهِ ))"

                            , 3

                            , "البخاري مع الفتح 6 / 336 ومسلم 1 / 120."


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "يَقُولُ : (( آمَنْتُ باللهِ وَرُسُلِهِ ))"

                            , 1

                            , "مسلم 1 /119 - 120."


                    ),

                    new ZikrObject(UUID.randomUUID().toString(), "يَقْرَأُ قَوْلَهُ تَعالَى  :  (( هُوَ الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ وَهُوَ بِكُلِّ شَيْءٍ عَلِيم ))"

                            , 1

                            , "سورة الحديد، الآية: 3 \n  أبو داود 4 / 329 وحسنه الألباني في صحيح أبو داود 3 / 962."


                    )}

            ),


            ///////////////////////////////////   دُعَاءُ قَضَاءِ الدَّيْنِ   ////////////////////////////////
            ///////////////////////////////////   دُعَاءُ قَضَاءِ الدَّيْن   ////////////////////////////////


            new HeadZikrObject("41", "دعاء قضاء الدين الديون مديون", "دُعَاءُ قَضَاءِ الدَّيْنِ", new ZikrObject[]{

                    new ZikrObject(UUID.randomUUID().toString(), " (( اللَّهُمَّ اكْفِنِي بِحَلالِكَ عَنْ حَرَامِكَ ، وأَغْنِني بِفَضْلِكَ عَمَّنْ سِوَاكَ )) "

                            , 1

                            , "الترمذي 5 / 560 وانظر صحيح الترمذي 3 / 180."


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), " (( اللَّهُمَّ إنِّي أعُوذُ بِكَ مِنَ الهَمِّ والحَزَنِ ، والعَجْزِ والكَسَلِ ، والبُخْلِ والجُبْنِ ، وضَلعِ الدَّيْنِ وغَلَبَةِ الرِّجَال )) "

                            , 1

                            , "البخاري 7 / 158."


                    )}

            ),


            ///////////////////////////////////   دُعَاءُ الوَسْوَسَةِ في الصَّلاةِ والقِرَاءَةِ    ////////////////////////////////
            ///////////////////////////////////   دُعَاءُ الوَسْوَسَةِ في الصَّلاةِ والقِرَاءَةِ    ////////////////////////////////


            new HeadZikrObject("42", " وسواس دعاء الوسوسة في الصلاة و القراءة ", "دُعَاءُ الوَسْوَسَةِ في الصَّلاةِ والقِرَاءَةِ", new ZikrObject[]{

                    new ZikrObject(UUID.randomUUID().toString(), "(( أعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ، واتْفُلْ عَلَى يَسَارِكَ ))"

                            , 3

                            , "مسلم 4 / 1729 من حديث عثمان بن أبي العاص رضي الله عنه وفيه ففعلت ذلك فأذهبه الله عني."


                    )}

            ),


            ///////////////////////////////////    دُعَاءُ مَنِ اسْتَصْعَبَ عَلَيْهِ أمْرٌ    ////////////////////////////////
            ///////////////////////////////////    دُعَاءُ مَنِ اسْتَصْعَبَ عَلَيْهِ أمْرٌ    ////////////////////////////////


            new HeadZikrObject("43", "دعاء من استصعب عليه أمر امر استصعاب إستصعب إستصعاب", "دُعَاءُ مَنِ اسْتَصْعَبَ عَلَيْهِ أمْرٌ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), " (( اللَّهُمَّ لَا سَهْلَ إلاَّ مَا جَعَلْتَهُ سَهْلاً، وأنْتَ تَجْعَلُ الحَزْنَ إذَا شِئْتَ سَهْلاً ))"

                            , 1

                            , "رواه ابن حبان في صحيحه برقم 2427 (موارد) وابن السني برقم 351 وقال الحافظ هذا حديث صحيح، وصححه عبد القادر الأرناؤوط في تخريج الأذكار للنووي ص 106."


                    )}
            ),


            ///////////////////////////////////   مَا يَقُولُ وَيَفعَلُ مَنْ أذْنَبَ ذَنْباً    ////////////////////////////////
            ///////////////////////////////////    مَا يَقُولُ وَيَفعَلُ مَنْ أذْنَبَ ذَنْباً    ////////////////////////////////


            new HeadZikrObject("44", "ما يقول و يفعل من أذنب ذنبا الذنب الذنوب توبة التوبة يتوب", "مَا يَقُولُ وَيَفعَلُ مَنْ أذْنَبَ ذَنْباً", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( مَا مِنْ عَبْدٍ يُذْنِبُ ذَنْباً فَيُحْسِنُ الطُّهُورَ ، ثُمَّ يَقُومُ فَيُصَلِّي رَكْعَتَيْنِ ، ثُمَّ يَسْتَغْفِرُ اللَّهَ إلاَّ غَفَرَ اللَّهُ لَهُ ))"

                            , 1

                            , "أبو داود 2 / 86 والترمذي 2 / 257 وصححه الألباني في صحيح أبي داود 1 / 283."


                    )}
            ),


            ///////////////////////////////////   دُعَاءُ طَرْدِ الشَّيْطَانِ وَوَسَاوِسِهِ    ////////////////////////////////
            ///////////////////////////////////  دُعَاءُ طَرْدِ الشَّيْطَانِ وَوَسَاوِسِهِ    ////////////////////////////////


            new HeadZikrObject("45", "دعاد طرد الشيطان و وساوسه الوساوس الشياطين", "دُعَاءُ طَرْدِ الشَّيْطَانِ وَوَسَاوِسِهِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), " الاسْتِعَاذَةُ باللهِ مِنْهُ"

                            , 1

                            , "أبو داود 1 والترمذي وانظر صحيح الترمذي 1 / 77 وانظر سورة المؤمنون آية 98 - 99."


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "الأَذَانُ"

                            , 1

                            , "مسلم 1 / 291 والبخاري 1 / 151."


                    ),

                    new ZikrObject(UUID.randomUUID().toString(), "الأذْكَارُ وَقِراءَةُ القُرْآنِ"

                            , 1

                            , "لا تجعلوا بيوتكم مقابر إن الشيطان ينفر من البيت الذي تقرأ فيه سورة البقرة  رواه مسلم 1 / 539 ومما يطرد الشيطان أذكار الصباح والمساء، والنوم والاستيقاظ، وأذكار دخول المنزل والخروج منه وأذكار دخول المسجد والخروج منه وغير ذلك من الأذكار المشروعة مثل قراءة آية الكرسي عند النوم، والآيتين الأخيرتين من سورة البقرة، ومن قال لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير مائة مرة كانت له حرزا من الشيطان يومه كله، وكذا الأذان يطرد الشيطان."


                    )}

            ),


            ///////////////////////////////////    الدُّعَاءُ حيْنَمَا يَقَعُ مَا لا يَرْضَاهُ أوْ غُلِبَ عَلَى أمْرِهِ   ////////////////////////////////
            ///////////////////////////////////    الدُّعَاءُ حيْنَمَا يَقَعُ مَا لا يَرْضَاهُ أوْ غُلِبَ عَلَى أمْرِهِ   ////////////////////////////////


            new HeadZikrObject("46", "الدعاء حينما يقع ما لا يرضاه أو غلب على أمره يرضى الرضا الرضى يحب", "الدُّعَاءُ حيْنَمَا يَقَعُ مَا لا يَرْضَاهُ أوْ غُلِبَ عَلَى أمْرِهِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( قَدَرُ اللَّهِ ومَا شَاءَ فَعَلَ ))"

                            , 1

                            , "المؤمن القوي خير وأحب إلى الله من المؤمن الضعيف وفي كل خير \n  احرص على ما ينفعك واستعن بالله ولا تعجز وإن أصابك شيء فلا تقل لو أني فعلت كذا وكذا ولكن قل قدر الله وما شاء فعل فإن لو تفتح عمل الشيطان  \n مسلم 4 / 2052."


                    )}
            ),


            ///////////////////////////////////    تَهْنِئَةُ المَوْلُودِ لَهُ وَجَوَابُهُ    ////////////////////////////////
            ///////////////////////////////////    تَهْنِئَةُ المَوْلُودِ لَهُ وَجَوَابُهُ    ////////////////////////////////


            new HeadZikrObject("47", "تهنئة المولود له و جوابه المولودة تهنئه التهنئة", "تَهْنِئَةُ المَوْلُودِ لَهُ وَجَوَابُهُ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), " (( بَارَكَ اللَّهُ لَكَ فِي المَوْهُوبِ لَكَ، وَشَكَرْتَ الوَاهِبَ، وبَلَغَ أشُدَّهُ، وَرُزِقْتَ بِرَّهُ ))  ويَرُدُّ عَلَيْهِ المُهَنَّأُ فَيَقُولُ : \n (( بَارَكَ اللَّهُ لَكَ ، وبَارَكَ عَلَيْكَ ، وجَزَاكَ اللَّهُ خَيْراً ،  ورَزَقَكَ اللَّهُ مِثْلَهُ ، وأجْزَلَ ثَوَابَكَ )) ."

                            , 1

                            , "ذكر من كلام الحسن البصري . انظر : تحفة المودود لابن القيم ، ص ٢٠ ، وعزاه لابن المنذر في الأوسط \n انظر الأذكار للنووي ص 349 وصحيح الأذكار للنووي لسليم الهلالي 2 / 713."


                    )}

            ),


            ///////////////////////////////////    مَا يُعَوَّذُ بهِ الأوْلادُ    ////////////////////////////////
            ///////////////////////////////////    مَا يُعَوَّذُ بهِ الأوْلادُ    ////////////////////////////////


            new HeadZikrObject("48", "ما يعوذ به الأولاد الاولاد يستعيذ الاستعاذة الإستعاذة", "مَا يُعَوَّذُ بهِ الأوْلادُ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "كانَ رَسُولُ اللَّهِ - صلى الله عليه وسلم - يَعُوِّذُ الحَسَنَ وَالحُسَيْنَ - رضي الله عنهما - : (( أُعِيذُكُمَا بِكَلِماتِ اللَّهِ التَّامَّةِ ، مِنْ كُلِّ شَيْطَانٍ وَهَامَّةٍ ، وَمِنْ كُلِّ عَيْنٍ لَامَّةٍ ))"

                            , 1

                            , "البخاري 4 / 119 من حديث ابن عباس رضي الله عنهما."


                    )}
            ),


            ///////////////////////////////////   الدُّعَاءُ للمَرِيضِ فِي عِيَادَتِهِ    ////////////////////////////////
            ///////////////////////////////////   الدُّعَاءُ للمَرِيضِ فِي عِيَادَتِهِ    ////////////////////////////////


            new HeadZikrObject("49", "الدعاء للمريض في عيادته عيادة عيادت المريض المرضان المرضى زيارة زيارت", "الدُّعَاءُ للمَرِيضِ فِي عِيَادَتِهِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), " ((  لا بَأْسَ طَهُورٌ إنْ شَاءَ اللهُ  ))"

                            , 1

                            , "البخاري مع الفتح 10 / 118."


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "(( أسَألُ اللَّهَ العَظِيمَ ، رَبَّ العَرْشِ العَظِيمِ ، أنْ يَشْفِيَكَ ))"

                            , 7

                            , "ما من عبد مسلم يعوذ مريضا لم يحضر أجله فيقول سبع مرات . . .  الحديث. إلا عوفي \n  أخرجه الترمذي وأبو داود وانظر صحيح الترمذي 2 / 210 وصحيح الجامع 5 / 180."


                    )}
            ),


            ///////////////////////////////////    فَضْلُ عِيَادةِ المَرِيضِ    ////////////////////////////////
            ///////////////////////////////////    فَضْلُ عِيَادةِ المَرِيضِ    ////////////////////////////////


            new HeadZikrObject("50", "فضل عيادة المريض عيادت زيارة زيارت المرض", "فَضْلُ عِيَادةِ المَرِيضِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "قال  - صلى الله عليه وسلم   :  (( إذَا عَادَ الرَّجُلُ أخَاهُ المُسْلِمَ ، مَشَى فِي خِرَافَةِ الجَنَّةِ حَتَّى يَجْلِسَ ، فَإذَا جَلَسَ غَمَرَتْهُ الرَّحْمَةُ ، فَإِنْ كَانَ غُدْوَةً صَلَّى عَلَيْهِ سَبْعُونَ ألْفَ مَلَكٍ حَتَّى يُمْسِيَ ، وإنْ كَانَ مَسَاءً صَلَّى عَلَيْهِ سَبْعُونَ ألْفَ مَلَكٍ حَتَّى يُصْبِحَ )) . "

                            , 1

                            , "رواه الترمذي وابن ماجه وأحمد وانظر صحيح ابن ماجه 1 / 244 وصحيح الترمذي 1 / 286 وصححه أيضا أحمد شاكر."


                    )}
            ),


            ///////////////////////////////////   دُعَاءُ المَرِيْضِ الذِي يَئِسَ مِنْ حَيَاتِهِ    ////////////////////////////////
            ///////////////////////////////////   دُعَاءُ المَرِيْضِ الذِي يَئِسَ مِنْ حَيَاتِهِ    ////////////////////////////////


            new HeadZikrObject("51", "دعاء المريض الذي يئس من حياته", "دُعَاءُ المَرِيْضِ الذِي يَئِسَ مِنْ حَيَاتِهِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( اللَّهُمَّ اغْفِرْ لِي ، وارْحَمْنِي ، وأَلْحِقْنِي بالرَّفِيقِ الأعْلَى ))"

                            , 1

                            , "البخاري 7 / 10 ومسلم 4 / 1893."


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "(( جَعَلَ النَّبيُّ - صلى الله عليه وسلم - عِندَ مَوْتِهِ يُدْخِلُ يَدَيْهِ فِي المَاءِ، فَيَمْسَحُ بِهِمَا وَجْهَهُ، ويَقُولُ: لَا إِلَهَ إِلاَّ اللهُ إِنَّ للمَوْتِ سَكَرَاتٍ ))"

                            , 1

                            , "البخاري مع الفتح 8 / 144 وفي الحديث ذكر السواك."


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "لَا إلَهَ إلاَّ اللَّهُ واللهُ أكْبَرُ ، لَا إلَهَ إلاَّ اللَّهُ وَحْدَهُ ، لَا إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ ، لَا إِلَهَ إِلاَّ اللَّهُ لَهُ المُلْكُ وَلَهُ الحَمْدُ ، لَا إلَهَ إلاَّ اللَّهُ ، وَلَا حَوْلَ وَلَا قُوَّةَ إلاَّ باللَّهِ"

                            , 1

                            , "أخرجه الترمذي وابن ماجه وصححه الألباني، انظر صحيح الترمذي 3 / 152 وصحيح ابن ماجه 2 / 317."


                    ),}

            ),


            ///////////////////////////////////   تَلْقِينُ المُحْتَضِرِ    ////////////////////////////////
            ///////////////////////////////////    تَلْقِينُ المُحْتَضِرِ    ////////////////////////////////


            new HeadZikrObject("52", "تلقين المحتضر الميت الموت التلقين", "تَلْقِينُ المُحْتَضِرِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( مَنْ كَانَ آخِرُ كَلاَمِهِ لَا إِلَهَ إِلاَّ الله ُ، دَخَلَ الجَنَّة ))"

                            , 1

                            , " أبو داود (3/ 190) برقم (3116) ، وانظر ((صحيح الجامع)) (5/ 432)) . "


                    )}
            ),


            ///////////////////////////////////   دُعَاءُ مَنْ أُصِيبَ بِمُصِيبَةٍ    ////////////////////////////////
            ///////////////////////////////////   دُعَاءُ مَنْ أُصِيبَ بِمُصِيبَةٍ    ////////////////////////////////


            new HeadZikrObject("53", "دعاء من أصيب بمصيبة المصيبة اصيب أصاب اصاب", "دُعَاءُ مَنْ أُصِيبَ بِمُصِيبَةٍ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), " (( إنَّا للهِ وإنَّا إلَيْهِ رَاجِعُونَ، اللَّهُمَّ أجُرْنِي فِي مُصِيْبَتي، وأخْلِفْ لِي خَيْراً مِنْهَا ))"

                            , 1

                            , "مسلم (2/ 632) برقم (918) ."


                    )}
            ),


            ///////////////////////////////////   الدُّعَاءُ عِنْدَ إغْمَاضِ المَيِّتِ   ////////////////////////////////
            ///////////////////////////////////    الدُّعَاءُ عِنْدَ إغْمَاضِ المَيِّت   ////////////////////////////////


            new HeadZikrObject("54", "الدعاء عند إغماض اغماض الميت الموت ", "الدُّعَاءُ عِنْدَ إغْمَاضِ المَيِّتِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهمَّ اغْفِرْ لِفُلانٍ  - باسْمِهِ - ، وارْفَعْ دَرَجَتهُ فِي المَهْدِيِّيْنَ، واخْلُفْهُ فِي عَقِبِهِ فِي الغَابِريْنَ، واغْفِرْ لَنَا ولَهُ يَا رَبَّ العَالَمِيْنَ، وافْسَحْ لَهُ فِي قَبْرِهِ وَنَوِّرْ لَهُ فِيْهِ"

                            , 1

                            , "مسلم 2 / 634، برقم920."


                    )}

            ),


            ///////////////////////////////////   الدُّعَاءُ للمَيِّتِ فِي الصَّلاةِ عَلَيْهِ    ////////////////////////////////
            ///////////////////////////////////    الدُّعَاءُ للمَيِّتِ فِي الصَّلاةِ عَلَيْهِ    ////////////////////////////////


            new HeadZikrObject("55", "الدعاء للميت الميت في الصلاة عليه الجنازة الموت", "الدُّعَاءُ للمَيِّتِ فِي الصَّلاةِ عَلَيْهِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "اللَّهُمَّ اغْفِرْ لَهُ وارْحَمْهُ، وعَافِهِ، واعْفُ عَنْهُ، وأكْرِمْ نُزُلَهُ، وَوَسِّعْ مُدْخَلَهُ، واغْسِلهُ بالمَاءِ والثَّلْجِ والبَرَدِ، ونَقِّهِ مِنَ الخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الأبْيَضَ مِنَ الدَّنَسِ، وأبْدِلْهُ دَاراً خَيْراً مِنْ دَارِهِ، وأهْلاً خَيْراً مِنْ أهْلِهِ، وزَوْجاً خَيْراً مِنْ زَوْجِهِ، وأدْخِلْهُ الجَنَّةَ، وأَعِذْهُ مِنْ عَذَابِ القَبْرِ وَعَذَابِ النَّارِ"

                            , 1

                            , "مسلم 2 / 663 ، برقم 963."


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "(( اللَّهُمَّ اغْفِرْ لِحَيِّنا، ومَيِّتِنَا، وشَاهِدِنَا، وَغَائِبِنَا، وصَغِيْرِنَا، وكَبيرِنَا، وذَكَرِنَا،وأُنْثَانَا، اللَّهُمَّ مَنْ أحْيَيْتَهُ مِنَّا فأَحْيِهِ عَلَى الإسْلامِ، ومَنْ تَوَفَّيْتَهُ مِنَّا فَتَوفَّهُ عَلَى الإيْمانِ، اللَّهُمَّ لَا تَحْرِمْنَا أجْرَهُ، ولا تُضِلَّنَا بَعْدَهُ ))"

                            , 1

                            , "ابن ماجه (1/ 480) برقم (1498) ، أبو داود برقم (3201)، والترمذي برقم (1024)، والنسائي برقم (1985) ،وأحمد (2/ 368)، وانظر صحيح ابن ماجة (1/ 251)."


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "(( اللَّهُمَّ إِنَّ فُلانَ بْنَ فُلانٍ فِي ذِمَّتِكَ ، وحَبْلِ جِوَارِكَ ، فَقِهِ مِنْ فِتْنَةِ القَبْرِ وَعَذَابِالنَّارِ ، وأَنْتَ أهْلُ الوَفَاءِ والحَقِّ ، فاغْفِرْ لَهُ ، وارْحَمْهُ ، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ ))."

                            , 1

                            , "(٢) أخرجه ابن ماجه برقم (1499) ،وأبو داود, (3/ 211)، وانظر صحيح ابن ماجه (1/ 251)."


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "(( اللَّهُمَّ عَبْدُكَ وابْنُ أمَتِكَ ، احْتَاج إِلَى رَحْمَتِكَ ، وأَنْتَ غَنِيٌّ عَنْ عَذَابِهِ ، إِنْ كَانَ مُحْسِناً فَزِدْ فِي إِحْـسَانِـه ، وإنْ كَانَ مُسِيئاً فَتَجَاوَزْ عَنْهُ ))"

                            , 1

                            , "أخرجه الحاكم وصححه ووافقه الذهبي 1/ 359، وانظر: أحكام الجنائز للألباني ص 125"


                    )}

            ),


            ///////////////////////////////////   الدُّعَاءُ للفَرَطِ فِي الصَّلاةِ عَلَيْهِ    ////////////////////////////////
            ///////////////////////////////////    الدُّعَاءُ للفَرَطِ فِي الصَّلاةِ عَلَيْهِ    ////////////////////////////////


            new HeadZikrObject("56", "الدعاء للفرط في الصلاة عليه الفرط الصغير الميت الجنازة الموت", "الدُّعَاءُ للفَرَطِ فِي الصَّلاةِ عَلَيْهِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( اللَّهُمَّ أعِذْهُ مِنْ عَذَابِ القَبْرِ )) \n وَإنْ قَالَ :  (( اللَّهُمَّ اجْعَلْهُ فَرَطَاً وَذُخْراً لِوَالِدَيْهِ، وشَفِيعاً مُجَاباً، اللَّهُمَّ ثَقِّلْ بِهِ مَوَازِيْنَهُمَا، وأعْظِمْ بهِ أُجُورَهُمَا، وألْحِقْهُ بِصَالِحِ المُؤْمِنينَ، واجْعَلْهُ فِي كَفَالَةِ إِبْرَاهِيمَ، وَقِهِ بِرَحْمَتِكَ عَذَابَ الجَحِيمِ، وأبْدِلْهُ دَاراً خَيْراً مِنْ دَارِهِ، وَأَهْلاً خَيْراً مِنْ أَهْلِهِ، اللَّهُمَّ اغْفِرْ لأسْلاَفِنَا، وَأَفْرَاطِنَا، وَمَنْ سَبَقَنا بالإيْمَانِ )) .  فَحَسَنٌ"

                            , 1

                            , "قال سعيد بن المسيب صليت وراء أبي هريرة على صبي لم يعمل خطيئة قط فسمعته يقول. . . الحديث . \n أخرجه مالك في الموطأ 1 / 288 وابن أبي شيبة في المصنف 3 / 217 والبيهقي 4 / 9، وصحح إسناده شعيب الأرناؤوط في تحقيقه لشرح السنة للبغوي 5 / 357. \n انظر: المغني لابن قدامة 3 / 416 والدروس المهمة لعامة الأمة للشيخ عبد العزيز بن عبد الله بن باز حفظه الله ص 15."


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "(( اللَّهُمَّ اجْعَلْهُ لَنَا فَرَطَاً، وَسَلَفاً، وَأَجْراً ))"

                            , 1

                            , "كان الحسن يقرأ على الطفل بفاتحة الكتاب ويقول . . .  الحديث أخرجه البغوي في شرح السنة 5 / 357 وعبد الرزاق برقم 6588، وعلقه البخاري في كتاب الجنائز، 65 باب قراءة فاتحة الكتاب على الجنازة 2 / 113 ."


                    )}
            ),


            ///////////////////////////////////     دُعَاءُ التَّعْزِيَةِ     ////////////////////////////////
            ///////////////////////////////////     دُعَاءُ التَّعْزِيَةِ     ////////////////////////////////


            new HeadZikrObject("57", "دعاء التعزية الجنازة الموت", "دُعَاءُ التَّعْزِيَةِ ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( إِنَّ لِلَّهِ مَا أَخَذَ، وَلَهُ مَا أَعْطَى، وَكُلُّ شَيءٍ عِنْدَهُ بِأَجَلٍ مُسَمَّىً ...  فَلْتَصْبِرْ وَلْتَحْتَسِبْ )) \n وَإنْ قَالَ: (( أعْظَمَ اللهُ أجْرَكَ، وَأَحْسَنَ عَزَاءَكَ، وَغَفَرَ لِمَيِّتكَ )) ؛ فَحَسَنٌ"

                            , 1

                            , " البخاري 2 / 80 ومسلم 2 / 636. \n الأذكار للنووي ص 126."


                    )}
            ),


            ///////////////////////////////////    الدُّعَاءُ عِندَ إدْخَالِ المَيِّتِ القَبْرَ    ////////////////////////////////
            ///////////////////////////////////    الدُّعَاءُ عِندَ إدْخَالِ المَيِّتِ القَبْرَ    ////////////////////////////////


            new HeadZikrObject("58", "الدعاء عند إدخال الميت القبر ادخال الجنازة الموت اللحد", "الدُّعَاءُ عِندَ إدْخَالِ المَيِّتِ القَبْرَ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( بِسْمِ اللّـهِ وَعَلَى سُنَّةِ رَسُولِ الله ))"

                            , 1

                            , "أبو داود 3 / 314 بسند صحيح وأحمد بلفظ بسم الله وعلى ملة رسول الله وسنده صحيح"


                    )}

            ),


            ///////////////////////////////////    الدُّعَاءُ بَعْدَ دَفْنِ المَيِّتِ     ////////////////////////////////
            ///////////////////////////////////    الدُّعَاءُ بَعْدَ دَفْنِ المَيِّتِ     ////////////////////////////////


            new HeadZikrObject("59", "الدعاء بعد دفن الميت الجنازة القبر الموت الدفن", "الدُّعَاءُ بَعْدَ دَفْنِ المَيِّتِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), " ((  اللَّهُمَّ اغْفِرْ لَهُ، اللَّهُمَّ ثَبِّتْهُ  ))"

                            , 1

                            , " كان النبي صلى الله عليه وسلم إذا فرغ من دفن الميت وقف عليه وقال :  استغفروا لأخيكم وسلوا له التثبيت ، فإنه الآن يسأل .  \n أبو داود 3 / 315 والحاكم وصححه ووافقه الذهبي 1 / 370."


                    )}
            ),


            ///////////////////////////////////    دُعَاءُ زِيَارَةِ القُبُورِ    ////////////////////////////////
            ///////////////////////////////////     دُعَاءُ زِيَارَةِ القُبُورِ    ////////////////////////////////


            new HeadZikrObject("60", "دعاء زيارة القبور المقابر الموتى الموت الزيارة ", " دُعَاءُ زِيَارَةِ القُبُورِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( السَّلَامُ عَلَيْكُمْ أهْلَ الدِّيَارِ، مِنَ المُؤْمِنِينَ، والمُسْلِمِينَ، وَإنَّا إنْ شَاءَ اللَّهُ بِكُمْ لاحِقُونَ، وَيَرْحَمُ اللَّهُ المُستَقْدِمينَ مِنَّا والمُستأخِرينَ ، أسألُ اللَّهَ لنَا وَلَكُمُ العَافِيَةَ ))"

                            , 1

                            , "مسلم 2 / 671، وابن ماجه واللفظ له 1 / 494 عن بريدة رضي الله عنه، وما بين المعكوفين من حديث عائشة رضي الله عنها عند مسلم 2 / 671."


                    )}
            ),


            ///////////////////////////////////    دُعَاءُ الرِّيْحِ    ////////////////////////////////
            ///////////////////////////////////    دُعَاءُ الرِّيْحِ    ////////////////////////////////


            new HeadZikrObject("61", "دعاء الريح الرياح العواصف العاصفة", "دُعَاءُ الرِّيْحِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَها، وأعُوذُ بِكَ مِنْ شَرِّهَا ))"

                            , 1

                            , "أخرجه أبو داود 4 / 326 وابن ماجه 2 / 1228 وانظر صحيح ابن ماجه 2 / 305."


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "(( اللَّهُمَّ إِنِّي أسْألُكَ خَيْرَهَا، وخَيْرَ مَا فِيْهَا، وَخَيْرَ مَا أُرْسِلَتْ بِهِ، وأعُوذُ بِكَ مِنْ شَرِّهَا، وَشَرِّ مَا فِيْهَا، وَشَرِّ مَا أُرْسِلَتْ بِهِ ))"

                            , 1

                            , "مسلم 2 / 666 برقم : 899 و اللفظ له \n  والبخاري 4 / 76."


                    )}

            ),


            ///////////////////////////////////     دُعَاءُ الرَّعْدِ    ////////////////////////////////
            ///////////////////////////////////     دُعَاءُ الرَّعْدِ    ////////////////////////////////


            new HeadZikrObject("62", "دعاء الرعد رعود البرق عواصف ", " دُعَاءُ الرَّعْدِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( سُبْحَانَ الَّذِي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ، و المَلائِكَةُ مِنْ خِيْفَتِهِ ))"

                            , 1

                            , "كان عبد الله بن الزبير رضي الله عنهما إذا سمع الرعد ترك الحديث وقال : . . . الحديث، الموطأ 2 / 992 وقال الألباني صحيح الإسناد موقوفا ."


                    )}
            ),


            ///////////////////////////////////    مِنْ أدْعِيَةِ الاسْتِسْقَاءِ    ////////////////////////////////
            ///////////////////////////////////    مِنْ أدْعِيَةِ الاسْتِسْقَاءِ    ////////////////////////////////


            new HeadZikrObject("63", " من أدعية الاستسقاء الإستسقاء المطر الأمطار", "مِنْ أدْعِيَةِ الاسْتِسْقَاءِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( اللَّهُمَّ أَسْقِنَا غَيْثاً مُغِيثاً مَرِيئاً مَرِيعاً، نَافِعاً، غَيْرَ ضَارٍّ، عَاجِلاً غَيْرَ آجِلٍ ))"

                            , 1

                            , "أبو داود 1 / 303 وصححه الألباني في صحيح أبي داود 1 / 216."


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "(( اللهم أغثنا ، اللهم أغثنا ، اللهم أغثنا ))"

                            , 1

                            , "البخاري 1 / 224 برقم 1014 \n ومسلم 2 / 613 برقم 897 "


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "(( اللَّهُمَّ اسْقِ عِبَادَكَ، وبَهَائِمكَ، وانْشُرْ رَحْمَتَكَ، وأحْيِي بَلَدَكَ المَيِّتَ ))"

                            , 1

                            , "أبو داود 1 / 305 وحسنه الألباني في صحيح أبي داود 1 / 218."


                    )}
            ),


            ///////////////////////////////////    الدُّعَاءُ إذَا رَأَى المَطَرَ    ////////////////////////////////
            ///////////////////////////////////    الدُّعَاءُ إذَا رَأَى المَطَرَ    ////////////////////////////////


            new HeadZikrObject("64", "الدعاء إذا رأى راي راى المطر الأمطار", "الدُّعَاءُ إذَا رَأَى المَطَرَ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( اللَّهُمَّ صَيِّباً نَافِعَاً ))"

                            , 1

                            , "البخاري مع الفتح 2 / 518."


                    )}

            ),


            ///////////////////////////////////    الذِّكْرُ بَعْدَ نُزُولِ المَطَرِ    ////////////////////////////////
            ///////////////////////////////////    الذِّكْرُ بَعْدَ نُزُولِ المَطَرِ    ////////////////////////////////


            new HeadZikrObject("65", "الدعاء إذا رأى راي راى نزل نزول بعد المطر الأمطار", "الذِّكْرُ بَعْدَ نُزُولِ المَطَرِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "((  مُطِرْنَا بِفَضْلِ اللهِ ورَحْمَتِهِ  ))"

                            , 1

                            , "البخاري 1 / 205 ومسلم 1 / 83."


                    )}
            ),

            ///////////////////////////////////    مِنْ أدْعِيَةِ الاسْتِصْحَاءِ    ////////////////////////////////
            ///////////////////////////////////    مِنْ أدْعِيَةِ الاسْتِصْحَاءِ    ////////////////////////////////


            new HeadZikrObject("66", "من أدعية الاستصحاء الإستصحاء", "مِنْ أدْعِيَةِ الاسْتِصْحَاءِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( اللَّهُمَّ حَوَالَيْنَا وَلَا عَلَيْنَا ، اللَّهُمَّ عَلَى الآكَامِ والظِّرَابِ ، وبُطُونِ الأوْدِيَةِ ، ومَنَابِتِ الشَّجَرِ ))"

                            , 1

                            , "البخاري 1 / 224 ومسلم 2 / 614. \n قوله : (( الاستصحاء )) وهو توقف المطر، وطلوع الشمس مشرقة."


                    )}
            ),


            ///////////////////////////////////    دُعَاءُ رُؤْيَةِ الهِلاَلِ    ////////////////////////////////
            ///////////////////////////////////    دُعَاءُ رُؤْيَةِ الهِلاَلِ    ////////////////////////////////


            new HeadZikrObject("67", "دعاء رؤية الهلال القمر الرؤيا الرؤية", "دُعَاءُ رُؤْيَةِ الهِلاَلِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( اللَّهُ أَكْبَرُ ، اللَّهُمَّ أَهِلَّهُ عَلَيْنَا بِالأمْنِ والِإيْمَانِ ، وَالسَّلامَةِ وَالإِسْلامِ، وَالتَّوْفِيْقِ لِمَا تُحِبُّ رَبَّنَا وَتَرْضَى ، رَبُّنَا ورَبُّكَ اللَّهُ ))"

                            , 1

                            , "الترمذي 5 / 504 والدارمي بلفظه 1 / 336 وانظر صحيح الترمذي 3 / 157."


                    )}

            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("68", "الدعاء عند إفطار الصائم افطار الافطار الإفطار الصوم الصيام", "الدُّعَاءُ عِِنْدَ إفْطَارِ الصَّائِمِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( ذَهَبَ الظَّمَأُ، وابْتَلَّتِ العُرُوقُ ، وثَبَتَ الأَجْرُ إِنْ شَاءَاللهُ ))"

                            , 1

                            , "أخرجه أبو داود 2 / 306 وغيره وانظر صحيح الجامع 4 / 209."


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "(( اللَّهُمَّ إنِّي أَسْألُكَ بِرَحْمَتِكَ الَّتِي وَسِعَتْ كُلَّ شَيْءٍ ، أنْ تَغْفِرَ لِي ))"

                            , 1

                            , "أخرجه ابن ماجه 1 / 557 من دعاء عبد الله بن عمرو رضي الله عنهما، وحسنه الحافظ في تخريج الأذكار انظر شرح الأذكار 4 / 342"


                    )}

            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("69", "الدعاء قبل الطعام الأكل الاكل الشرب الشراب", "الدُّعَاءُ قَبْلَ الطَّعَامِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( إذَا أكَلَ أحَدُكُمْ طَعَاماً؛ فَلْيَقُلْ :  بِسْمِ اللَّهِ ، فَإِنْ نَسِيَ فِي أوَّلِهِ ، فَلْيَقُلْ :  بِسْمِ اللَّهِ في أوَّلِهِ وآخِرِهِ ))"

                            , 1

                            , "أخرجه أبو داود 3 / 347 والترمذي 4 / 288 وانظر صحيح الترمذي 2 / 167."


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "(( مَنْ أطْعَمَهُ اللهُ الطَّعَامَ؛ فَلْيَقُلْ : اللَّهُمَّ بَارِكْ لَنَا فِيْهِ ، وأطْعِمْنَا خَيْراً مِنْهُ ، ومَنْ سَقَاهُ اللهُ لَبَناً فَلْيَقُلْ : اللَّهُمَّ بَارِكْ لَنَا فِيْهِ ، وَزِدْنَا مِنْهُ ))"

                            , 1

                            , "الترمذي 5 / 506 وانظر صحيح الترمذي 3 / 158."


                    )}

            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("70", "الدعاء بعد الفراغ الإنتهاء الانتهاء الطعام الأكل الاكل الشرب الشراب", "الدُّعَاءُ عِنْدَ الفَرَاغِ مِنَ الطَّعَامِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( الحَمْدُ للهِ الَّذِي أطْعَمَنِي هَذَا ، ورَزَقَنِيهِ ، مِنْ غَيْرِ حَوْلٍ مِنِّي ولا قُوَّةٍ ))"

                            , 1

                            , "أخرجه أصحاب السنن إلا النسائي : أبو داود برقم (4025)، والترمذي برقم (3458)، وابن ماجه برقم (3285) ، وانظر :  صحيح الترمذي (3/ 159) ."


                    ),


                    new ZikrObject(UUID.randomUUID().toString(), "(( الحَمْدُ للهِ حَمْداً كَثِيراً طَيِّباً مُبَارَكاً فِيهِ، غَيْرَ مَكْفِيٍّ ولا مُوَدَّعٍ، ولا مُسْتَغْنَىً عَنْهُ رَبَّنَا ))"

                            , 1

                            , "البخاري 6 / 214 والترمذي بلفظه 5 / 507."


                    )}
            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("71", "دعاء الضيف لصاحب الطعام صاحب الأكل الشرب الشراب الأطعمة", "دُعَاءُ الضَّيْفِ لِصَاحِبِ الطَّعَامِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( اللَّهُمَّ بَارِكْ لَهُمْ فِيمَا رَزَقْتَهُمْ ، واغْفِرْ لَهُمْ ، وارْحَمْهُمْ ))"

                            , 1

                            , "مسلم 3 / 1615 ، برقم 2042."


                    )}

            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("72", "التعريض بالدعاء لطلب الطعام أو الشراب الأكل الدعاء طلب ", "التَّعْرِيضُ بِالدُّعَاءِ لِطَلَبِ الطَّعَامِ أَوِ الشَّرَابِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( اللَّهُمَّ أطْعِمْ مَنْ أطْعَمَنِي ، وَاسْقِ مَنْ سَقَانِي ))"

                            , 1

                            , "مسلم 3 / 1626 ، برقم 2055 ."


                    )}
            ),


            ///////////////////////////////////   الدُّعَاءُ إذَا أَفْطَرَ عِنْدَ أَهْلِ بَيْتٍ    ////////////////////////////////
            ///////////////////////////////////    الدُّعَاءُ إذَا أَفْطَرَ عِنْدَ أَهْلِ بَيْتٍ    ////////////////////////////////


            new HeadZikrObject("73", "الدعاء إذا أفطر عند أهل بيت", "الدُّعَاءُ إذَا أَفْطَرَ عِنْدَ أَهْلِ بَيْتٍ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( أفْطَرَ عِنْدَكُمُ الصَّائِمُونَ ، وَأَكَلَ طَعَامَكُمُ الأَبْرَارُ ، وَصَلَّتْ عَلَيْكُمُ المَلائِكَةُ ))"

                            , 1

                            , "سنن أبي داود (3/ 367) برقم (3856)، وابن ماجة (1/ 556) برقم (1747)، والنسائي في عمل اليوم والليلة برقم (296 - 298)، ونص على أنه  - صلى الله عليه وسلم -  يقوله إذا أفطر عند أهل بيت ، وصححه الألباني في صحيح أبي داود (2/ 730)."


                    )}

            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("74", "دعاء الصائم إذا حضر الطعام و لم يفطر الإفطار الافطار الصوم الصيام", "دُعَاءُ الصَّائِم إذَا حَضَرَ الطَّعَامُ وَلَمْ يُفْطِر", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( إذَا دُعِيَ أَحَدُكُمْ فَلْيُجِبْ ، فَإِنْ كَانَ صَائِماً فَلْيُصَلِّ ، وَإنْ كَانَ مُفْطِراً فَلْيَطْعَمْ )) \n ومَعنَى فَلْيُصَلِّ ؛ أيْ : فَلْيَدْعُ."

                            , 1

                            , "مسلم (2 / 1054) برقم (1150) ."


                    )}
            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("75", "ما يقول الصائم إن سابه أحد سب سباب شتم الشتائم الصوم الصائم الصيام رمضان", "مَا يَقُولُ الصَّائِمُ إذَا سَابَّهُ أحَدٌ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "((  إِنِّي صَائِمٌ ، إنِّي صَائِمٌ  ))"

                            , 1

                            , "البخاري مع الفتح (4/ 103) برقم (1894)، ومسلم (2/ 806) برقم (1151)."


                    )}

            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("76", "الدعاء عند رؤية باكورة الثمر الثمار رؤيت  رؤيا", "الدُّعَاءُ عِنْدَ رُؤْيَةِ بَاكُورَةِ الثَّمَرِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( اللَّهُمَّ بَارِكْ لَنَا فِي ثَمَرِنَا، وبَارِكْ لَنَا فِي مَدِيْنَتِنَا، وبَارِكْ لَنَا فِي صَاعِنَا، وبَارِكْ لَنَا فِي مُدِّنَا ))"

                            , 1

                            , "مسلم (2/ 1000) برقم (1373) .\n قوله: (( باكورة الثمرة )) أي : أول الثمرة."


                    )}

            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("77", "دعاء العطاس العطس العطسة", "دُعَاءُ العُطَاسِ", new ZikrObject[]{

                    new ZikrObject(UUID.randomUUID().toString(), "(( إِذَا عَطَسَ أحَدُكُمْ فَلْيَقُلْ : الحَمْدُ للَّهِ ، وَلْيَقُلْ لَهُ أخُوهُ أَوْ صَاحِبُهُ: يَرْحَمُكَ اللَّهُ ، فَإِذَا قَالَ لهُ يَرْحَمُكَ اللَّهُ ، فَلْيَقُلْ : يَهْدِيكُمُ اللَّهُ ، ويُصْلِحُ بَالَكُمْ ))"

                            , 1

                            , "البخاري (7/ 125) برقم (5870) ."


                    )}
            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("78", "ما يقال للكافر إذا عطس فحمد الله حمد الحمد الكافرين العطاس العطس عطسة", "مَا يُقَالُ لِلْكَافِرِ إِذَا عَطَسَ فَحَمِدَ اللهَ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( يَهْدِيكُمُ اللَّهُ ، ويُصْلِحُ بَالَكُمْ ))"

                            , 1

                            , "الترمذي (5/ 82) برقم (2741)، وأحمد (4/ 400)، وأبو داود (4/ 308) برقم (5038)، وانظر: صحيح الترمذي (2/ 354)."


                    )}

            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("79", "الدعاء المتزوج للمتزوج الزواج ", "الدُّعَاءُ للمُتَزَوِّجِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( بَارَكَ اللَّهُ لَكَ ، وبَارَكَ عَلَيْكَ ، وجَمَعَ بَيْنَكُمَا فِي خَيْرٍ ))"

                            , 1

                            , "أخرجه أصحاب السنن إلا النسائي : أبو داود برقم (2130)، والترمذي برقم (1091)، وابن ماجة برقم (1905)، والنسائي في عمل اليوم والليلة ، برقم 259 وانظر: صحيح الترمذي  (1/ ٣١٦)."


                    )}
            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("80", "دعاء المتزوج و شراء الدابة المركوب السيارة الزواج ", "دُعَاءُ المُتَزوِّجِ وَشِرَاءِ الدَّابَةِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( إذَا تَزَوَّجَ أحَدُكُمُ امْرَأةً، أوْ إذَا اشْتَرَى خَادِماً؛ فَلْيَقُلِ: اللَّهُمَّ إنِّي أسْألُكَ خَيْرَهَا، وخَيْرَ مَا جَبَلتَها عَلَيْهِ، وأعُوْذُ بِكَ مِنْ شَرِّهَا، وشَرِّ مَا جَبَلْتَهَا عَلَيْهِ، وإذَا اشْتَرى بَعِيْراً؛ فَلْيَأخُذْ بِذِرْوَةِ سَنَامِهِ؛ وَلْيَقُلْ مِثْلَ ذَلِكَ ))"

                            , 1

                            , "أبو داود (2/ 248) برقم (2160)، وابن ماجه (1/ 617) برقم (1918)، وانظر صحيح ابن ماجه (1/ 324)."


                    )}

            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("81", "الدعاء قبل إتيان الزوجة الزواج الجماع اتيان", "الدُّعَاءُ قَبْلَ إِتْيَانِ الزَّوْجَةِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( بِسْمِ اللَّهِ ، اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ ، وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا ))"

                            , 1

                            , "البخاري (6/ 141) برقم (141)، ومسلم (2/ 1028) برقم (1434)."


                    )}

            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("82", "دعاء الغضب غضبان غاضب", "دُعَاءُ الغَضَبِ", new ZikrObject[]{

                    new ZikrObject(UUID.randomUUID().toString(), "(( أعُوذُ باللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ ))"

                            , 1

                            , "البخاري (7/ 99) برقم (3282)، ومسلم (4 / 2015) برقم (2610)."


                    )}
            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("83", "دعاء من رأى راي راى مبتلآ مبتلى ابتلاء الابتلاء الإبتلاء", "دُعَاءُ مَنْ رأى مُبْتَلى", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( الحَمْدُ لِلَّهِ الَّذِي عَافَانِي مِمَّا ابْتَلاكَ بِهِ، وَفَضَّلَنِي عَلَى كَثيرٍ مِمَّنْ خَلَقَ تَفْضِيلاً ))"

                            , 1

                            , "الترمذي (5/ 494)، (5/ 493) [برقم (3432)]، وانظر: صحيح الترمذي (3/ 153)."


                    )}
            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("84", "ما يقال في المجلس المجالس", "مَا يُقَالُ فِي المَجْلِسِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "عَنِ ابْنِ عُمَرَ  -  رضي الله عنهما  -  قَالَ :  كَانَ يُعَدُّ لِرَسُولِ اللَّهِ  - صلى الله عليه وسلم -  فِي المَجْلِس الوَاحِدِ مِئَةُ مَرَّةٍ مِنْ قَبْلِ أنْ يَقُومَ :  (( رَبِّ اغْفِرْ لِي، وتُبْ عَلَيَّ، إِنَّكَ أنْتَ التَّوَّابُ الغَفُورُ ))"

                            , 1

                            , "الترمذي [برقم (3434)]، وغيره، وانظر: صحيح الترمذي (3/ 153)، وصحيح ابن ماجة (2/ 321)، ولفظه للترمذي."


                    )}
            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("85", "كافارة الكفارة تكفير المجالس المجلس", "كَفَّارَةُ المَجْلِسِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ ، أشْهَدُ أنْ لَا إِلَهَ إِلاَّ أنْتَ ، أسْتَغْفِرُكَ وأَتُوبُ إِلَيْكَ ))"

                            , 1

                            , "أخرجه أصحاب السنن [أبو داود برقم (4858)، والترمذي برقم (3433)، والنسائي في عمل اليوم والليلة برقم (1344)]، وانظر: صحيح الترمذي (3/ 153)، وقد ثبت أن ((عائشة - رضي الله عنها - قالت: ما جلس رسول الله - رضي الله عنهما - مجلساً، ولا تلا قرآنا، ولا صلى صلاة إلاختم ذلك بكلمات ... )) الحديث، أخرجه النسائي في عمل اليوم والليلة برقم (308)، وأحمد (6/ 77)، وصححه الدكتور فاروق حمادة في تحقيقه لـ ((عمل اليوم والليلة)) للنسائي (ص 273)."


                    )}
            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("86", "الدعاء من لمن قال غفر الله لك", "الدُّعَاءُ لِمَنْ قَالَ: غَفَرَ اللهُ لَكَ", new ZikrObject[]{

                    new ZikrObject(UUID.randomUUID().toString(), "((  وَلَكَ  ))"

                            , 1

                            , "أحمد 5 / 82 والنسائي في عمل اليوم والليلة ص 218 برقم 421 تحقيق الدكتور فاروق حمادة."


                    )}
            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("87", "الدعاء لمن من صنع إليك اليك معروفا المعروف", "الدُّعَاءُ لِمَنْ صَنَعَ إلَيْكَ مَعْرُوفاً", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "((  جَزَاكَ اللهُ خَيْراً  ))"

                            , 1

                            , "أخرجه الترمذي رقم 2035 وانظر صحيح الجامع 6244 وصحيح الترمذي 2 / 200."


                    )}
            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("88", "ما يعصم الله به من الدجال المسيح عصمة العصمة", "مَا يَعْصِمُ اللهُ بِهِ مِنَ الدَّجَّالِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( مَنْ حَفِظَ عَشْر آيَاتٍ مِنْ أوَّلِ سُورَةِ الكَهْفِ، عُصِمَ مِنَ الدَّجَّالِ )) \n والاسْتِعَاذَةُ باللهِ مِنْ فِتْنَتِهِ، عَقِبَ التَّشَهُّدِ الأخيرِ، مِنْ كُلِّ صَلاةٍ"

                            , 1

                            , "مسلم 1 / 555، وفي رواية من آخر الكهف 1 / 556. \n انظر حديث رقم 55 وحديث 56 ص 41 من هذا الكتاب."


                    )}

            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("89", "الدعاء لمن من قال أحبك احبك الحب في الله", "الدُّعَاءُ لِمَنْ قَالَ إنِّي أُحِبُّكَ فِي اللَّهِ", new ZikrObject[]{

                    new ZikrObject(UUID.randomUUID().toString(), "(( أحَبَّكَ الَّذِي أحْبَبْتَنِي لَهُ ))"

                            , 1

                            , "أخرجه أبو داود (4/ 333) [برقم (5125)]، وحسنه الألباني في صحيح سنن أبي داود (3/ 965)."


                    )}

            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("90", "الدعاء لمن من عرض عليك ماله المال", "الدُّعَاءُ لِمَنْ عَرَضَ عَلَيْكَ مَالَهُ", new ZikrObject[]{

                    new ZikrObject(UUID.randomUUID().toString(), "(( بَارَك اللَّهُ لَكَ فِي أهْلِكَ ومَالِكَ ))"

                            , 1

                            , "البخاري مع الفتح (4/ 288) [برقم (2049)]."


                    )}

            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("91", "الدعاء لمن من أقرض عند القضاء الدين الديون الوفاء القرض", "الدُّعَاءُ لِمَنْ أقْرَضَ عِنْدَ القَضَاءِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( بَارَكَ اللَّهُ لَكَ فِي أهْلِكَ وَمَالِكَ ، إنَّمَا جَزَاءُ السَّلَفِ الحَمْدُ والأدَاءُ ))"

                            , 1

                            , "أخرجه النسائي في ((عمل اليوم والليلة)) (ص 300) ، وابن ماجه (2/ 809) [برقم (2424)]، وانظر ((صحيح ابن ماجه)) (2/ 55)."


                    )}
            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("92", "دعاء الخوف من الشرك الكفر", "دُعَاءُ الخَوْفِ مِنَ الشِّرْكِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( اللَّهُمَّ إنِّي أعُوذُ بِكَ أنْ أُشْرِكَ بِكَ وأنَا أعْلَمُ، وأسْتَغْفِرُكَ لِمَا لا أعْلَمُ ))"

                            , 1

                            , "أحمد ٤ / ٤٠٣ ، برقم : ١٩٩٠٦ \n  و الأدب المفرد للبخاري برقم : ٧١٦ \n وانظر صحيح الجامع ٣ / ٢٣٣ و صحيح الترغيب والترهيب للألباني ١ / ١٩ "


                    )}
            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("93", "الدعاء لمن من قال بارك الله فيك", "الدُّعاءُ لِمَنْ قالَ بَارَكَ اللهُ فيكَ", new ZikrObject[]{

                    new ZikrObject(UUID.randomUUID().toString(), "((  وَفِيكَ بَارَكَ اللَّهُ  ))"

                            , 1

                            , "أخرجه ابن السني (ص 138) برقم (278)، وانظر: ((الوابل الصيب)) لابن القيم (ص 304) تحقيق بشير محمد عيون."


                    )}
            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("94", "دعاء كراهية كره الطيرة التطير التشاؤم الشؤم النحس", "دُعَاءُ كَرَاهِيةِ الطِّيَرَةِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "((  اللَّهُمَّ لَا طَيْرَ إِلَّا طَيْرُكَ، وَلَا خَيْرَ إِلَّا خَيْرُكَ، وَلَا إِلَهَ غَيْرُكَ  ))"

                            , 1

                            , "أحمد (2/ 220)، وابن السني برقم (292)، وصححه الألباني في ((الأحاديث الصحيحة)) (3/ 54) رقم (1065)، أما الفأل فكان يعجب النبي - رضي الله عنهما -، ولهذا سمع من رجل كلمة طيبة، فأعجبته فقال: ((أخذنا فألك من فيك))، أبو داود [برقم (3719)]، وأحمد، وصححه الألباني في ((الصحيحة)) (2/ 363) عند أبي الشيخ في ((أخلاق النبي - صلى الله عليه وسلم -)) (ص 270)."


                    )}
            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("95", "دعاء الركوب المركوب السيارة الطيارة الدابة السفر", "دُعَاءُ الرُّكُوبِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( بِسْمِ الله ِ، الحَمْدُ للهِ  { سُبحانَ الَّذي سَخَّرَ لَنا هذا وَما كُنّا لَهُ مُقرِنينَ  وَإِنّا إِلى رَبِّنا لَمُنقَلِبونَ } \n الحَمْدُ لِلَّهِ ، الحَمْدُ لِلَّهِِ ، الحَمْدُ لِلَّهِِ، اللَّهُ أكبَرُ، اللَّهُ أكْبَرُ، اللَّهُ أكْبَرُ، سُبْحانَكَ اللَّهُمَّ إِنِّي ظَلمْتُ نَفْسِي، فَاغْفِرْ لِي، فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أنْتَ ))"

                            , 1

                            , "أبو داود (3/ 34) [برقم (2602)]، والترمذي (5/ 501) [برقم (3446)]، وانظر ((صحيح الترمذي)) (3/ 156). \n الآيتان من سورة [الزخرف : ١٣-١٤]"


                    )}
            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("96", "دعاء السفر المسافر الركوب السيارة الطيارة", "دُعَاءُ السَّفَرِ", new ZikrObject[]{

                    new ZikrObject(UUID.randomUUID().toString(), "(( اللهُ أكْبَرُ، اللهُ أكْبَرُ، اللهُ أكْبَرُ ،  { سُبحانَ الَّذي سَخَّرَ لَنا هذا وَما كُنّا لَهُ مُقرِنينَ  ووَإِنّا إِلى رَبِّنا لَمُنقَلِبونَ } . \n  اللَّهُمَّ إنَّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا البِرَّ والتَّقْوى، ومِنَ العَمَلِ مَا تَرْضَى، اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَاطْوِ عَنَّا بُعْدَهُ، اللَّهُمَّ أنْتَ الصَّاحِبُ فِي السَّفَرِ، والخَلِيفَةُ فِي الأهْلِ، اللَّهُمَّ إنِّي أعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ، وَكآبَةِ المَنْظَرِ، وسُوءِ المُنْقَلَبِ فِي المَالِ والأهْلِ )) ، \n وإذَا رَجَعَ قَالَهُنَّ وزَادَ فِيهِنَّ :  (( آيبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبِّنَا حَامِدُونَ ))"

                            , 1

                            , "مسلم (2/ 978) [برقم (1342)]."


                    )}

            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("97", "دعاء دخول القرية أو البلدة المدينة ", "دُعَاءُ دُخُولِ القَرْيَةِ أوِ البَلْدَةِ", new ZikrObject[]{

                    new ZikrObject(UUID.randomUUID().toString(), "(( اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ ومَا أظْلَلْنَ، ورَبَّ الأرْضِينَ السَّبْعِ ومَا أقْلَلْنَ، ورَبَّ الشَّيَاطِينِ ومَا أضْلَلْنَ، ورَبَّ الرِّيَاحِ ومَا ذَرَيْنَ، أسْأَلُكَ خَيْرَ هَذِهِ القَرْيَةِ وخَيْرَ أهْلِهَا، وخَيْرَ مَا فِيهَا، وأعُوذُ بِكَ مِنْ شَرِّهَا، وشَرِّ أهْلِهَا، وشَرِّ مَا فِيْهَا ))"

                            , 1

                            , "الحاكم وصححه ووافقه الذهبي (2/ 100)، وابن السني برقم (524)، وحسنه الحافظ في تخريج الأذكار (5/ 154)، قال ابن باز: ورواه النسائي [في عمل اليوم والليلة برقم (547 - 548)] بإسناد حسن، انظر: تحفة الأخيار (ص 37)."


                    )}

            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("98", "دعاء دخول السوق الأسواق الاسواق", "دُعَاءُ دُخُولِ السُّوقِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "(( لَا إلَهَ إِلاَّ اللَّهُ وَحْدَهُ لَا شَرِيْكَ لَهُ ، لَهُ المُلْكُ وَلَهُ الحَمْدُ ، يُحْيِي وَيُمِيتُ ، وَهُوَ حَيٌّ لَا يَمُوتُ ، بِيَدِهِ الخَيْرُ ، وَهُوَ عَلَى كُلِّ شَيءٍ قَدِيرٌ ))"

                            , 1

                            , "الترمذي برقم ٣٤٢٨ ،\n و ابن ماجة ٥ / ٢٩١ برقم ٣٨٦٠ ،\n و الحاكم ١ / ٥٣٨ ،\n و حسنه الألباني في صحيح ابن ماجة ٢ / ٢١ ، وفي صحيح الترمذي ٣ / ١٥٢ "


                    )}

            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("99", "الدعاء إذا تعس المركوب", "الدُّعَاءُ إذَا تَعِسَ المَرْكُوبُ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "((  بِسْمِ اللَّهِ  ))"

                            , 1

                            , "أبو داود (4/ 296) [برقم (4982)]، وصححه الألباني في صحيح أبي داود (3/ 941)."


                    )}

            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


            new HeadZikrObject("100", "دعاء المسافر للمقيم المقيم السفر المسافرون المقيمين", "دُعَاءُ المُسَافِرِ للمُقِيمِ", new ZikrObject[]{


                    new ZikrObject(UUID.randomUUID().toString(), "((  أَسْتَوْدِعُكُمُ الله َ، الَّذِي لَا تَضِيعُ وَدَائِعُهُ  ))"

                            , 1

                            , "أحمد (2/ 403)، وابن ماجة (2/ 943) [برقم (2825)]، وانظر ((صحيح ابن ماجة)) (2/ 133)."


                    )}

            ),


            ///////////////////////////////////    أذكار النوم    ////////////////////////////////
            ///////////////////////////////////    أذكار النوم    ////////////////////////////////


           new HeadZikrObject( "101",  "دعاء المسافر للمقيم المقيم للمسافر السفر المسافرون المقيمين" ,"دُعَاءُ المُقِيْمِ للمُسَافِر" , new ZikrObject[]{


     new   ZikrObject(UUID.randomUUID().toString(),  "(( أَسْتَودِعُ اللهَ دِيْنَكَ ، وَأَمَانَتَكَ ، وَخَوَاتِيمَ عَمَلِكَ ))"

                , 1

                ,  "أحمد ٢ / ٧ برقم : ٤٥٢٤ \n والترمذي ٥ / ٤٩٩ برقم : ٢٤٤٣ \n وصححه الألباني في صحيح سنن الترمذي ٣ / ٤١٩ "


                ) ,


        new ZikrObject(UUID.randomUUID().toString(),  "(( زَوَّدَكَ اللهُ التَّقْوَى ، وَغَفَرَ ذَنْبَكَ ، ويَسَّرَ لَكَ الخَيْرَ حَيْثُمَا كُنْتَ ))"

                ,  1

                ,  "الترمذي وانظر صحيح الترمذي 3 / 155."


                )}

                ) ,





        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////


    new     HeadZikrObject( "102", "التكبير و التسبيح في سير السفر المسافر" ,  "التَّكْبِيْرُ والتَّسْبِيحُ فِي سَيْرِ السَّفَرِ" , new ZikrObject[]{


        new        ZikrObject(UUID.randomUUID().toString(),  "قال جابر  -  رضي الله عنه  - :  (( كُنَّا إذَا صَعَدْنَا كَبَّرْنَا، وَإذَا نَزَلْنَا سَبَّحْنَا ))"

                ,  1

                ,  "البخاري مع الفتح 6 / 135."


                )}

                ) ,





        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////


      new HeadZikrObject( "103","دعاء المسافر إذا أسحر السفر السحر" , "دُعَاءُ المُسَافِرِ إذَا أسْحَرَ" ,new ZikrObject[]{


               new ZikrObject(UUID.randomUUID().toString(), "(( سَمَّعَ سَامِعٌ بِحَمْدِ اللَّهِ ، وَحُسْنِ بَلائِهِ عَلَيْنَا، رَبَّنَا صَاحِبْنَا، وَأفْضِلْ عَلَيْنَا عَائِذاً بِاللهِ مِنَ النَّارِ ))"

                ,  1

                ,  "مسلم 4 / 2086  \n ومعنى سمع سامع :  أي شهد شاهد على حمدنا لله تعالى على نعمة وحسن بلائه. \n  ومعنى سمع سامع: بلغ سامع قولي هذا لغيره وقال مثله تنبيها على الذكر في السحر والدعاء. \n شرح النووي 17 / 39."


                )}

                ) ,





        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////

new HeadZikrObject( "104",  "الدعاء إذا نزل منزلا في سفر أو غيره المنزل السفر" ,  "الدُّعَاءُ إذَا نَزَل مَنْزِلاً فِي سَفرٍ أوْ غَيْرِهِ" , new ZikrObject[]{


           new     ZikrObject(UUID.randomUUID().toString(),  "(( أعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ ))"

                , 1

                ,  "مسلم 4 / 2080."


                )}
                ) ,





        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////


    new    HeadZikrObject( "105", "ذكر الرجوع من السفر المسافر العودة" , "ذِكْرُ الرُّجُوعِ مِنَ السَّفَرِ" , new ZikrObject[]{


                new ZikrObject(UUID.randomUUID().toString(),  " يُكَبِّرُ عَلَى كُلِّ شَرَفٍ ثَلاثَ تَكْبيرَاتٍ، ثُمَّ يَقُولُ :  (( لَا إِلَهَ إِلاَّ اللهُ وَحْدَهُ لا شَرِيْكَ لَهُ، لَهُ المُلْكُ ولَهُ الحَمْدُ، وهُوَ عَلَى كُلِّ شَيءٍ قَدِيرٌ، آيبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبِّنَا حَامِدُونَ، صَدَقَ اللهُ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وهَزَمَ الأحْزَابَ وَحْدَه  ))"

                ,  1

                ,  "كان النبي صلى الله عليه وسلم يقوله إذا قفل من غزو أو حج، \n البخاري 7 / 163 ومسلم 2 / 980."


                )}

                ) ,





        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////


     new    HeadZikrObject("106",  "ما يقول من أتاه أمر يسره أو يكرهه سرور فرح كره الفرح المسرة الكره شيء السرور" , "مَا يَقُولُ مَنْ أتَاهُ أمْرٌ يَسُرُّهُ أوْ يَكْرَهُهُ" , new ZikrObject[]{


                new ZikrObject(UUID.randomUUID().toString(),  "كَانَ  - صلى الله عليه وسلم -  إذَا أَتَاهُ الأمْرُ يَسُرُّهُ، قَالَ :  (( الحَمْدُ للهِ الَّذِي بِنِعْمَتهِ تَتِمُّ الصَّالِحَاتُ )) ،  وإذَا أتَاهُ الأمْرُ يَكْرَهُهُ، قَالَ :  (( الحَمْدُ للهِ عَلَى كُلِّ حَالٍ ))"

                ,  1

                ,  "أخرجه ابن السني في عمل اليوم والليلة والحاكم وصححه 1 / 499 وصححه الألباني في صحيح الجامع 4 / 201."


                )}

                ) ,





        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////


    new    HeadZikrObject("107", "فضل الصلاة على النبي صلى الله عليه وسلم الرسول السلام "
                , " فَضْلُ الصَّلاةِ عَلَى النَّبيِّ  ﷺ " , new ZikrObject[]{


                             new  ZikrObject(UUID.randomUUID().toString(),  "قَالَ  - صلى الله عليه وسلم - :  (( مَنْ صَلَّى عَلَيَّ صَلاةً صَلَّى اللهُ عَلَيْهِ بِهَا عَشْراً ))"

                ,  1

                ,  "أخرجه مسلم 1 / 288."


                ) ,


      new  ZikrObject(UUID.randomUUID().toString(),  "وَقَالَ  - صلى الله عليه وسلم - :  (( لَا تَجْعَلُوا قَبْرِي عيداً وَصَلُّوا عَلَيَّ؛ فَإِنَّ صَلاتَكُمْ تَبْلُغُنِي حَيْثُ كُنْتُمْ ))"

                , 1

                ,  "أبو داود 2 / 218 وأحمد 2 / 367 وصححه الألباني في صحيح أبي داود 2 / 383."


                ) ,


      new  ZikrObject(UUID.randomUUID().toString(),  "وقَالَ  - صلى الله عليه وسلم - :  (( البَخِيْلُ مَنْ ذُكِرْتُ عِنْدَهُ فَلَمْ: يُصَلِّ عَلَيَّ ))"

                ,  1

                , "الترمذي 5 / 551 وغيره وانظر صحيح الجامع 3 / 25 وصحيح الترمذي 3 / 177."


                ) ,


       new ZikrObject(UUID.randomUUID().toString(),  "وقَالَ  - صلى الله عليه وسلم - :  (( إنَّ للهِ مَلائكةً سَيَّاحِينَ فِي الأَرْضِ، يُبَلِّغُونِي مِنْ أُمَّتِي السَّلامَ ))"

                , 1

                ,  "النسائي، والحاكم 2 / 421، وصححه الألباني في صحيح النسائي 1 / 274."


                ) ,


    new    ZikrObject(UUID.randomUUID().toString(),  "وَقَالَ  - صلى الله عليه وسلم - :  (( مَا مِنْ أحَدٍ يُسَلِّمُ عَلَيَّ، إلاَّ رَدَّ اللهُ عَلَيَّ رُوْحِي، حَتَّى أرُدَّ عَلَيْهِ السَّلامَ ))"

                ,  1

                ,  "أبو داود برقم 2041 وحسنه الألباني في صحيح أبي داود 1 / 383."


                )}

                ) ,





        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////


       new  HeadZikrObject( "108",  "إفشاء السلام افشاء التسليم " ,  "إِفْشَاءُ السَّلاَمِ" , new ZikrObject[]{


             new   ZikrObject(UUID.randomUUID().toString(),  "قَالَ رَسُولُ اللهِ  - صلى الله عليه وسلم - :  (( لاَ تَدْخُلُوا الجَنَّة حَتَّى تُؤْمِنُوا، وَلَا تُؤْمِنُوا حَتَّى تَحَابُّوا، أَوَلَا أدُلُّكُمْ عَلَى شَيءٍ إذَا فَعَلْتُمُوهُ تَحَابَبْتُمْ، أَفْشُوا السَّلامَ بَيْنَكُمْ ))"

                , 1

                ,  "مسلم (1/ 74) [برقم (54)]، وأحمد برقم 1430 ، واللفظ له ، ولفظ مسلم : ((لاتدخلون...))."


                ) ,


    new    ZikrObject(UUID.randomUUID().toString(),  "(( ثَلاثٌ مَنْ جَمَعَهُنَّ فَقَدْ جَمَعَ الإيْمَانَ : الإنْصَافُ مِنْ نَفْسِكَ، وبَذْلُ السَّلاَمِ للعَالَمِ، والإنْفَاقُ مِنَ الإِقْتَارِ ))"

                ,  1

                ,  "البخاري مع الفتح (1/ 82) [ برقم (28)]،  عن عمار  -رضي الله عنه- موقوفا ً معلقاً."


                ) ,


      new  ZikrObject(UUID.randomUUID().toString(), "وعَنْ عَبْدِ اللهِ بْنِ عَمْرٍو رَضِيَ اللهُ عَنهُمَا :  أنَّ رَجُلاً سَأَلَ النَّبيَّ  - صلى الله عليه وسلم -  أَيُّ الإِسْلامِ خَيْرٌ ؟  قَالَ :  (( تُطْعِمُ الطَّعَامَ، وتَقْرَأُ السَّلامَ عَلَى مَنْ عَرَفْتَ ومَنْ لَمْ تَعْرِف ))"

                ,  1

                ,  "البخاري مع الفتح (1/ 55) [برقم (12)]، ومسلم (1/ 65)]. برقم (39) ."


                )}

                ) ,





        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////


       new HeadZikrObject("109",  "كيف يرد الرد السلام على الكافرين إذا سلام ألقى السلام التحية" , "كَيْفَ يَرُدُّ السَّلامَ عَلَى الكَافِرِ إذَا سَلَّمَ" , new ZikrObject[]{


              new  ZikrObject(UUID.randomUUID().toString(),  "(( إذَا سَلَّم عَلَيْكُمْ أهْلُ الكِتَابِ؛ فَقُولُوا : وَعَلَيْكُمْ ))"

                , 1

                ,  "البخاري مع الفتح (11/ 42) [برقم (6258)]، ومسلم (4/ 1705) [برقم (2163)]."


                )}

                ) ,





        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////


       new HeadZikrObject( "110",  "الدعاء عند سماع صوت صياح الديك نهيق الحمار الحمير الديكة" , "الدعاءُ عِنْدَ سَمَاعِ صِيَاحِ الدِّيْكِ ونَهيقِ الحِمَارِ" , new ZikrObject[]{


            new    ZikrObject(UUID.randomUUID().toString(),  "((  إذَا سَمِعْتُمْ صِيَاحَ الدِّيَكَةِ فَاسْألُوا اللهَ مِنْ فَضْلِهِ؛ فَإِنَّهَا رَأَتْ مَلَكَاً، وَإذَا سَمِعْتُمْ نَهِيقَ الحِمَارِ فَتَعوَّذُوا بِاللَّهِ مِنَ الشَّيْطَانِ؛ فَإِنَّهُ رَأى شَيْطَاناً  ))"

                ,  1

                ,  "البخاري مع الفتح (6/ 350) [برقم (3303)]، ومسلم (4/ 2092) [برقم (2729)]."


                )}

                ) ,





        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////


   new     HeadZikrObject( "111", "الدعاء عند سماع صوت نباح الكلب الكلاب في الليل ليلا" , "الدُّعَاءُ عِنْدَ سَمَاعِ نُبَاحِ الكِلاَبِ بِاللَّيلِ" , new ZikrObject[]{


              new  ZikrObject(UUID.randomUUID().toString(),  "(( إذَا سَمِعْتُمْ نُبَاحَ الكِلاَبِ ونَهِيقَ الحَمِيرِ بِاللَّيْلِ، فَتَعَوَّذُوا مِنْهُنَّ فإنَّهُنَّ يَرَيْنَ مَا لا تَرَوْنَ ))"

                , 1

                , "أبو داود (4/ 327) [برقم (5105)]، وأحمد (3/ 306)،وصححه الألباني في صحيح أبو داود (3/ 961)."


                )}

                ) ,





        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////


      new  HeadZikrObject("112",  "الدعاء لمن سببته سب شتم الشتم السباب الشتائم" ,"الدُّعَاءُ لِمَنْ سَبَبْتَهُ" , new ZikrObject[]{


            new    ZikrObject(UUID.randomUUID().toString(),  "قَالَ  - صلى الله عليه وسلم - :  (( اللَّهُمَّ فَأَيُّمَا مُؤْمِنٍ سَبَبْتُهُ ؛ فَاجْعَلْ ذَلِكَ لَهُ قُرْبَةً إلَيْكَ يَوْمَ القِيَامَةِ ))"

                ,  1

                , "البخاري مع ((الفتح)) (11/ 171) [برقم (6361)] ، ومسلم (4/ 2007) [برقم (396)]  \n ولفظه : (( فاجعلها له زكاة ورحمة )) ."


                )}

                ) ,





        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////


        new HeadZikrObject( "113",  "ما يقول المسلم إذا مدح مديح زكى زكي تزكية المدح" , "مَا يَقُولُ المُسْلِمُ إذَا مَدَحَ المُسْلِمَ" , new ZikrObject[]{


            new    ZikrObject(UUID.randomUUID().toString(),  "قَالَ  - صلى الله عليه وسلم - :  (( إذَا كَانَ أحَدُكُمْ مَادِحاً صَاحِبَهُ لاَ مَحَالَةَ؛ فَلْيَقُل: أحْسِبُ فُلاناً : واللهُ حَسِيْبُهُ، وَلَا أُزَكِّي عَلَى اللهِ أحَداً :  أحْسِبُهُ  - إنْ كَانَ يَعْلمُ ذَاكَ -  كَذَا وكَذَا ))"

                , 1

                ,  "رواه مسلم (4/ 2296) [برقم (3000)]."


                )}
                ) ,





        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////


        new HeadZikrObject( "114", "ما يقول المسلم إذا مدح مديح زكى زكي تزكية المدح" ,  "مَا يَقُولُ المُسْلِمُ إِذَا زُكِّيَ" , new ZikrObject[]{


             new   ZikrObject(UUID.randomUUID().toString(), "((  اللَّهُمَّ لا تُؤَاخِذْنِي بِمَا يَقُولُونَ، واغْفِر لِي مَا لَا يَعْلَمُونَ  [  واجْعَلْنِي خَيْراً مِمَّا يَظُنُّونَ  ]  ))"

                , 1

                ,"البخاري في الأدب ((المفرد)) برقم (761)، وصحح إسناده الألباني في ((صحيح الأدب المفرد)) برقم (585)، وما بين المعقوفتين زيادة للبيهقي في ((شعب الإيمان)) (4/ 228) من طريق آخر."


                )}
                ) ,





        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////


        new HeadZikrObject( "115",  "كيف يلبي المحرم في الحج و العمرة التلبية الحاج المعتمر الإحرام مكة " , "كَيْفَ يُلَبِّي المُحْرِمُ فِي الحَجِّ أَوِ العُمْرَةِ" , new ZikrObject[]{


            new    ZikrObject(UUID.randomUUID().toString(),  "(( لَبَّيْكَ اللَّهُمَّ لبَّيْكَ، لَبَّيْكَ لا شَرِيْكَ لَكَ لَبَّيْكَ، إنَّ الحَمْدَ، والنِّعْمَةَ، لَكَ والمُلْكَ، لا شَرِيْكَ لَكَ ))"

                ,1

                ,"البخاري مع ((الفتح)) (3/ 408) [برقم (1549)]، ومسلم (2/ 841) [برقم (1184)]."


                )}
                ) ,





        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////


       new HeadZikrObject( "116",  "التكبير إذا أتى الحجر الأسود الاسود" ,  "التَّكْبيرُ إذَا أتَى الحَجَرَ الأسْوَدَ" ,new ZikrObject[]{


             new  ZikrObject(UUID.randomUUID().toString(),  "(( طَافَ النَّبيُّ - صلى الله عليه وسلم - بالبَيْتِ عَلَى بَعِيرٍ، كُلَّمَا أتَى الرُّكْنَ أشَارَ إلَيْهِ بِشَيءٍ عِنْدَهُ وَكَبَّرَ ))"

                , 1

                ,  "البخاري مع الفتح 3 / 476 والمراد بالشيء المحجن. انظر: البخاري مع الفتح 3 / 472."


                )}

                ) ,





        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////


      new  HeadZikrObject("117", "الدعاء بين الركن اليماني و الحجر الأسود الاسود" ,"الدُّعَاءُ بَيْنِ الرُّكْنِ اليَمَانِي والحَجَرِ الأسْوَدِ" , new ZikrObject[]{


              new  ZikrObject(UUID.randomUUID().toString(),  "((  رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ  ))"

                ,  1

                , "أبو داود (2/ 179) [برقم (1894)] وأحمد، (3/ 411)، والبغوي في شرح السنة (7/ 128)، وحسَّنه الألباني في ((صحيح أبي داود)) (1/ 354) ،  \n والآيه من سورة البقرة : 201."


                )}
                ) ,


        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////


      new  HeadZikrObject("118",  "دعاء الوقوف على الصفا و المروة السعي المسعى المروا" ,  "دُعَاءُ الوُقُوفِ عَلَى الصَّفَا والمَرْوَةِ" , new ZikrObject[]{


               new ZikrObject(UUID.randomUUID().toString(),  "(( لَمَّا دَنَا النَّبِيُّ  - صلى الله عليه وسلم -  مِنَ الصَّفَا قَرَأ :  { إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ }  (( أبْدَأ بِمَا بَدَأَ اللهُ بِهِ ))  فَبَدأ بالصَّفَا، فَرَقِيَ عَلَيْهِ، حَتَّى رَأَى البَيْتَ، فاسْتَقْبَلَ القِبْلَةَ، فَوَحَّدَ اللهَ، وَكَبَّرَهُ، وَقَالَ : (( لَا إِلَهَ إِلاَّ اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ ولَهُ الحَمْدُ، وَهُوَ عَلَى كُلِّ شَيءٍ قَديرٌ، لَا إلَهَ إِلاَّ اللهُ وَحْدَهُ، أَنْجَزَ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وهَزَمَ الأَحْزَابَ وَحْدَهُ، ثُمَّ دَعَا بَيْنَ ذَلِكَ، قَالَ مِثْلَ هَذَا ثَلاثَ مَرَّاتٍ ... ، الحَديْثُ، وَفيهِ :  فَفَعَلَ عَلَى المَرْوَةِ كَمَا فَعَلَ عَلَى الصَّفَا ))"

                ,  3

                , "مسلم (2/ 888) [برقم (1218)] ، \n  والآية رقم ١٥٨، من سورة البقرة."


                )}

                ) ,


        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////


      new  HeadZikrObject("119",  "الدعاء يوم عرفة الحج الحاج" , " الدُّعَاءُ يَوْمَ عَرَفَةَ" , new ZikrObject[]{


                new ZikrObject(UUID.randomUUID().toString(),  "(( خَيْرُ الدُّعَاءِ دُعَاءُ يَوْمِ عَرَفَةَ، وخَيْرُ مَا قُلْتُ أنَا وَالنَّبيُّونَ مِنْ قَبْلِي :  لَا إِلَهَ إِلاَّ اللهُ وَحْدَهُ لا شَرِيْكَ لَهُ، لَهُ المُلْكُ، ولَهُ الحَمْدُ، وَهُوَ عَلَى كُلِّ شَيءٍ قَدِير ))"

                , 1

                , "الترمذي [برقم (3585)]، وحسنه الألباني في صحيح الترمذي (3/ 184)، وفي الأحاديث الصحيحة (4/ 6)."


                )}

                ) ,



        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////


       new  HeadZikrObject( "120", "الذكر عند المشعر الحرام مزدلفة الحج الحاج الإحرام" ,  "الذِّكْرُ عِنْدَ المَشْعَرِ الحَرَامِ" , new ZikrObject[]{


           new     ZikrObject(UUID.randomUUID().toString(), "رَكِبَ  - صلى الله عليه وسلم -  القَصْوَاءَ حَتَّى أتَى المَشْعَرَ الحَرَامَ، فَاسْتَقْبَلَ القِبْلَةَ (( فَدَعاهُ، وكَبَّرَهُ، وهَلَّلَهُ، ووَحَّدَهُ )) فَلَمْ يَزَلْ وَاقِفاً حَتَّى أسْفَرَ جِدّاً، فَدَفَعَ قَبْلَ أنْ تَطْلُعَ الشَّمْسُ ."

                , 1

                ,  "مسلم (2/ 891) [برقم (1218)]."


                )}

                ) ,



        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////


      new  HeadZikrObject( "121",  "التكبير عند رمي الجمار الجمرات مع كل حصى الحصى الرمي منى الحج الحاج الإحرام" ,"التَّكْبِيرُ عِنْدَ رَمْي الجِمَارِ مَعَ كُلِّ حَصَاةٍ" ,new ZikrObject[]{


               new ZikrObject(UUID.randomUUID().toString(),  "يُكَبِّرُ كُلَّمَا رَمَى بِحَصَاةٍ عِنْدَ الجِمَارِ الثَّلاثِ ، ثُمَّ يَتَقَدَّمُ ، وَيَقِفُ يَدْعُوْ مُسْتَقْبِلَ القِبْلَةِ ، رَافِعاً يَدَيْهِ بَعْدَ الجَمْرَةِ الأوْلَى والثَّانِيةِ ، أمَّا جَمْرَةُ العَقَبَةِ فيَرْمِيهَا ، ويُكَبِّرُ عِنْدَ كُلِّ حَصَاةٍ ، ويَنْصَرِفُ ، ولا يَقِفُ عِنْدَهَا"

                ,  1

                ,  "البخاري مع الفتح ٣ / ٥٨٣ برقم : ١٧٥١ ، وانظر لفظه هناك ، والبخاري مع الفتح ٣ / ٥٨٣ - ٥٨٤ - ٥٨١ برقم : ١٧٥٣ ، و رواه مسلم أيضا برقم : ١٢١٨ "


                )}
                ) ,


        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////


      new  HeadZikrObject("122", "ما يقول عند التعجب و الأمر السار العجب السرور الجميل الإنعجاب الانعجاب" ,  "مَا يَقُوْلُ عِنْدَ التَّعَجُّبِ والأمْرِ السَّارِّ" , new ZikrObject[]{


              new  ZikrObject(UUID.randomUUID().toString(),  "((  سُبْحَانَ اللهِ  ))"

                ,1

                , "البخاري مع الفتح (1/ 210)، و390، و414 ، [برقم (155)] ومسلم (4/ 1857) [برقم (1674)]."


                ) ,


       new ZikrObject(UUID.randomUUID().toString(),  "((  اللهُ أكْبَرُ  ))"

                , 1

                , "البخاري مع الفتح(8/ 441) [برقم (4741)]، وانظر: ((صحيح الترمذي)) (2/ 103)، و (2/ 235)، ومسند أحمد (5/ 218)."


                )}

                ) ,





        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////


     new  HeadZikrObject( "123",  "ما يقول عند التعجب و الأمر يفعل السار العجب السرور الجميل الإنعجاب  أتاه يسره يفرحه فرح الفرح الانعجاب" , "مَا يَفْعَلُ مَنْ أَتَاهُ أَمْرٌ يَسُرُّهُ" , new ZikrObject[]{


                new ZikrObject(UUID.randomUUID().toString(),  "كَانَ النَّبِيُّ  - صلى الله عليه وسلم -  إِذَا أَتَاهُ أَمْرٌ يَسُرُّهُ أَوْ يُسَرُّ بِهِ؛ خَرَّ سَاجِداً شُكْراً لِلهِ تَبَاركَ وَتَعَالى"

                ,  1

                ,  "رواه أهل السنن إلا النسائي [أبو داود برقم (2774) والترمذي برقم (1578)، وابن ماجة برقم (1394)]، وانظر: ((صحيح ابن ماجة)) (1/ 233)، و ((إرواء الغليل)) (2/ 226)."


                )}

                ) ,





        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////


       new HeadZikrObject("124",  "ما يقول و يفعل من أحس إحساس الإحساس الاحساس وجعا الوجع الألم الم في جسده الجسد البدن مرضا المرض " ,  "مَا يَقُولُ ويَفْعَلُ مَنْ أَحَسَّ وَجَعاً في جَسَدِهِ" ,new ZikrObject[]{


         new       ZikrObject(UUID.randomUUID().toString(),  "ضَعْ يَدَكَ عَلَى الَّذِي تَألَّمَ مِنْ جَسَدِكَ، وَقُلْ: بِسْمِ اللهِ (ثَلاثاً) \n وَقُلْ (سَبْعَ مَرَّاتٍ): أَعُوذُ باللهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أجِدُ وَأُحَاذِرُ"

                ,  7

                ,  "مسلم (4/ 1728) [برقم (2202)]."


                )}

                ) ,



        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////


     new   HeadZikrObject( "125",  "دعاء من خشي أن يصيب شيئا بعينه العين الحسد " ,  "دُعَاءُ مَنْ خَشِيَ أنْ يُصِيبَ شَيئاً بِعَيْنِهِ" ,new ZikrObject[]{


               new ZikrObject(UUID.randomUUID().toString(),  " إذَا رَأى أحَدُكُمْ مِنْ أخِيِهِ، أوْ مِنْ نَفْسِهِ، أوْ مِنْ مَالِهِ مَا يُعْجِبُهُ ،  فَلْيَدْعُ لَهُ بالبَرَكَةِ فَإنَّ العَيْنَ حَقٌّ ."

                , 1

                ,  "مسند أحمد (4/ 447)، وابن ماجة [برقم (3508)]، ومالك 3 / 118 - 119 ، وصححه الألباني في صحيح الجامع (1/ 212) [برقم (556)] ، وانظر تحقيق ((زاد المعاد)) للأرناؤوط (4/ 170)."


                )}

                ) ,



        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////


       new HeadZikrObject( "126", "ما يقال عند الفزع الخوف الرهبة" ,  "مَا يُقَالُ عِنْدَ الفَزَعِ" , new ZikrObject[]{



          new      ZikrObject(UUID.randomUUID().toString(), "((  لَا إِلَهَ إلاَّ اللهُ  ))"

                , 1

                ,  "البخاري مع الفتح (6/ 381) [برقم (3346)]، ومسلم (4/ 2208) [برقم (2880)]."


                )}
                ) ,


        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////


        new HeadZikrObject( "127",  "ما يقول عند الذبح أو النحر التضحية الأضحية الاضحية الأضحى الاضحى " ,  "مَا يَقُولُ عِنْدَ الذَّبْحِ أوِ النَّحْرِ" ,new ZikrObject[]{



        new        ZikrObject(UUID.randomUUID().toString(),  "(( بِسْمِ اللَّهِ وَاللهُ أكْبرُ  [ اللَّهُمَّ مِنْكَ وَلَكَ ] اللَّهُمَّ تَقَبَّلْ مِنِّي ))"

                ,  1

                ,  "مسلم (3/ 1557) [ برقم (1967) ] ، والبيهقي (9/ 287) ، وما بين المعقوفتين للبيهقي وغيره ، والجملة الأخيرة سقتها بالمعنى من رواية مسلم."


                )}

                ) ,



        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////


      new  HeadZikrObject( "128",  "ما يقول لرد رد كيد الكيد مردة الشياطين الجن الشيطان مكر" , "مَا يَقُولُ لِرَدِّ كَيْدِ مَرَدَةِ الشَّيَاطِينِ" , new ZikrObject[]{



              new  ZikrObject(UUID.randomUUID().toString(),  "(( أعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ ، الَّتِي لا يُجَاوِزُهُنَّ بَرٌّ وَلَا فَاجِرٌ مِنْ شَرِّ مَا خَلَقَ ، وبَرَأَ وذَرَأ ، وَمِنْ شَرِّ مَا يَنْزِلُ مِنَ السَّمَاءِ ، وَمِنْ شَرِّ مَا يَعْرُجُ فِيهَا ، وَمِنْ شَرِّ مَا ذَرَأَ فِي الأرْضِ ، وَمِنْ شَرِّ مَا يَخْرُجُ مِنْهَا ، وَمِنْ شَرِّ فِتَنِ اللَّيْلِ والنَّهَارِ ، ومِنْ شَرِّ كُلِّ طَارِقٍ إلاَّ طَارِقاً يَطْرُقُ بِخَيْرٍ يَارَحْمنُ ))"

                ,  1

                ,  "أحمد (3/ 419) بإسناد صحيح، وابن السني برقم (637)، وصحح إسناده الأرناؤوط في تخريجه للطحاوية (ص 133)، وانظر : مجمع الزوائد (10/ 127)."


                )}

                ) ,



        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////


     new   HeadZikrObject( "129",  "الاستغفار و التوبة الإستغفار الذنوب الذنب " , "الاسْتِغْفَارُ والتَّوْبَةُ" , new ZikrObject[]{


             new   ZikrObject(UUID.randomUUID().toString(), "قَالَ رَسُولُ اللهِ  - صلى الله عليه وسلم - :  (( واللهِ إنِّي لأسْتَغْفِرُ اللهَ وأتُوبُ إلَيْهِ فِي اليَوْمِ أكْثَرَ مِنْ سَبْعِينَ مَرَّةٍ ))"

                ,70

                ,"البخاري مع الفتح (11/ 101) [برقم (6307)]."


                ),


   new     ZikrObject(UUID.randomUUID().toString(), "وَقالَ رَسُولُ اللهِ  - صلى الله عليه وسلم - :  (( يَا أيُّهَا النَّاسُ تُوبُوا إلَى اللهِ، فَإنِّي أتُوبُ إلَيْهِ مِئَةَ مَرَّةٍ ))"

                ,100

                ,"مسلم (4/ 2076). [برقم (2702)]."


                ),


       new ZikrObject(UUID.randomUUID().toString(), "وَقَالَ رَسُولُ اللهِ  - صلى الله عليه وسلم - :  (( مَنْ قَالَ أسْتَغْفِرُ اللهَ العَظيمَ الَّذِي لا إلَهَ إلاَّ هُوَ الحَيُّ القَيُّومُ وأتُوبُ إلَيْهِ ، غَفَرَ اللهُ لَهُ، وَإنْ كَانَ فَرَّ مِنَ الزَّحْفِ ))"

                ,1

                ,"أبو داود (2/ 85) [برقم (1517)]، والترمذي (5/ 569) [برقم (3577)]، والحاكم وصححه ووافقه الذهبي (1/ 511)، وصححه الألباني، انظر: ((صحيح الترمذي)) (3/ 182)، و ((جامع الأصول لأحاديث الرسول - صلى الله عليه وسلم -))، (4/ 389 - 390) بتحقيق الأرناؤوط."


                ),


      new  ZikrObject(UUID.randomUUID().toString(), "وَقَالَ  - صلى الله عليه وسلم - :  (( أقْرَبُ مَا يَكُونُ الرَّبُّ مِنَ العَبْدِ، فِي جَوْفِ اللَّيْلِ الآخِرِ؛ فَإنِ اسْتَطَعْتَ أنْ تَكُونَ مِمَّنْ يَذْكُرُ اللهَ فِي تِلْكَ السَّاعَةِ؛ فَكُنْ ))"

                ,1

                ,"الترمذي [برقم (3579)]، والنسائي (1/ 279)، والحاكم وانظر: ((صحيح الترمذي)) (3/ 183)، و ((جامع الأصول)) بتحقيق الأرناؤوط (4/ 144)."


                ),


      new  ZikrObject(UUID.randomUUID().toString(), "وَقَالَ  - صلى الله عليه وسلم - :  (( أقْرَبُ مَا يَكُونُ العَبْدُ مِنْ رَبِّهِ، وَهُوَ سَاجِدٌ فأكْثِرُوا الدُّعَاءَ ))"

                ,1

                ,"مسلم (1/ 350) [برقم (482)]."


                ),


    new    ZikrObject(UUID.randomUUID().toString(),"وَقَالَ  - صلى الله عليه وسلم - :  (( إنَّهُ لَيُغَانُ عَلَى قَلبِي، وَإنِّي لأسْتَغْفِرُ اللهَ فِي اليَوْمِ مِئَةَ مَرَّةٍ )) ."

                ,100

                ,"أخرجه مسلم (4/ 2075) [برقم (2702)]، \n قال ابن الأثير: (ليغان على قلبي) أي ليغطى ويغشى والمراد به: السهو؛ لأنه كان صلى الله عليه وسلم لا يزال في مزيد من الذكر والقربة ودوام المراقبة فإذا سها عن شيء منها في بعض الأوقات، أو نسي، عده ذنبا على نفسه ففزع إلى الاستغفار. انظر جامع الأصول 4 / 386."


                )}

                ) ,





        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////


        new HeadZikrObject( "130",  "فضل التسبيح التحميد التهليل التكبير الذكر الأذكار ذكر الله " ,  "فَضْلُ التَّسْبِيحِ وَالتَّحْمِيدِ، والتَّهْلِيلِ، وَالتَّكْبِيرِ" ,new ZikrObject[]{



             new   ZikrObject(UUID.randomUUID().toString(),  "قَالَ  - صلى الله عليه وسلم - :  (( مَنْ قَالَ :  سُبْحَانَ اللهِ وَبِحَمْدِه فِي يَوْمٍ مِئَةَ مَرَّةٍ ، حُطَّتْ خَطَايَاهُ ، وَلَوْ كَانَتْ مِثْلَ زَبَدِ البَحْرِ )) ."

                ,  100

                , "البخاري (7/ 168) [برقم (6405)]، ومسلم (4/ 2071) [برقم (2691)]"


                ) ,


      new  ZikrObject(UUID.randomUUID().toString(),  "وَقَالَ  - صلى الله عليه وسلم - :  (( مَنْ قَالَ :  لَا إِلَهَ إِلاَّ اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ ، وَلَهُ الحَمْدُ ، وَهُوَ عَلَى كُلِّ شَيءٍ قَدِيرٌ عَشْرَ مِرَارٍ ، كَانَ كَمَنْ أعْتَقَ أرْبَعَةَ أنْفُسٍ مِنْ وَلَدِ إسْمَاعِيلَ )) ."

                ,  10

                ,  "البخاري (7/ 67)، ومسلم بلفظه (4/ 2071)"


                ) ,


       new ZikrObject(UUID.randomUUID().toString(), "وَقَالَ  - صلى الله عليه وسلم - :  (( كَلِمَتَانِ خَفِيفَتانِ عَلَى اللِّسَانِ ، ثَقِيلَتَانِ فِي المِيزَانِ ، حَبِيْبَتَانِ إِلَى الرَّحْمَنِ : سُبْحَانَ اللَّهِ وَبِحَمْدِهِ ، سُبْحَانَ اللهِ العَظِيمِ ))"

                ,  1

                ,  "البخاري (7/ 168) [برقم (6404)]، ومسلم (4/ 2072) [برقم (2694)]."


                ) ,


       new ZikrObject(UUID.randomUUID().toString(), "وَقَالَ  - صلى الله عليه وسلم - :  (( لَأَنْ أقُولَ: سُبْحَانَ الله ِ، والْحَمْدُ للهِ ، وَلا إلَهَ إلاَّ اللهُ ، وَاللهُ أكْبَرُ ، أحَبُّ إلَيَّ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْسُ ))"

                ,  1

                , "مسلم (4/ 2072) [برقم (2695)]."


                ) ,


     new   ZikrObject(UUID.randomUUID().toString(), "وَقالَ  - صلى الله عليه وسلم - :  (( أيَعْجِزُ أحَدُكُمْ أنْ يَكْسِبَ كُلَّ يَوْمٍ أَلْفَ حَسَنَةٍ ))  فَسَألَهُ سَائِلٌ مِنْ جُلَسَائِهِ : كَيْفَ يَكْسِبُ أحَدُنَا ألْفَ حَسَنَةٍ ؟ قَالَ : (( يُسَبِّحُ مِئَةَ تَسْبِيْحَةٍ ، فَيُكْتَبُ لَهُ أَلْفُ حَسَنَةٍ ، أوْ يُحَطُّ عَنْهُ ألْفُ خَطِيْئَةٍ ))"

                , 100

                ,  "مسلم (4/ 2073) [برقم (2698)]."


                ) ,


      new  ZikrObject(UUID.randomUUID().toString(),  "(( مَنْ قَالَ :  سُبْحَانَ اللهِ العَظِيمِ وَبِحَمْدِهِ ، غُرِسَتْ لَهُ نَخْلَةٌ فِي الجَنَّةِ ))"

                , 1

                ,  "أخرجه الترمذي (5/ 511) [برقم (3464)] ، والحاكم (1/ 501) وصححه ووافقه الذهبي، وانظر : صحيح الجامع (5/ 531) ، وصحيح الترمذي (3/ 160) ."


                ) ,


    new    ZikrObject(UUID.randomUUID().toString(),  "وَقَالَ  - صلى الله عليه وسلم - :  (( يَا عَبْدَ اللهِ بْنَ قَيْسٍ ، أَلاَ أدُلُّكَ عَلَى كَنْزٍ مِنْ كُنُوزِ الجَنَّةِ ؟ )) فَقُلتُ: بَلَى يَا رَسُولَ الله ِ، قَالَ :  (( قُلْ لاَ حَوْلَ وَلاَ قُوَّةَ إلاَّ باللهِ ))"

                ,  1

                , "البخاري مع الفتح (11/ 213) [برقم (4206)]، ومسلم (4/ 2076) [برقم (2704)."


                ) ,


     new   ZikrObject(UUID.randomUUID().toString(),  "وقَالَ  - صلى الله عليه وسلم - :  (( أحَبُّ الكَلامِ إلَى اللهِ أرْبعٌ : سُبْحَانَ الله ِ، وَالْحَمْدُ للهِ ، وَلا إلَهَ إلاَّ الله ُ، واللهُ أكْبَرُ ، لا يَضُرُّكَ بأيِّهِنَّ بَدأْتَ ))"

                ,  1

                , "مسلم (3/ 1685) [برقم (2137)]."


                ) ,


       new ZikrObject(UUID.randomUUID().toString(),  "جَاءَ أعْرَابِيٌّ إلَى رَسُولِ اللهِ  - صلى الله عليه وسلم -  فَقَالَ: عَلِّمْنِي كَلاماً أقُولُهُ ؟ قَالَ : (( قُلْ : لا إلَهَ إلاَّ اللهُ وَحْدَهُ لا شَرِيْكَ لَهُ ، اللهُ أكْبَرُ كَبيراً ، وَالحَمْدُ للَّهِ كَثِيراً ، سُبْحَانَ اللَّهِ رَبِّ العَالمِينَ ، لَا حَوْلَ وَلا قُوَّةَ إلاَّ باللَّهِ العَزِيزِ الحَكِيمِ )) ، قَالَ : فَهَؤُلاءِ لِرَبِّي فَمَا لِي ؟ قَالَ : (( قُلْ : اللَّهُمَّ اغْفِر لِي ، وَارْحَمْنِي ، وَاهْدِنِي ، وَارْزُقْنِي ))"

                , 1

                ,
                "مسلم (4/ 2072) [برقم (2696)] وزاد أبو داود 1 / 220 : فلما ولَّى الأعرابي قال النبي صلى الله عليه وسلم: لقد ملأ يديه من الخير ."


                ) ,


       new ZikrObject(UUID.randomUUID().toString(),  "كَانَ الرّجُلُ إذَا أَسْلَمَ عَلَّمَهُ النبيُّ  - صلى الله عليه وسلم -  الصَّلاةَ ، ثُمَّ أمَرَهُ أنْ يَدْعُوَ بِهَؤُلَاءِ الكَلِمَاتِ : (( اللهُمَّ اغْفِر لي ، وارْحَمْنِي ، واهْدني ، وعافِني ، وارْزُقني ))"

                ,  1

                , "مسلم (4/ 2073) [برقم (3697)]  وفي رواية له أيضاً : فإن هؤلاء تجمع لك دنياك وآخرتك"


                ) ,


       new ZikrObject(UUID.randomUUID().toString(),  "(( إِنَّ أَفْضَلَ الدُّعَاءِ : الحَمْدُ لِلَّه ِ، وأفْضَلُ الذِّكْرِ : لَا إِلَهَ إِلاَّ الله ))"

                , 1

                ,  "الترمذي (5/ 462) برقم (3383)، وابن ماجه (2/ 1249) برقم (3800)، والحاكم (1/ 503)، وصححه ووافقه الذهبي، وانظر ((صحيح الجامع)) (1/ 362) ."


                ) ,


      new  ZikrObject(UUID.randomUUID().toString(),  "(( البَاقِيَاتُ الصَّالحَاتُ : سُبْحَانَ اللَّهِ ، وَالْحَمْدُ لله ِ، وَلَاَ إِلَهَ إِلاَّ الله ُ، وَاللهُ أكْبَرُ ، وَلاَ حَوْلَ وَلَا قُوَّةَ إِلاَّ بِاللهِ ))"

                ,1

                ,  "أحمد برقم : ٥١٤  بترتيب أحمد شاكر ، \n وانظر مجمع الزوائد ١ / ٢٩٧ ، و عزاه ابن حجر في بلوغ المرام من رواية أبي سعيد إلى النسائي في الكبرى برقم : ١٠٦١٧ ، و قال : صححه ابن حبان برقم : ٨٤٠  و الحاكم برقم : ١ / ٥٤١  "


                )}
                ) ,





        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////


        new HeadZikrObject("131",  "كيف كان النبي يسبح تسبيح ذكر الله الأذكار الاذكار" ,"كَيْفَ كَانَ النَّبيُّ ﷺ يُسَبِّحُ ؟" , new ZikrObject[]{



              new  ZikrObject(UUID.randomUUID().toString(),  "عَنْ عَبْدِ اللهِ بْنِ عَمْروٍ  - رضي الله عنهما -  قَالَ :  (( رأيْتُ النَّبيَّ  - صلى الله عليه وسلم -  يَعْقِدُ التَّسْبِيحَ  )) وفي زياده (( بِيَمِينهِ ))"

                ,  1

                , "أخرجه أبو داود بلفظه (2/ 81) [برقم (1502)]، والترمذي (5/ 521) [برقم (3486)]، وانظر: ((صحيح الجامع)) (4/ 271) برقم (4865)، وصححه الألباني في صحيح سنن أبي داود ، (411/1)."


                )}
                ) ,





        ///////////////////////////////////    أذكار النوم    ////////////////////////////////
        ///////////////////////////////////    أذكار النوم    ////////////////////////////////


       new HeadZikrObject("132", "من أنواع الخير و الآداب الجامعة الأداب الأدب الأخلاق الاخلاق " , "مِنْ أنْوَاعِ الخَيْرِ والآدَابِ الجَامِعَةِ" , new ZikrObject[]{


               new ZikrObject(UUID.randomUUID().toString(), "قال النبي ﷺ : (( إذَا كَانَ جُنْحُ اللَّيْل - أوْ أمْسَيْتُم - فَكُفُّوا صِبْيَانَكُمْ ؛ فَإِنَّ الشَّيَاطِيْنَ تَنْتَشِرُ حِيْنَئذٍ ، فَإذَا ذَهَبَ سَاعَةٌ مِنَ اللَّيْلِ فَخَلُّوهُمْ ، وأغْلِقُوا الأَبْوَابَ ، وَاذْكُرُوا اسْمَ اللَّهِ ؛ فَإِنَّ الشَّيْطَانَ لَا يَفْتَحُ بَاباً مُغْلَقاً ، وَأوْكُوا قِرَبَكُمْ ، واذْكُرُوا اسْمَ اللَّهِ ، وَخَمِّرُوا آنِيَتَكُمْ وَاذْكُرُوا اسْمَ اللَّه ِ، وَلَوْ أنْ تَعْرِضُوا عَلَيْهَا شَيْئاً، وَأطْفِئُوا مَصَابِيحَكُمْ ))"


                       , 1

                       , "البخاري مع ((الفتح)) (10/ 88) [برقم (5623)]، ومسلم (3/ 1595) [برقم (2012)]."


               )


       }

                ) ,

    };

    public HeadZikrObject[] GetAllAzkar() {
        return AllAzkarArray;
    }
}
